{"abathur":[{"details":"Global heroes such as Falstad and Dehaka can limit his split pushing power and soaking effectiveness by either pushing the lane back and flying into a fight or killing him outright by surprise.","type":"Counter","patch":"Kael'thas","realVotes":34},{"details":"Careful not to fight much before level 10. Abathur teams want to maximize soak and then fight when Abathur can clone one of your teammates.","type":"Helper","patch":"Kael'thas","realVotes":31},{"details":"Effective use of double soaking lane XP is critical.  This often means positioning your body close enough to minions in one lane to receive XP while using your Q (symbiote) in a different lane.   Be aware of stealth and global heroes that may try to gank you when body soaking a lane.  During objective spawns, use your Z to travel to the furthest lane from the objective to soak, then use Q to either assist your team during fight or double soak another lane.","type":"As","patch":"Kael'thas","realVotes":43},{"details":"Look at the talent an Abathur picks at level 1.  Healing microbes is a nice heal but requires staying out of combat to keep the shield and heal up.","type":"Helper","patch":"Kael'thas","realVotes":-1},{"details":"See mines in a clever dense plot somewhere nearby?  Try luring your enemies into following you through them!","type":"Helper","patch":"Kael'thas","realVotes":15},{"details":"Abathur can really let your team snowball and get ahead a few levels. Take advantage of this and push for objectives early. Try to win in the mid-game because after level 20 the teams start to even out and you will have lost your advantage.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"Always keep your mines on cooldown by leaving your symbiote partner and placing them periodically to maximize efficiency.  Try to do this when it is safe to disengage and not during a fight.","type":"As","patch":"Kael'thas","realVotes":13},{"details":"Abathur's bugs always spawn from Abathur and then goes to the nearest lane.  You can use this to pinpoint Abathur's location.  Careful when the enemy is level 20!  Abathur can leave a drone nodule to spew out bugs with a level 20 talent, and this talent must be checked against to use this strategy.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"The Lost Vikings completely counter Abathur.  Abathur relies on having an empty lane to push, and a good Vikings player never leaves a lane open.  Just put Baelog in Abathur's lane and he'll have a real bad time.","type":"Counter","patch":"Kael'thas","realVotes":12},{"details":"Try not to stand near Abathur's mines when the enemy team is shooting skill shots at you.\nThis will destroy his mines and waste their potential.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"Put mines in the area between lanes to slow down enemy rotations.","type":"As","patch":"Kael'thas","realVotes":24},{"details":"When playing with chromie and you suspect you know abathur's location, you can use Timewalker's Pursuit to verify his location, and if he's there, W Q him into oblivion.","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Try to space your mines apart on commonly traveled areas to constantly dismount enemies trying to rotate. Plan it so that they'll hit a mine, dismount, remount, then hit another mine.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Always destroy Abathur mines if you see him placing them near you! It only takes a couple of autos. They might not hit you now, but someone will walk into them later!","type":"Counter","patch":"Kael'thas","realVotes":21},{"details":"Always listen to your Abathur teammate - he has the best map awareness in the team.","type":"Helper","patch":"Kael'thas","realVotes":11},{"details":"Do not waste your time symbioting other players if a team fight is seem to be won. Say If you already killed 3 member of the enemy team, It is better to create lane pressure.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"If you are on a map that has an objective that keeps everyone away from the lane (Battlefield of Eternity, Haunted Mines, ect.) and your team can poke safely, dragging out the objective may be in your best interest. \n\nThe longer it goes, the bigger of an XP lead Abathur can get your team. The enemy will either fall behind in XP or be forced to send someone clear waves, giving you an advantage at the objective.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"If you have a Rexxar on your team, you might consider taking the Hivemind talent at lvl 20.   Since Rexxar and Misha are generally close to each other you can have a somewhat more reliable dual symbiote with them.  You can symbiote either one to have the same effect (besides who you prefer has the main symbiote of the two).","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Don't underestimate the Carapace build for networking shields on lane creeps and teammates during fights. The extra healing can assist your healer or provide some heals if you don't have one.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Always engage in meele fights to maximize the slap value","type":"Counter","patch":"Kael'thas","realVotes":-5},{"details":"Avoid playing Abathur on Tomb of the Spider Queen. He has no way to help make up for the lack of bodies to collect gems, and the close lanes means it's extremely unlikely to get a lane to yourself for body soaking (let alone gem collection).","type":"As","patch":"Kael'thas","realVotes":10},{"details":"Unless you have some reason to keep your Symbiote on a teammate (such as the talent Adrenal Overload), don't. By cancelling and recasting it, you can use your offensive abilities more often.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"abathur is not very good at handling sudden trips to the hospital so if you can catch him off guard and send him to the ER your team will benefit","type":"Counter","patch":"Kael'thas","realVotes":-3},{"details":"I belive this interaction between the two talents was removed.","type":"As","patch":"Kael'thas","realVotes":-7},{"details":"Be very aware of abathur's talent choices. Depending on how he builds he will either be very aggressive in his pushing power, or very aggressive in his team fight potential. React accordingly. If he builds for fights, avoid team fights, and emphasize diminishing his splitting power. If he builds for pushing, force fights and control objectives.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"Abathur's melee is very weak thus never go melee and only go melee if you want to bm the enemy","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Report them for playing Abathur","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Dont","type":"As","patch":"Kael'thas","realVotes":-10},{"details":"When hiding in a bush double soaking lanes, place mines around your body so if you do get caught your odds of escape are greater (especially with the slow from vile nest at 7)","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Your early game is weak as your teammates will be 4v5 in terms of bodies to soak damage. Later on in the game you will need to help pick out favourable engagements for your team by regularly communicating your Ultimate Evolution cooldown and when you intend to use it, so that your whole team will commit aggressively to a team fight when you ult.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"blublublu","type":"As","patch":"Kael'thas","realVotes":-4},{"details":"As Abathur, be especially concerned about Medivh. With Raven Form, Medivh doesn't have to approach you through normal paths and doesn't step on mines, which makes it harder to spot him approaching. With Force of Will and Portal, a good Medivh can even tower dive you briefly.","type":"As","patch":"Kael'thas","realVotes":0}],"alarak":[{"details":"Use your W into your Q. It sounds like dumb advice, but there are always Alarak players that don't do this.","type":"As","patch":"Kael'thas","realVotes":22},{"details":"Your W is a REALLY versatile tool. It can secure kills, interrupt channelings, get you or your teammates out of danger, etc. Remember to make use of its full potential.","type":"As","patch":"Kael'thas","realVotes":19},{"details":"Kill him","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Use E as not just poke tool, but self-sustain tool. Try to maximize every use of it and cast it whenever you don't have full health (i.e. tried to do W-Q combo before and were damaged a bit). \n\nHitting only one hero usually is not worth, so try to hit multiple people AND heal from it. Try to minimize casts of it when you're at full health.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"Against heavily mobild heroes such as Tracer, Illidan, Valla taking Reckless Strike (faster Discord Strike) can be good cause delay from it is easy to dodge.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Don't silence just for silence. Try to use most of it (if Tracer is silenced, she can't blink and recall - attack her with auto-attacks and everything you have!) try to also keep in mind enemy cooldowns (approximately). If you didn't attack enemy Valla for at least 10 seconds, it means she will be able to use Vault to escape your Discord strike even after being pulled by Telekinesis.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Telekenesis is a good tool for setting up high damage combos, but don't use it solely for aiming discord strike. Use it liberally in team fights to reposition, interrupt channels, and peel for allies.","type":"As","patch":"Kael'thas","realVotes":13},{"details":"Whatever you do, don't stand still near him. His combo is much harder to properly execute if you move about.","type":"Counter","patch":"Kael'thas","realVotes":18},{"details":"Self-casting W (alt+W) will push your character forward to the direction he is facing. You can use this as an escape or to catch that last surviving enemy.","type":"As","patch":"Kael'thas","realVotes":34},{"details":"Be ready to follow up on Alarak W skill (telekinis) Easy kills if you have proper team and comp.","type":"Helper","patch":"Kael'thas","realVotes":19},{"details":"Alarak is not as smart as he looks. Use his high selfesteem   to your advantage.","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Lightning Surge is one of the more dangerous Poke abilities in the game- short cooldown, great range, and it heals him. Do NOT get into an attrition battle from afar with Alarak on your own if you can't close on him safely or return his Ranged assaults. Have someone rotate to help or just switch.","type":"Counter","patch":"Kael'thas","realVotes":11},{"details":"Is this google?","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Heroes with good CC or AOE dmg are good with Alarak such as Malf root, ETC, Jaina. As a tank try your best to peel for Alarak in case he messes up since most Alarak usually position aggressively to make plays.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Look for Alarak counterstrike and sidestep it. Try to save your polymorph, stun, knockback and other CC for him as they will cancel his Q during its cast animation, the window is short though, 0.5s.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Go into trymode and practice his combo W into Q on different scenarios, close range, mid range, max range. Your best practice dummy is Tracer as she moves around more often while shooting you (good for practicing CounterStrike as well), Valeera as she always uses Vanish and move around a lot in stealth, Vikings as you can practice your combo and E against multiple targets.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"In Lategame, Alarak is both incredibly vulnerable but also incredibly strong. Wait for the opportunity to Deadly Charge -> Counterstrike the Backline. \n\nCounterstrike also is great against things like Auriels Aegis (time it and it's basically a free kill, Aegis triggers CS and already low health Target goes bye bye).","type":"As","patch":"Kael'thas","realVotes":0},{"details":"FAST STACKING TIP: If you take level 7 Endless Energy talent remember that you do not need to hit 2 heroes to get a stack. You can easily stack it even in solo lane by HITTING MINIONS behind the hero. Use your W to set enemy hero in line with enemy minions.","type":"As","patch":"Kael'thas","realVotes":2}],"anubarak":[{"details":"Choose AA heroes such as Raynor, Valla, or Zul'Jin. He has magic armor, but has a low health pool and can only increase it with his W shield.","type":"Counter","patch":"Kael'thas","realVotes":7},{"details":"Choose Anub'arak when the enemy has a low of magic damage or mainly magic damage since his magic armor (which can be up to 75% with dampen magic at level one) can be powerful. He can also counter Cho'gall with his Cocoon alt.","type":"As","patch":"Kael'thas","realVotes":9},{"details":"Be wary of when to use Burrow Charge to initiate, as it is Anub's only escape.","type":"As","patch":"Kael'thas","realVotes":20},{"details":"Follow up when Anub'arak engages. He has a very strong opener but soon becomes vulnerable to counter attack. If you go in with him after he engages properly, chances are youll win the fight.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Don't spam your shield mindlessly. Use it to dampen skillshots or when you're being focused.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"When deciding on Heroics, a general rule of thumb is: Cocoon if they have someone you can't reliably hit with your own crowd control (e.g., Tracer) and Locust Swarm if there isn't a particularly obvious target for Cocoon.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Anub'arak is unrivaled in his ability to block spells. With an innate spell armor that he can amplify through talents if he doesn't simply avoid it outright through the use of his Beetles. His HP isn't particularly high, but his ability to gain an enormous amount of lifesteal (the \"Beetle Build\") mitigates this issue. That said, his enemy is a very quick burst of physical damage that forces him to use his Burrow Charge as an escape. A good Anub'arak will almost certainly be saving it for that purpose, and because it makes him Unstoppable, crowd-controlling him is difficult without having initiative. Anub'arak's efficiency and sustainability goes up the longer he stays in a fight, so get him out of the fight early, before he can swarm an area with beetles. Without Burrow Charge as an escape, Anub'arak's relatively low defensive stats (particularly against physical damage) will make it so he has a very difficult time staying alive in a fight without considerable help.","type":"Counter","patch":"Kael'thas","realVotes":2}],"artanis":[{"details":"Artanis has a fairly difficult combo to execute effectively.  Use Q first to travel in a desired direction, then as soon as you begin to return to your original position, throw out E.  This will swap your opponent a large distance allowing your team to kill an out of position enemy.  Many variations on this swap can be made including first using Q in reverse, or even using Q in one direction and E in another.","type":"As","patch":"Kael'thas","realVotes":15},{"details":"Uthers Stun is the perfect follow up for Artanis W.","type":"Helper","patch":"Kael'thas","realVotes":-9},{"details":"Always be ready to make a sidestep if he dashes in your direction, the prism will come.","type":"Counter","patch":"Kael'thas","realVotes":25},{"details":"Pay careful attention to when Artanis uses blade dash. He may try to swap you out of position for an easy kill.","type":"Counter","patch":"Kael'thas","realVotes":10},{"details":"Stuns and attack speed slows are necessary peel to keep Artanis off your squishes.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Blinds are great against Artanis as they temporarily prevent him for lowering his shield CD through his AAs.","type":"Counter","patch":"Kael'thas","realVotes":17},{"details":"Artanis does not gain Unstoppable when Blade Dashing. Using a stun or displacement ability like Diablo's Overpower in mid-arc will make Artanis regret dashing.","type":"Counter","patch":"Kael'thas","realVotes":12},{"details":"If he hangs back, he is preparing for a long ranged swap most likely. Watch out for it and be prepared to capitalize on it!","type":"Helper","patch":"Kael'thas","realVotes":14},{"details":"In general, when dueling, save your Q and W until your trait is on cooldown to keep your shield up as much as possible.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"You can use a variant of the Q+E combo to peel for an ally and do other unexpected displacements: stand directly next to an enemy, Q away from them and as fast as you can after pressing Q, throw and E onto them. This swaps them to the far point of your dash.","type":"As","patch":"Kael'thas","realVotes":8},{"details":"Always make sure to asses the situation before going in, just because you can make a swap does NOT mean you always should.","type":"As","patch":"Kael'thas","realVotes":9},{"details":"Artanis isn't a very good tank. If the team has solo Artanis as their \"tank\" just build a dive comp and their backline is toast. He will just flip your team closer to his squishies that he can't peel you off.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Don't choose him as a tank, he is a bruiser so see if your team is squishy. If they are, consider choosing a tank like muradin or Joh to help him.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"As Artanis, his shields activate when his health is missing, so don't be afraid to trade","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Artanis has great engage but absolutely 0 disengage or chase. If the duel is unfavorable to you, just run away; when youve got the upperhand, go hard.\nKeep in mind he can swap you so dont give him a chance to use it as an escape.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"Both of your ults have global range. Remember to keep an eye on the minimap (you should do that with every hero!) and look out for good opportunities to use them.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Other than Lili, Auriel is also a good support counter against Artanis. Try to whip him back when he dashes, and get the blind talent on Q. When someone gets swapped out of position in the middle of the enemy team, Crystal Aegis gives your team time for a counter-play.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"Varian's (talented) ability to break through shields is a very good counter to Artanis. Varian can also charge/stun (lvl4) Artanis during his dash, leaving him out of position for your team to burst","type":"Counter","patch":"Kael'thas","realVotes":7},{"details":"Your ults can serve as more than just damage (and blind in Suppression Pulse's case). As both are global, you can interrupt objective channels (Dragon shrine for example), or scout with Suppression Pulse (check if the enemies are camping for a trap). Purifier Beam can be used to zone off a squishy, or at least force them to keep moving (Chromie and Gul'dan come to mind).","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Arthas' 13th level talent \"Frigid Winds\" reduces attack speed up to 40%, making this hero a considerable choice to counter Artanis.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Blade Dash does low damage, and does not actually move you forward. Do not use it to try to escape. If you want a Trait reset, your basic attacks reduce the cooldown faster than mediocre dashes, and they also deal more damage.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"If you play vs Xul you can time your Q so that his root procs when you are away. It works with other roots as well but Xul's is the most common & easy to use in your advantage.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Pay attention to when Artanis swap. Phase Prism has a long 16 second cooldown, compared to, at most, a 10 second cooldown on Blade Dash. If he has recently attempted to swap, then don't worry about juking another swap soon after.","type":"Counter","patch":"Kael'thas","realVotes":0}],"arthas":[{"details":"Aim for his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Consider executioner talent when playing with Arthas.","type":"Helper","patch":"Kael'thas","realVotes":15},{"details":"Activate frostmorn hungers (D) right after you see an auto attack hit on the target. This will minimize the time between auto attacks and maximize burst.","type":"As","patch":"Kael'thas","realVotes":10},{"details":"Arthas is weak to kiting and ability burst damage.","type":"Counter","patch":"Kael'thas","realVotes":10},{"details":"Block Talents and Blinds are quite powerful against Arthas.","type":"Counter","patch":"Kael'thas","realVotes":-1},{"details":"Number 1 rule when playing Arthas – bodyblock! Since you slow people, it's easy to do.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"Sindragosa disables buildings, consider taking it on maps with a summon from objective.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Mana reduction talent is a trap. Also don't take Q talents without Immortal Coil.","type":"As","patch":"Kael'thas","realVotes":-2},{"details":"Breaking frostmourne will render Arthas powerless. Try to pick heroes with holy powers that can stand against arthas.","type":"Counter","patch":"Kael'thas","realVotes":-2},{"details":"Since Arthas lacks mobility, he needs the help of his allies to start engagements. Combinations like Kerrigan's or Alarak's can allow Arthas to follow up with slows and roots to apply pressure.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Remember to cast your W root where the enemy will be, not where they are. When you root an out of position enemy hero, move to close range to put them in the  slow of frozen tempest (E). Position to body block the target and keep them slowed inside your E.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"<b>Follow your Arthas!</b>","type":"Helper","patch":"Kael'thas","realVotes":-1},{"details":"document.getElementsByTagName('p')","type":"As","patch":"Kael'thas","realVotes":-6},{"details":"Countering is impossible. There must always be a Lich King.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"Now that Lucio, The Freedom Fighting DJ, has entered the Nexus, try building full frozen tempest (E) build with him. Your slow plus his speed can do wonders.","type":"As","patch":"Kael'thas","realVotes":1}],"auriel":[{"details":"If someone picks Auriel on your  team then you want to try to pick a battery for her like Sonya or Gul'dan. Usually you want a strong frontline to allow her to have constant AoE burst healing.","type":"Helper","patch":"Kael'thas","realVotes":18},{"details":"When you pick Crystal Aegis the best use of it is to use it on a frontliner when they are low and you need time to build up energy after the enemy team has gotten close. After that, burst them back up with your heal and your enemy team will usually be in a bad spot.","type":"As","patch":"Kael'thas","realVotes":11},{"details":"Auriel synergizes well with heroes that provide large amounts of sustained damage.  The most common pairing is Valla, but others such as Gul'dan also work as effective energy generators for her.","type":"Helper","patch":"Kael'thas","realVotes":12},{"details":"If you can't get to Auriel directly, cut off her source of hope (energy/mana) by using CC or quickly focusing down her \"battery.\"  This is usually a sustained damage like Valla or Gul'dan.  Characters with a burst combo (Kerrigan, Jaina, etc) also provide Auriel with quick energy.","type":"Counter","patch":"Kael'thas","realVotes":14},{"details":"Never ever pick ressurect, its basicly useless 99 % of the time. if you take it, enemy team can just focus you down, and when you are dead, that ressurect seems pretty useless :)","type":"As","patch":"Kael'thas","realVotes":11},{"details":"Auriel is a great support in close quarters maps due to allways stunning when landing your E's and healing hitting more allies,","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Try to counter Auriel in the draft, by taking long range poke heroes that don't take damage when they poke.  Trading damage works in Auriel's favor as she has no mana to run out of.  Long range poke however gives no hope to Auriel, and thus no healing to her team.  Kael'thas is a strong pick not only for the long range flamestrikes, but for the counter-synergy of living bomb and Auriel's heal wanting to hit multiple targets.","type":"Counter","patch":"Kael'thas","realVotes":12},{"details":"Dont use the crown on a single target all the time. If kaelthas used his spells  this means he has around 5-6 secs of no damage output. Switch to crown to another hero that can do damage.","type":"As","patch":"Kael'thas","realVotes":20},{"details":"Mounting-up and flanking your enemy to E-stun to a wall is useful when the enemy team is on the retreat, and/or your team is engaging. Always consider your environment and who your team is focusing on as you can deny your team a kill just spamming E. Also it is easy to cosplay as Auriel, Just wear a hoodie, and unroll some tissue paper from your neck to hands. WIN! :)","type":"As","patch":"Kael'thas","realVotes":9},{"details":"Switch your hope generator often. It's cool down is very short. If you see your Nova about to burst someone down, crown her momentarily for a quick burst of hope, then switch back to your primary generator.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Your early game damage is quite high for a support, use this to your advantage and play aggressively to generate more hope.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"pick tyrael and shame her into going back into kitchen. female archangles are not fighting thus auriel has big titties in her demonic skin!!!! MAKE ME A SANDWICH WOMAN!!!!!!!!!!!!!!","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"CONSTANTLY review who has your crown. You should be asking yourself every few seconds, \"do I have a crown on someone in range?\" It's surprising how often the answer will be No if you haven't switched it recently. It's easy to run off to help with another lane or camp or skirmish and, in the heat of landing your abilities/heals, forget to reassign the Crown.","type":"As","patch":"Kael'thas","realVotes":10},{"details":"Zarya is a perfect companion. Together they have infinite sustain with lots of damage and waveclear.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Take advantage of her Crystal Aegis being predictable - Malfurion's Roots, Jaina's Blizzard and other AoE skills can be placed to hit her target when it ends. Baiting the Aegis out without blowing all your skills can be crucial for securing kills.","type":"Counter","patch":"Kael'thas","realVotes":5},{"details":"Stop using your E to do damage, chances are you'll just let a chased target escape","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Only build for damage on the heal if you have a very reliable generator (Gul'dan, Valla) or Cho'Gall. With Cho'Gall, full heal build is nigh unstoppable.","type":"As","patch":"Kael'thas","realVotes":0}],"azmodan":[{"details":"Great wave clear and global presence is the bane of a good Azmo.  If you have a Dehaka, he's going to have a bad time.","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"Azmo ramps up depending on his build, don't get overly concerned about his early game.  Much like playing with an Abathur he excels at split pushing while providing decent damage.  Stalling at objectives that all ten members are at creates ideal use of him.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Use spacebar to recenter the map on yourself often.   This is useful after dropping a General of Hell in another lane and not losing time in team fights, or sniping an objective while still pushing/travelling.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Sometimes it is best to save your General of Hell until cooldown for upcoming map objectives, try to always put him in an empty lane and be wary of where the enemy team is traveling to.","type":"As","patch":"Kael'thas","realVotes":9},{"details":"You can use your minions to scout bushes, this saves lives.","type":"As","patch":"Kael'thas","realVotes":20},{"details":"If you drop a minion in the right spot, it will clear the backline of a wave first, giving a much stronger push.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Muradin is a great counter to Azmo as he can quickly get in his face, body block and and stun his E ability, making it go on cooldown (and thus, wasting it).","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"If Li Ming is punishing your towers with skillshots, put a minion in front of it, so it blocks the attacks. \nIt can be used to block incoming damage from skillshots like stitches hook , nova triple tap etc.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"read nova snipe, not triple tap","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Be aggressive against a dunk build Azmodan. If you just sit back, he will repeatedly chunk your team for massive damage.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Azmo has no mobility, anything with dive will melt him. Illidan, kerrigan, zeratul, nova, alarak, etc.","type":"Counter","patch":"Kael'thas","realVotes":-1},{"details":"If there's a fight going on away from you, you can still help win fights by throwing globes at the enemy.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"If you have the Azmodunk skin you have a advantage because of your fresh moves","type":"As","patch":"Kael'thas","realVotes":7},{"details":"Use Bound Minion talent in catapults","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Demonic Invasion is best used on opposing forts or keeps, rarely should you use it in a team fight unless you can guarantee getting a kill or 2 from it. Use it like you would use a Merc Camp, just before objective or when the other team is distracted doing something else.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Azmodan is great with Johanna or Ragnaros (or all together) in roaming maps like Tomb of the Spider Queen and Dragon Shire. While Johanna gathers the minions, Azmodan can get Taste for Blood stacks and Ragnaros can also do his lvl 1 Empower Sulfuras quest at the same time.","type":"Helper","patch":"Kael'thas","realVotes":0}],"brightwing":[{"details":"Brightwing slowly heals every hero on her team, so try to make fights quick. If you let her team sit back, they'll win the long game.","type":"Counter","patch":"Kael'thas","realVotes":11},{"details":"Don't be afraid to use your abilities on cooldown - you can always B to your base and teleport right back to your team.","type":"As","patch":"Kael'thas","realVotes":10},{"details":"On large maps like infernal shrines, you can stay in lane and soak until the last second, then teleport into your team for the objective, this lets you maximize soak as the enemy team will either need to stay with you to most miss soak, and than walk to the objective, or leave you alone letting you get free exp.","type":"As","patch":"Kael'thas","realVotes":14},{"details":"use you polymorph with thought, try to hit targets that rely on their abilities and will be vulnerable without them, for example, hit Illidan as soon as he dives (he won't be able to auto attack for a 1.25 seconds, nor to use his abilities for mobility), butcher (after he charges, he'll want to butcher brand and heal, polymorph screws that) tracer (won't be able to blink / recall).\n\nalso. try to follow up on other heroes cc, for example etc slide -> polymorph","type":"As","patch":"Kael'thas","realVotes":11},{"details":"Try to rotate taking damage amongst all your team members by fighting in a non-committing way. She heals everyone at the same time, and she gets more Pixie Charm or Hyper Shift cooldown reduction if everyone is damaged.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Draft Brightwing against heavy sustained damage dealers and/or if you need disengage/counter dive.  Brightwing does best on teams that don't want to engage until they have the upper hand through poke or pick offs.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Single target burst damage.  \n\nBrightwing has very little she can do to save a singled out hero.  ETC/Diablo with a follow up dps like jaina will make Brightwing's life very difficult.","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"I generally avoid picking Brightwing when the other team already has a Kael'thas. His Living Bomb makes it much harder for BW to position for heals.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Remember that you can blink to friendly minions, Abathur mines, and Zagara creep tumors to escape from enemies.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"BW will heal regardless of if she is OOM. Don't rely on her mana levels to determine if you should fight.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"Split the enemy team with Emerald Winds. This will create a very large distance between the enemy tanks/fighters and their backline. Your assassins should have a field day.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"If a melee hero is attacking you, press alt+Q to instantly land Flare. The center will hit too. It's even better if you took cooldown reduction talent.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Bait out the polymorph if you have a Kerrigan or butcher, otherwise you'll have a sheeped maelstrom or charge.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Let Brightwing soak far lanes from the objective, and rotate earlier than you normally would. She will teleport when needed, and squeeze out a few more minion waves.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"If she takes Blink heal, and is in trouble, move closer to her in a retreat to provide an escape, preferably over impassable terrain.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"Should she choose Emerald Wind, help split the enemy team, allowing her to drive a wedge and secure a pick.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"Use pixie dust defensively, and save it for telegraphed damage. This is even more true if you chose shield dust. Use it wisely.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Careful to not be to aggressive and use ice block and emerald wind close together, as it will stop the ultimate early. Wait until the wind finishes, then pop it if needed.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"For sustained team fight maps with many walls (cursed, BoE, ToD) try opting for a full trait build with Emerald wind. You'll be surprised at the amount of healing, and can out-sustain most other comps.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"If she chooses Emerald Wind, be quick to punish a Brightwing bent on murder, as she has few escapes if she positioned too far to split your team.","type":"Counter","patch":"Kael'thas","realVotes":2}],"chen":[{"details":"Good stuns used while Chen is drinking will surely cripple his durability.","type":"Counter","patch":"Kael'thas","realVotes":8},{"details":"While Chen is absorbing damage drinking, that is your chance to engage.","type":"Helper","patch":"Kael'thas","realVotes":-5},{"details":"If being focused by Chen's Wandering Keg, walk vertically to escape it rather than horizontally, into the barrel. This forces Chen to redirect the barrel and can save you from being isolated.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Follow up with crowd control and damage on Chen's flying kick target.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Wandering Keg is an incredibly versatile ult. Use it to save yourself, peel for teammates, or secure kills. A good way to use Wandering Keg is to Flying Kick behind the intended target, and then immediately activate your barrel. From there, push the target into your team or inside your fort to secure the kill.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Chen's ultimates are manageable in team fights, but only if the team immediately looks to counter his plan. For wandering keg, cleanse can be used to stop Chen from isolating one of your teammates. Storm, Earth, and Fire targets must be killed quickly. Killing all three will result in Chen's death, so just deal with two, and force Chen to retreat.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Elusive Brew at level 1 is the answer to preventing a lot of team fight damage. Look for visual queues like Tychus' minigun, Artanis' twin blades, or Greymane's inner beast, activate Elusive Brew, and attempt to aggro the enemy team during fights.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"In extended fights, weave basic attacks into your QWE combo to increase your damage output and reduce your elusive brew cooldown. This is especially important against bosses.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Stunning Chen while he's casting Storm, Earth, Fire puts it on a 10-second cooldown, leaving him vulnerable and ineffective in a teamfight. If Chen takes SEF, don't blow all your stuns while he's drinking - save one to interrupt his ult.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"If he's diving you, run towards your team and not away. You can't escape the Fat Illidan!","type":"Counter","patch":"Kael'thas","realVotes":5},{"details":"If you are going to use an stun or silence on Chen, use it when he starts to drink. If Chen is stunned towards the end of the drinking animation he has already gained his shields and brew and you have wasted CC that would be better used on squishier targets.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Use Chen's flying kick to body block carries.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Don't waste your time on a drinking Chen, refocus tour attack on another enemy.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Altough Storm, Earth, Fire is great for durability, it has a fairly long cast time and can be easily interrupted, leaving you in a bad spot.  If you're feeling you're interrupted too frequently, you should ult before a teamfight.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"If you make Chen in his 'Storm, Earth, Fire' run away, don't kill the storm elemental, as Chen will respawn on him.","type":"Counter","patch":"Kael'thas","realVotes":1}],"chogall":[{"details":"\"Hell, it's about damn time.\"","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Tychus trait nuff said","type":"Counter","patch":"Kael'thas","realVotes":-6},{"details":"Heroes that do percentage damage are key. Tychus, Leoric, Kharazim, any hero with a Giant Killer-like feature (Raynor, Artanis, Greymane, Valla, et cetera) are a must.","type":"Counter","patch":"Kael'thas","realVotes":21},{"details":"Play Cho as if you were playing Greymane – poke enemies from a distance, dash in when it's time to finish off. Otherwise save Q for escape.","type":"As","patch":"Kael'thas","realVotes":11},{"details":"Position yourself so Gall can hit several things at once. Walk in front of an incoming minion wave so Gall's Q hits everything. Stand where Gall's W can hit both turret and a well. Stand where Gall can hit both siege giants when taking a camp.","type":"As","patch":"Kael'thas","realVotes":8},{"details":"Take Hammer versus melee heavy teams, Upheaval versus range heavy teams.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"As Gall, it's better to be safe than sorry and to use Z early.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Brightwing's polymorph interrupts Cho'gall's Q, Z and E.","type":"Counter","patch":"Kael'thas","realVotes":5},{"details":"Anubarak's Cocoon get 2 for 1 value versus Cho'gall.","type":"Counter","patch":"Kael'thas","realVotes":9},{"details":"Often enough, you dont want Cho'gall on your team. nice try!","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Chogall is actually two players. Use this to your advantage. Forcing him to move to defend or push will create big openings on other lanes.","type":"Counter","patch":"Kael'thas","realVotes":8},{"details":"If you have Cho you need Gall","type":"Helper","patch":"Kael'thas","realVotes":-8},{"details":"Follow up Cho'gall, as he does a lot of sustaining damage and tanking, do not leave him alone for to long. When focused he dies faster than you would think.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Having Cho'gall as your wingman could be a bit problematic. When arranging a double date with chogall, you have to find him 2 girls to hang around with.","type":"Helper","patch":"Kael'thas","realVotes":-5},{"details":"What cho'gall adds in team fight potential he lacks in soaking lanes. You can often times get an xp lead by out soaking the enemy team.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"While cho'gall is tanky, he is undoubtedly going to be focused hard. Protect him.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"Communication is key. If you have the situation to use voice chat with your other half, do so. Warn ahead of time when you are going to use your bomb, and coordinate which ults to take, as well as talent options.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"A tip for rotations. After dismounting and casting the bomb, mount will be on cooldown. In the meantime use Q to get a bit closer to your other destination. Mount will be up by then.","type":"As","patch":"Kael'thas","realVotes":1}],"chromie":[{"details":"Medivh is a great counter! Chromie telegraphs her abilities and you can land some clutch shields. Also useful to heal your teammates to full with reabsorbtion at level 16.","type":"Counter","patch":"Kael'thas","realVotes":26},{"details":"Stasis, Unstoppable, Tracer's Recall and Illidan's Demon Form can save you or your team mates from Temporal Loop. Remember to use it only when the clock reaches 2/3.","type":"Counter","patch":"Kael'thas","realVotes":9},{"details":"Chromie is only dangerous on distance. As a bruiser just close the gap to her zigzag-moving to avoid her slow skillshots. Once standing next to her she is an easy target.","type":"Counter","patch":"Kael'thas","realVotes":9},{"details":"Zeratul, Nova, Samuro are great counters do Chromie due to their stealth and good amount of damage.\nZeratul is the best out of the 3 due to his numerous gap closers ( between Seeker in the Dark and Vorpal Blade ) paired with a basically instant escape ,namely Blink. Drafting Zeratul against Chromie can make the game much easier for you and your team.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Bye Bye is not interrupted by damage but IT IS interrupted by stuns, as Chromie is not unstoppable while she channels it.","type":"Counter","patch":"Kael'thas","realVotes":7},{"details":"When playing against Zeratul, always have a Time Trap (E) placed close to you, so that when he jumps into your face, you can lure him into it, gaining time to escape. If your skills happen to be off cooldown, you can even punish him.","type":"As","patch":"Kael'thas","realVotes":12},{"details":"Play a hero like Malfurion who can root enemys. They are an easy taget for her once rootet.","type":"Helper","patch":"Kael'thas","realVotes":11},{"details":"If you are having trouble with landing the tempooral loop combo just keep your eye on the clock animation. Once it's at the half'o clock press Q and W repespectively.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"While casting skillshots always aim for where your enemy will be rather than where they trully are. Enemies seeing Chromie's sand blast animation can see its direction and dodge it. Casting spells from fog of war will always be more efficent.","type":"As","patch":"Kael'thas","realVotes":11},{"details":"if you are at lane against her x1 and she put a temporal loop on your head, dont run from her, chase her to difficult her range cast and maybe kill her.","type":"Counter","patch":"Kael'thas","realVotes":9},{"details":"Disengage is your friend!  \n\nChromie loves battles that are always on the fringes, due to her incredibly long range.\n\nHaving a strong zone control comp gives Chromie a good advantage.  This can come with a double tank comp, or something unconventional like gazlowe!","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"Chromie is a good poker. Allow her to fight from the sidelines by peeling attackers and forcing the fight away from her. If a teamfight is just a chaotic mess that lasts 5 seconds, your Chromie wont be able to do much.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"If you have a Xul on your team you basically have a free Temporal Loop combo whenever he uses Bone Prison. Try and coordinate with him!","type":"As","patch":"Kael'thas","realVotes":9},{"details":"Dragon's Breath reveals Chromie when cast near you. If you can suddenly see her, move in a different direction to avoid the impact!","type":"Counter","patch":"Kael'thas","realVotes":7},{"details":"Damage reveals Chromie's hourglass. If you have an AOE ability, cast it into thin walkways where Chromie is likely to place hourglasses. Vision granting talents are also excellent for this.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"Chromie is all about predictions. Most people have certain tendencies about how they move, and try to dodge your attacks. Learn how they move, and try to predict how they will avoid your skills.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Attack unsuspecting enemies. When team fights are happening, don't attack the artanis right in the front lines, he's expecting it, go for the unsuspecting backline. Your range is absurd. Abuse that.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Chromie is the best hero to counter Sgt. Hammer. Especially with W build.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"W build brings better AOE & burst damage.\n\nQ build brings better single target sustainable damage.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"If you're playing vs stealth gankers, stick with your tank and pick the Timewalker's Pursuit talent. If the stealth hero knows any better they won't approach you alone for the rest of the game, if they don't want to feed.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"We have lots of fun with my friend playing as Xul. He roots i shoot ^^.","type":"Helper","patch":"Kael'thas","realVotes":3}],"dehaka":[{"details":"Alt-click the Z cooldown, so your team knows whether you're available.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"When solo laning, B once you're low on health, then Z back to lane. Use fountain only when Z is on cooldown.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"When you grab someone, activate W and stutterstep to the other side of the victim so that when the stun wears off you can continue to bodyblock them.","type":"As","patch":"Kael'thas","realVotes":9},{"details":"You can win solo lane against most melee heroes.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Dehaka's Brushstalker (Mount) will make a unique sound when appearing in a bush, so listen closely when facing him to not get caught unexpectedly.","type":"Counter","patch":"Kael'thas","realVotes":9},{"details":"Get some other CC so Dehaka has easier time landing Q.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"Try to move unexpectedly and anticipate his Drag (\"Q\") to catch you when facing Dehaka.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"On larger maps such as Cursed Hollow or Warhead Junction let Dehaka soak top/bot lane. He can (just like any other hero with global presence) use his Brushstalker to quickly join upcoming teamfights or objectives from afar.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Try to never use your trait in lane (unless you will die, of course), keep it at full stacks for teamfights.\n\nSame for the fountain. You have the opportunity to back and come very quickly to any objective or fight, so when you know an objective come soon, back if you miss any health or mana, and come with the W","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Bait him with a low Hp target wandering besides a bush where he has vision on you, and let your team hide in the bush. Often, the dehaka will try to get the kill, and just be detroyed by your whole team.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Try to gank dehaka before a teamfight, to force him to use his D in panick. It's a huge win, because even if he can back and tp, he looses all his team fight survability .","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Ping for Help when you plan to start a Teamfight and Dehaka is splitpushing. Sometimes the player doesn't look the map and miss the fight, so it cost you nothing to give him a warning.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Dehaka's biggest drawback is his mobility in team fights. So prioritize heroes with escapes and CC. Slows are also generally strong vs. him compared to other warriors.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Your movement speed activates immediately as you enter a brush, so if you are chasing/being chased near one,  dip in for that very helpful speed boost.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"A commonly known to counter to Dehaka's Drag is Cleanse, as Drag is a Stun and thus Cleanse will stop it. However, if that isn't available, a Stun or Silence on Dehaka will also do the job or canceling it.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"Try to utilize your great waveclear and global presence with frequent split-pushes!","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Dehaka has global presence on the map. So he can split push while the rest of the team goes to a teamfight. Stay safe and warn him when you feel it's time for a hard engage so he can teleport to the combat zone.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"Your Q is often easy to dodge if the enemy can see it coming. Casting it from a bush (mostly) circumvents this.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"ESSENCE! MUST COLLECT","type":"As","patch":"Kael'thas","realVotes":-1},{"details":"Always follow up with a lot of damage as soon as dehaka lands his drag (Q), that way the enemy will be isolated from the rest of the team and stunned for 1.5 which is more than enough to kill them and  make it a 4v5 fight","type":"Helper","patch":"Kael'thas","realVotes":1}],"diablo":[{"details":"Tassadars Force Wall is the perfect follow up to a target which got moved out of position by Diablos Overpower.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Leoric is a powerful Counter to Diablo's high health pool.","type":"Counter","patch":"Kael'thas","realVotes":5},{"details":"Diablo is extremly tanky after the rework, but that doesn't mean he's invincible, he can die and you need to remember that he's missing an escape ability such as muradin's dwarf toss or etc's slide,  DO NOT charge in with low health, DO NOT charge in OUTNUMBERED against enemy team with cc lock.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"CC is you friend, diablo doesn't have a reliable escape ability, so if he's out of position, you can punish him hard with some stuns and roots.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"If you're a hero like jaina with long cooldowns, when your Diablo is near the fight, wait for him to engage before spending cooldowns.  If you use them first, there's a chance good Diablo knocks them out of your abilities.","type":"Helper","patch":"Kael'thas","realVotes":9},{"details":"Staying alive is most important, while your trait let's you red after death it uses all your soulstones.  Once you lose them you're significantly weaker.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Keep in mind that Apocalypse can be used globally, which can make some unexpected plays.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"When you kill a diablo with 100 souls, make sure to put all your focus on him : He is very squishy without them, and is easily bursted down.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"See if your team can get thrall for the earthquake. One of best combos in the game. Earthquake and then apoc is almost always a guranteed 5 man stun","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Tychus....GG","type":"Counter","patch":"Kael'thas","realVotes":-4},{"details":"When initiating for your team, consider using E (Overpower) first, followed up by Q (Shadow Charge). This brings your target closer to your side, for allies to secure an easy kill. This Q>E combo is also good while laning, to push enemy heroes towards your gate, and be hit by towers.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Diablo excels at choosing one target and controlling them for a short time. Focus down the target that he chooses to get an early team fight advantage.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"% health damage is a good way to drive him out of the fight early. Diablo also wants to single out a vulnerable hero to kill, so a beefy front line can get in his way and deny his plan.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"Choosing when to engage is very important as Diablo. If you use all of your abilities before your team is ready to follow you, you end up isolated and ineffective. Make sure your team is ready to charge in after you before you single out your intended target.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"If youre playing someone that has to land skill shots ie Tyrande / Chromie / or Jaina.. it's important to be patient and let Diablo stun and flip enemies or anticipate where they'll be put.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"It's important to smash the enemy team to little puny pieces like the mortal scum that they are.","type":"As","patch":"Kael'thas","realVotes":-1},{"details":"Note that your E (Overpower) can move enemies over ANY obstacle- including gates.  Punish absent-minded melee characters with a quick trip over the wall they so gleefully hugged before. Barring extreme circumstances this will be a 100% kill and a massive swing in tempo.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"You can use Overpower on an enemy to place them over your gate and they will be trapped inside. Your fort, keep, or towers should kill them or damage them heavily.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Before using Shadow Charge try to plan a way to approach them so you can charge them into a wall for extra damage and a stun.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Shot him in his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Before using Charge or Overpower, think about what it would accomplish, because you can make things worse easily. Slamming an enemy Thrall into melee range of your Gul'Dan is usually a bad idea.","type":"As","patch":"Kael'thas","realVotes":1}],"etc":[{"details":"Try not to face melt (W) immediately after power slide (Q). Give your team a couple seconds to follow up on the stun from Q with either damage or chained cc.","type":"As","patch":"Kael'thas","realVotes":19},{"details":"Warn your team that soon you will use your MOSH PIT. In this way they will all be ready to focus or to use their ultimate. If for some reason (wrong positioning, the ultimate CD ...) your team can not attack will be a MOSH PIT (4 sec stun) wasted.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"When choosing your ultimate considers first the basic skills and the ultimate of your opponents. Mosh pit is a very strong stun that lasts 4 sec. However, if your opponents have many ways to interrupt it (BW Polymorph (W) 12 sec, Johanna Condemn (W) 10 sec, Falstad Mighty Gust (R) 60 sec, Zagara Devouring Maw (R) 100 sec, etc.) you have 2 roads: 1) Use your MOSH PIT and stun heroes that can interrupt it; 2) considers the other ultimate Stage Dive. \nA good ETC knows that playing another music can be the key to success.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"ETC's trait, Rockstar, is very effective for maximizing your team's DPS, especially in situations where your abilities don't matter as much (like taking boss or hitting structures.) Use an ability every 4 seconds to complete these tasks much faster than you would otherwise due to the increased damage output. \n\nNOTE: ETC's trait does not stack and overlapping abilities will reset the timer not extend it.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Do not use Face Melt (W) when clearing waves or camps with allies who have strong area damage skills (like Jaina). Knocking the creeps away will make others' skill less useful, prolonging the clear time.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Try to draft convenient (easy to use and low cooldown) interrupts for potential Mosh Pits. Brightwing's Polymorph, Li Ming's Wave of Force (the \"other\" R), Tyrande's stun and Johanna's Condemn are good examples of this. Planning to save long CD ultimates (Thrall's Sundering, Diablo's Apocalypse,...) as interrupt is often not what you want to do.","type":"Counter","patch":"Kael'thas","realVotes":7},{"details":"When I play as ETC, if I go mosh, I will target the interrupts first to make sure the mosh pit is a full 4 seconds. If stage dive, try and soak as long as you can or hold obj and use stage dive when your team is about to go into a teamfight or obj.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"DON\"T ENGAGE BEFORE HE POWERSLIDES! Let ETC powerslide/mosh before going in. THis will allow you to land skillshots easier, stay safe in the backline, and pull focus to the big cow!","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"Save ULTS for after he moshes or they will all be interrupted and wasted.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"Look at ETC's Powerslide as his escape mechanism. Avoid using it without a good reason (ex. Using it on minions is almost always unnecessary).","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Consider drafting ETC when the map has objective points that are far apart (braxis, dshire, warhead junction). This forces the enemy team to draft interrupts for potential moshpits. Then you pick stage dive heroic and reap good value out of the global presence and AOE slow.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Any CC cancels his mosh pit, the back line should hold CC for it.","type":"Counter","patch":"Kael'thas","realVotes":2}],"falstad":[{"details":"Use your flight wisely. Just because you can doesnt mean you should fly everywhere. Keep it for soaking as much as possible before flying to an objective.","type":"As","patch":"Kael'thas","realVotes":8},{"details":"Gust of Wind is an excellent aggresive ability.  If your enemies are close to a keep, fly behind them and push them to the keep. Just make sure your team mates are expecting that.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Gust can also be used to single out diving heroes. Using gust when heroes like muradin or butcher dives to you will help you kill that poor fella with no intrusions.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"If you see Falstad flying over your team, spread to the sides to avoid getting gusted into a fort.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Ask Falstad to engage or disengage! If you need either, of course. He can fly behind the enemy team and shove them forcefully towards you, and he can do the same backwards to disengage instantly. He can only do one, though.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"If falstad uses his [E] Barrel roll. try and focus him/collapse on him as that is his only escape the cooldown is 14 seconds use it smartly.\nAlso try to poke down or at least damage Falstad in teamfights, as it cancels his Trait Tailwind, makes him less mobile and if he took the talent it will NOT regenerate his skills faster.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Save your Gust for enemy ultimate combos; such as Thrall's Earthquake and Rehgar's Bloodlust combo","type":"As","patch":"Kael'thas","realVotes":1},{"details":"When using your Z flight ability don't land in the center of your objective or in the right in the middle of a team fight. Try landing in a bush to hide your landing circle and keeping an effective distance to use your abilities safely.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"The old Hinterland Blast (without the 25 seconds CDR per enemy hit) was a good finisher. You could easily take down 2+ enemy heroes with well positioned ultimate. \nRight now, with the CDR changes, you can use it twice. Exploit the tight spaces in maps like Cursed Hollow to initiate the fight with a huge chunk of damage. If you did a good job, you will have it again in 20 seconds. You can use it as an initial damage output as well as a finishing move in the same team fight!","type":"As","patch":"Kael'thas","realVotes":0},{"details":"With his current kit, Falstad is a sustained ranged assassin, and a ranged caster with his Q talents. In the early game protect him, so he can farm his lvl 1 quests, and slowly, as the game progress push your frontline further so he can be free to position himself better, and open new possibilities to use Barrel Roll during the fight while doing damage with AAs and his skills.","type":"Helper","patch":"Kael'thas","realVotes":0}],"gazlowe":[{"details":"No need, nobody will pick him anyway","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Mind his turrets! Destroy them first and don't fight in their range for extended periods of time!","type":"Counter","patch":"Kael'thas","realVotes":5},{"details":"Use his turrets as a safe spot to retreat you probably won't get chased into them.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"His turrets are his main damage. One of his talents slows and another does extra damage. KILL THE TURRETS!","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"Use turrets and choose turret talents. You can zone with these and never die. Play as gazlowe when the obj is zone oriented such as Braxis or Cursed Hallow","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Get to objectives early.  \"Set up shop\" with turrets.  The earlier a Gazlowe can get there, the earlier he can zone out the enemy and allow his team to fight within his turret range.  Particularly Infernal shrines, Towers, Braxxis.  Keep in mind where the last objective was and where most likely the next one will be.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Shot him in his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Bribe him.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Gazlowe has a low attack speed but high atack damage.  Kite your enemies around your turrets and hit them with melee once in a while. Real trick of Gazlowe is forcing your enemies to play your game.  Turret game.","type":"As","patch":"Kael'thas","realVotes":4}],"greymane":[{"details":"Greymane has no inherent sustain.  If he doesn't have a support nearby, go for the attrition war.","type":"Counter","patch":"Kael'thas","realVotes":7},{"details":"Just don't play as Greymane.","type":"As","patch":"Kael'thas","realVotes":-10},{"details":"Don't destroy enemy walls. It gives vision, yes, but allow GM to escape (he can E on walls) and can help land a cocktail.\nIf he goes Cocktail Build, don't destroy the gate immediately during an objective push : He can land a cocktail or two on it, gaining lot of stacks and doing big poke damage.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Don't stand clumped behind your frontlane, try to be on the sides, or be quite far away, else he can poke you to death with boosted coktails","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Pick Him on Maps where Waveclear or PvE is important (IS, BoE, TotSQ). His high sustain AA + fantastic Waveclear are his best assets.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Greymane excels against team with 2 or 3 frontlaner with little CC. It mean that he can safely and reliably poke the backlane by throwing cocktail on the frontlane, and the lack of CC means he can dive the backline to finish the job without troubles.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Don't be afraid of using your ultimate without the reset. Sometimes it can be used as a simple gapcloser to land a few more AA to land the finishing blow.\n\nOn the other Hand, if you get a reset, don't put yourself in danger just to not \"waste\" it. Better waste the free reset than doing a bit of damage without results and dying","type":"As","patch":"Kael'thas","realVotes":6},{"details":"As a support, don't follow Greymane when he dives deep. You will just put yourself in danger, and Greymane is tanky enough to get a few hits. However, help him to back out, because when he disengages, he looses the armor and mobility of worgen form, so he needs your help at this moment.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Don't try to win a 1v1 trade if you are both full life : He wins most trades because of his high Worgen damage, even without sustain. In order to beat him 1v1, poke him to abuse his lack of sustain.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"If an enemy is too close for you to simply run, use Darkflight onto them so you can Razor Swipe backwards, it'll give you more mobility.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Do not feel pressured to jump in and make plays. Unless the enemy team has no CC and little burst (aka what?) jumping in pre-maturely will just get you killed. Greymane does decent auto damage in human form (especially post-20 with Blunderbust) and cocktails will offer great poke. Jump in only when it will secure kills with the burst or if an enemy squishy is isolated from their team.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"When playing cocktail build, poke is your strongest way of doing damage. By just simply standing in the backline and auto attacking while throwing the occasional cocktail you can even outdamage heroes like kael'thas. When the enemy team is disrupted or start going down is when you should fire your bullet or go for the kill","type":"As","patch":"Kael'thas","realVotes":0}],"guldan":[{"details":"If you're clearing a lane with a low health Gul'dan try to always leave at least a minion alive so he can drain it and heal himself.","type":"Helper","patch":"Kael'thas","realVotes":18},{"details":"Wait until your opponent(s) are moving away from you (such as retreating in a lane or moving back in a teamfight) and then place the E under them so they walk across all circles.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"High mobility heroes such as Illidan or Tracer can give Gul'Dan a hard time since all of his main damage abilities are skillshots and therefore hard to land on moving targets.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"Avoid bunching up as much as possible.  Corruption and Horrify are very dangerous when you are in a close formation.","type":"Counter","patch":"Kael'thas","realVotes":8},{"details":"If you see guldan with low hp on your lane. Give him some time to life drain  one of the minions. Clearing Guldan's lane minions does more harm then help.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Stun or displace him when he drains. He'll be very vulnerable for a while after this.","type":"Counter","patch":"Kael'thas","realVotes":8},{"details":"Don't be afraid to use Horrify on a single target! Securing even one kill in a late game scenario will net you map control for quite a while.","type":"As","patch":"Kael'thas","realVotes":9},{"details":"Don't waste your E on minions unless there is no other choice.  Hold it for harassing heroes, and use Q to clear minions instead.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Gul'dan does damage in straight lines. Try to be unpredictable in your pathing especially in retreat to avoid some of his highest damaging spells.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Gul'dan does great work with rooted/slowed targets. Avoid using your stuns/roots until after he's used Horrify.","type":"Helper","patch":"Kael'thas","realVotes":-4},{"details":"When you are working in a lane, remember to hit your Life Tap before you start draining life to heal. Try to choose a high health minion that is not currently being attacked as your Drain Life target.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Auriel makes a great pair with Gul'dan as they feed off of each others strengths and as an added result they have an insane amount of sustain together!","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"If you're dueling wait for your opponents stuns to come out (if any) before you life drain. Use Q and E, wait for stun, then W. This can apply to team fights, too, although you shouldn't be too susceptible to stuns with proper positioning.","type":"As","patch":"Kael'thas","realVotes":3}],"illidan":[{"details":"Kill him","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Crowd control (cc) controls illidan and stops him","type":"Counter","patch":"Kael'thas","realVotes":12},{"details":"As fun as it is using the hunt, Metamorphisis is the better ult most of the times, keep it for clutch escapes, or for some additional hp and attack speed in a team fight.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Be careful when your enemy has cc, Illidan has tones of mobility and can even fight outnumbered as he has self heal and dodge for basic attacks, but if you jump an enemy team that has varian with warbringer or brightwing's polymorph, you're asking for trouble;","type":"As","patch":"Kael'thas","realVotes":1},{"details":"If you are the support, try to focus on keeping him alive.","type":"Helper","patch":"Kael'thas","realVotes":-1},{"details":"Poliform (Medivh, Brightwing), Blind (Lili, Johanna, Artanis) or CC (Uther, ETC...)\nimo, best counter is Uther","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Try to remember the entire lyrics of the lullaby song in order to calm down the average 10 y.o. playing this hero.","type":"Helper","patch":"Kael'thas","realVotes":10},{"details":"Try to be the leader of your team and charge first into the battle - providing example and busting morale!","type":"As","patch":"Kael'thas","realVotes":-4},{"details":"Dont attack Illidan with AoE, it is pointless; he is hugely mobile.\n\nIf Illidan picked The Hunt and upgraded at 20, stay close to your allies and have everyone ready to cc him if you are low on hp.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Pick Illidan against heroes with AoE damage and no cc. They wont be ae to touch you. Good examples are:\n\nJaina, Chromie, Cho'gall, Ragnaros, and Nova.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"If in a TF and you are low on health and they are spread out, jump to minions and keep your trait going. you can heal to full hp from one minion wave basically.","type":"As","patch":"Kael'thas","realVotes":-1},{"details":"Nova is for retards","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Wait until he engages 1vs5 then kill him","type":"Counter","patch":"Kael'thas","realVotes":-2},{"details":"Recent studies showed that %95 of the Illidan players are below 80 IQ. Use this to your advantage.","type":"Counter","patch":"Kael'thas","realVotes":-4},{"details":"Keep an eye out for stuns that your opponents use or longer cooldown skills like blizzard. If you see the enemy team use their stuns it means its a lot safer to dive in and when you dive make sure you have your team with you. Don't try to 1v5 or 1v2, you're playing Illidan, not Cho'gall. You don't have much health, try to follow your tank into battle. If in a team fight you see someone gets separated from their team such as a Lt. Morales or a Li Ming you have the chase and damage to kill them down in a 1v1 but play numbers. Don't jump into fights outnumbered or you will die.","type":"As","patch":"Kael'thas","realVotes":12},{"details":"Try to be the leader of your team and charge first into the battle - providing example and busting morale!","type":"As","patch":"Kael'thas","realVotes":-3},{"details":"If you are the tank engage hard and try to soak as much of the CC and damage from the other team as you can. Illidan is a melee hero who has sustain from his basic attacks a poke war will result in a lost fight. This will allow Illidan a window in which he can dive with slightly less worry and probably a chance to win the fight.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Illidan is a huge carry - he can do damage early game, but his main potential is after 10. Don't be reckless and try to lane with someone because any stun will lock you down. If you take metamorphasis, its main use until 20 is as a clutch escape since if you use it to engage you will most likely be focused to death, and the attack speed bonus isn't until 20.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Stop using the hunt to dive head first into 1v5\n\nStop it\n\n\nI SAID STOP IT!","type":"As","patch":"Kael'thas","realVotes":0},{"details":"If Illidan took The Hunt and you're a squishy backline hero who can't do much to him, do not wander far from your team to clear waves.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Remember that evasion blocks damage and slows from structure shots. Use this to your advantage.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Illidan is one of the best heroes for soloing the enemy core because he can out-heal the core shots and has 2 abilities that can move him to the opposite side of it to avoid enemies.","type":"As","patch":"Kael'thas","realVotes":1}],"jaina":[{"details":"If you are a heavy stun hero (Etc, Johanna, Muradin...) try to sync with her Blizzard or Ring of Frost. On the other hand, with displacement heroes like Diablo, do not flip heroes out of her aoe.","type":"Helper","patch":"Kael'thas","realVotes":10},{"details":"Wait for the stuns of your allies to follow up with a blizzard or ring of frost.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"Try to hit your Ring of frost when the ennemy is already chilled, it will be easier as they will be slowed, and also you will have a massive bonus damage.","type":"As","patch":"Kael'thas","realVotes":14},{"details":"Diversify your talent choices. Some talents might seem really bad, but adjusting your play style to that of or your enemies will pay off.  Ice Lance and Icy Veins are very underrated.","type":"As","patch":"Kael'thas","realVotes":10},{"details":"Jaina's basic abilities cooldowns are long. A good time to jump her is right after she's used Cone of Cold (10sec cd) and Blizzard (15sec cd).","type":"Counter","patch":"Kael'thas","realVotes":11},{"details":"Fuck her right in the pussy.","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Herd enemies into groups to assist Jaina. If you have moving abilities, moving an enemy into a forming Ring of Frost wil make you a hero.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Stealthies own her.","type":"Counter","patch":"Kael'thas","realVotes":-7},{"details":"Frostbolt build is reliable and provides range that jaina needs due to her low hp being chunked.","type":"As","patch":"Kael'thas","realVotes":-4},{"details":"If you think you have nowhere to run to avoid her telegraphed Ring of Frost,  try to run to the center. Its damage area is only dealt in a Donut/Ring shape. Once it is cast, you can retreat safely, but be wary of the Ring's persisting chill effect (25% slow, no damage)","type":"Counter","patch":"Kael'thas","realVotes":14},{"details":"Don't group up too closely if Jaina has picked Ring of Frost. Spread out as a team to avoid wombo combos.","type":"Counter","patch":"Kael'thas","realVotes":5},{"details":"For long team fight maps (Cursed Hollow, Towers of Doom) try the full Q build for the poke and machine gun icicles. You can delay and more safely chill enemies before landing the full combo.","type":"As","patch":"Kael'thas","realVotes":2}],"johanna":[{"details":"Save iron skin (D) for enemy crowd control or burst damage.","type":"As","patch":"Kael'thas","realVotes":14},{"details":"Use Blessed Shield for securing kills, interrupting ultimates and stopping enemy divers.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Dont use CC untill after her shield ability is used, or she will eat it with Unstoppable.","type":"Counter","patch":"Kael'thas","realVotes":10},{"details":"Follow up. Johanna can set up great situations for a kill but she needs your assistance.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Remember she has very little mobility. Stay close to her because she won't be able to peel for you or lock someone down if you are miles away.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"When chasing or retreating, use condemn's pull, and sweep's slow to reposition yourself in front of the enemy to bobdy block. With ironskin, no one can stun/slow to prevent you from doing so. Gives your team time to follow up and secure a kill and/or save a team mate.","type":"Counter","patch":"Kael'thas","realVotes":-3},{"details":"When chasing or retreating, use condemn's pull, and sweep's slow to reposition yourself in front of the enemy to bobdy block. With ironskin, no one can stun/slow to prevent you from doing so. Gives your team time to follow up and secure a kill and/or save a team mate. (sorry posted this on the counter section earlier)","type":"As","patch":"Kael'thas","realVotes":6},{"details":"At lvl 20, you can save your heal for someone else close to dying if johanna is about to die. So she can proc indestructible (gives her a shield for 5sec if she got this talent).","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"When in doubt, use E (Shield Glare) to safely check bushes. Never face check bushes unless you're confident enough.","type":"As","patch":"Kael'thas","realVotes":10},{"details":"Heroes with high mobility (Tracer, Illidan) are difficult for her to keep up with. She's also not very effective at harassing back line mages without another tank to protect her team.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Johanna is good at keeping enemies away from you if you're behind her, but not so good if you're in front of her. Let her lead the way and poke from behind.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"Everyone is going to be looking to you for positioning. You aren't a flanker, you aren't a diver (outside of a specific comp/build), you're a wall at the front keeping people from passing you.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Your Shield Glare can dismount enemy heroes very easily, making it perfect for slowly down rotations during the laning phases.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Watch your backline and save blind for stealthed assassins that may jump your caster.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"If they can CC it, you can D it","type":"As","patch":"Kael'thas","realVotes":0}],"kaelthas":[{"details":"D + W on middle minion + Q = mana-efficient wave clear. Positioning it right can get the whole wave, prefer the ranged minions.","type":"As","patch":"Kael'thas","realVotes":17},{"details":"suck him","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Kael'thas is weak versus Dive Heavy Comps (Double warrior or Warrior+Melee Assassin(Kerrigan) Also Anub'Arak is a powerful pick against him","type":"Counter","patch":"Kael'thas","realVotes":9},{"details":"If you're team's main form of CC is Kael'thas' Gravity Lapse, make sure to always follow up on it. It's a 1.5 seconds stun that hits 3 people ( if empowered ) which can easily turn a fight around, assuming you are ready to target down a single enemy. Despite it hitting 3 enemies, it's best to only target 1 since it almost assures you get the kill, rather than risking and going for 2-3.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"Try to bait his stun. Baiting and dodging it is the best case scenario. If his stun is on cooldown, he is completely vulnerable to getting collapsed on by the tank and the bruiser.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"He is a very valuable member of an early game gank squad due to the stun and burst damage. This is also a good way to farm his Q quest, so make sure  you draft in a way that enables a 4 man gank squad.","type":"Helper","patch":"Kael'thas","realVotes":10},{"details":"The combo should kill most mages, most assassins, and almost take out half hp of all tanks. he is so good if you can stay behind your tanks.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Pyroblast if they have chromie. 5v4 now...","type":"As","patch":"Kael'thas","realVotes":-7},{"details":"Try to deny him his Q stacks early, killing him sets him back to zero and severely hinders his mid game until he can get those stacks.","type":"Counter","patch":"Kael'thas","realVotes":8},{"details":"D+W is a useful free poke / wave damage on a 6 sec cooldown.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"When you burst for a kill, make sure to D your stun (+0.5 sec and pierce for easier/multiple hits), then throw Q, W and perhaps Phoenix on the target. Remember that D does *nothing* for damage on Q and W.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Convection talent also stacks on hero's illusions, like Samuro's. This increases the quest to be done significantly quicker.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Shot him in his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Try using build centered around your D ability - it's fun and adds sustain dmg to your burst kit:\n1-Fel Infusion\n4-Mana Tap\n7-Sunfire Encantment\n10-Pyro\n13-Backdraft\n16-Twin Spheres (full combo is d+w,d+e,q)\n20-Presence of Mind (pyro has high cd - this talent will greatly help you in late game)","type":"As","patch":"Kael'thas","realVotes":-3},{"details":"Dont stand on fire.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"don't carry Kael's bombs into your Team. If you came too close to him even for a second, you probably gonna carry a living bomb. Don't spread it.","type":"Counter","patch":"Kael'thas","realVotes":0}],"kerrigan":[{"details":"Learn your combo, Impaling Blades into Primal Grasp. Once you get that down your kill potential goes up dramatically. Works really well in quick match with another damage dealer, be it bruiser or assassin. The one thing you want to look out for is diving in too deep to land your combo. You are squishy hero so don't go too deep.  Shields can't protect you against 5 heroes.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"If she dives into your back line, look for the stun because it will cut off her self-sustain. No shields means no healing.","type":"Counter","patch":"Kael'thas","realVotes":11},{"details":"Be patient in using Q to dive enemy team.   If your team has little dive, you're likely leaping to your death (particularly if enemy team has stuns).  When you do go in with your team, use your combo (W + E) on squishy backline targets to eliminate the enemy team's damage.","type":"As","patch":"Kael'thas","realVotes":9},{"details":"Kerrigan is not about high damage numbers, she is about setting up kills for the team. Be sure to fallow up and finish anyone, that she stuns with her W+E combo.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"If she attempts to combo you, walk towards her and slightly to one side, you'll get dragged out of the stun.","type":"Counter","patch":"Kael'thas","realVotes":5},{"details":"Although often overshadowed by Maelstrom, try to think of your second heroic ability Summon Ultralisk (\"R\") as a poke for the enemy backline: Forcing the enemy Lt. Morales or Chromie to back off due to your Ultralisk sticking to them can give your team time and room to breath for a second.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"If kerrigan starts to walk toward you, expect the combo and walk up and down to side step the combo. If you cast shields, cast those when you expect her to jump in on you or a teammate.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"Play as Tyrael or Kael Thas to help her stunlock.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"As Kerrigan, roam with one other to help secure kills. Kerrigan can take 3/4 of the enemies health at once, but her follow up is weak. After you combo, most of the time you should either jump back to team (adaptation talent) or stick to your tank because kerrigan can get locked down easy, even with shields. So have a teammate near you at all times.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Infernal Shrines is HER map. Choose the ravage talents and go to the OBJ. Have your team zone for you and you can kill all of the monsters yourself.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"If she's walking around and suddenly Q you, you have 99% she'll combo you. Walk quickly aside and she doesn't have any skills to use and will die quickly if proper focused.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"ETC + Kerrigan is a god combo. ETC uses powerslide,  Kerrigan has great combo opportunity. Great chase and peel potential. Also mosh pit + maelstorm is great. You can use your combo before mosh, so it's easier for ETC to do a god mosh or use it afterwards to kill yet alive enemies. With powerslide followup and some ranged dmg everybody dies if executed properly.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"You need to learn what you can and cannot survive. Good Kerrigan will play agressively, jump in, combo, kill everyone and generate huge shields. You need to know the line between going agressively and overcommiting. If you are sure you will die, try to deal as much dmg as you can, your trait shields may save you.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"If you don't have a healer or you want to have a great sustain, take Q talents on lvl 1 and lvl 4. You can clear whole minion lane very quickly using one AA and one Q on each minion. It's take very little mana and 6 killed minions heal 60% of your health + shields. Great way to quickly heal up between fights or just clear lane.","type":"As","patch":"Kael'thas","realVotes":1}],"kharazim":[{"details":"Aim for his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"You can provide Khara with a quick escape by getting close to him so he can Q into you.","type":"Helper","patch":"Kael'thas","realVotes":18},{"details":"Never duel Kharazim if he took Seven Sided Strike. He is baiting you to low health to finish you off with it.","type":"Counter","patch":"Kael'thas","realVotes":16},{"details":"Kharazim has poor wave-clearing. Replace him if you see him soaking a lane, so the rest of the team can benefit from his healing and auto-attack pressure.","type":"Helper","patch":"Kael'thas","realVotes":13},{"details":"You can put allies in front of yourself to dash to them when chasing or escaping.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"It's intensive, but you should be stutterstepping while attacking someone.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"I might sound crazy saying this, but Kharazim is the true first Multiclass hero in the game. Calling him a support is shameful. When playing Kharazim, take advantage of this; adapt.\n\nYou can build to countet CC (Insight/Mercurial Dash, Unstoppable Dash, Seven Sided Strike)\nAnd your enemies will never manage to catch your team.\n\nYou can build as a sticky Assassin\n(Iron Fists, Way of the Hundred Fists, Seven Sided Strike, extra dashes)\nThis build will allow you to destroy Nova, Chromie, Jaina, Kael'thas, or really any other squish.\n\nYou can build as a fighter\n(Insight/heal every 3rd atk, BoH movespeed bonus, armor on cc, Divine Palm)\nAnd this way you can stand toe to toe with any other fighter even the high sustain ones like Sonya. \n\nAnd you can mix all the builds top! The best thing to do as Kharazim is change to counter the enemy and enhance your team.\n\nFinal tip, if you take Insight, dont ignore objectives just to attack minions. Your critical \"must complete\" point is level 16.","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"I might sound crazy saying this, but Kharazim is the true first Multiclass hero in the game. Calling him a support is shameful. When playing Kharazim, take advantage of this; adapt.\n\nYou can build to countet CC (Insight/Mercurial Dash, Unstoppable Dash, Seven Sided Strike)\nAnd your enemies will never manage to catch your team.\n\nYou can build as a sticky Assassin\n(Iron Fists, Way of the Hundred Fists, Seven Sided Strike, extra dashes)\nThis build will allow you to destroy Nova, Chromie, Jaina, Kael'thas, or really any other squish.\n\nYou can build as a fighter\n(Insight/heal every 3rd atk, BoH movespeed bonus, armor on cc, Divine Palm)\nAnd this way you can stand toe to toe with any other fighter even the high sustain ones like Sonya. \n\nAnd you can mix all the builds top! The best thing to do as Kharazim is change to counter the enemy and enhance your team.\n\nFinal tip, if you take Insight, dont ignore objectives just to attack minions. Your critical \"must complete\" point is level 16.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Consider picking Zuljin. Divine Palm synergizes great with Tazdingo.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"ALT+R to quickly divine palm yourself. Seen alot of Kharazim's die from getting bursted down faster than their keyboard reactions. :)","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Try to make it a habit to always have an escape plan. Save 1 dash for dashing away to an allied/enemy unit, or a previously placed Spirit/Earth/Air Ally.","type":"As","patch":"Kael'thas","realVotes":8},{"details":"Dont let him be 2nd melee in your team. He need at least 2 other melees with enough hp so he can stay in front line, punch and heal with trait. Tank+monk+3ranged means he will stay with rangeds or get heavy focus.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"Pick kharazim if you have at least 1 more melee hero other than tank. \nNote: heros like zera dont count, he cant stay in front line","type":"As","patch":"Kael'thas","realVotes":0},{"details":"You can place a level 4 talent Spirit/Earth/Air Ally and Radiant Dash to it. Not only will the ally give its bonuses but it can be used as an anchor to engage or disengage when no other allies or friendly minions are within range of Radiant Dash","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Save Seven Sided Strike for an isolated target so that the full effect of its seven strikes is not spread out among several enemies","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Don't underestimate Iron Fists, especially with two supports. You will be more useful with the damage if you have someone like Tyrande or Tass to back up those heals.","type":"As","patch":"Kael'thas","realVotes":-1}],"lili":[{"details":"Stun/silence/polymorph her when she casts 10000 jugs.","type":"Counter","patch":"Kael'thas","realVotes":21},{"details":"Always pick Water Dragon.","type":"As","patch":"Kael'thas","realVotes":-10},{"details":"Consider using lili as a secondary support rather than main support, you can then talent into her blinding wind (gale force +50%, mass vortex +2 targets) which gives her a nice dps + very good blind.","type":"As","patch":"Kael'thas","realVotes":14},{"details":"Remember that she can't target her heals without a ton of repositioning, so she's very much a sustain healer, not a burst one.\n\nIf you've got a snake on you, she may have gone for the snake build, that heals and does decent damage if you stay near mobs, enemy heroes, or enemy structures. Check her talent build if you're not sure.\n\nIf you see the little whirlwinds go out, you've got a bit of protection from enemy hero AA for the next few seconds. If the fight is close, push in and go for the kill.","type":"Helper","patch":"Kael'thas","realVotes":0},{"details":"You can hold Q for constant healing. You can also hold E. Useful for late game team fights.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Mass Vortex at lvl 4 with Surging Winds at lvl 13 will buff your 1,000 cups by 20%. Combined with Kung-Fu Hustle at lvl 20, makes no need to get 1million cups at lvl 20.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"Sustained damage dealers.  \n\nLi li has some of the weakest team healing in the game, especially before lvl 10.  \n\nBonus points for sustained damage dealers that don't use auto attacks!","type":"Counter","patch":"Kael'thas","realVotes":-2},{"details":"Pick Li Li against heavy auto attack teams, especially melee auto attackers.  If enemy team has 2+ dps that rely on auto attack damage, go for a blind centered build.  If only one dps is an auto attacker, the serpent build is very powerful and you won't need the 4x blind targets.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"If you're low on health but safe enough to don't need heals for a while step out of her Q range so she can easily target another ally who really needs them.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"Don't waste your blind. Casting it right away is often a mistake.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"Try drafting her as second support with someone like Lucio, Kharazim, Tyrande or Tassadar plus to bruisers. The utility from Water Dragon can help your team close the gap, escape, or secure the kill. Jug of a Thousand Cups can be too easily interrupted, and the slow from Water Dragon should not be under-estimated.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Pick her as a second support, and choose Water Dragon. The utility from the slow is almost better than the damage, and now with the likes of Tassadar and Lucio, they will be hard pressed to escape.","type":"As","patch":"Kael'thas","realVotes":3}],"liming":[{"details":"Keep your low-health teammates alive at all costs! Avoid starting the \"reset train\" and you won't be teamwiped.","type":"Counter","patch":"Kael'thas","realVotes":24},{"details":"Going towards the Arcane Orb will deal way less damage than trying to run away from it. As tank, stay near her and block her orbs.","type":"Counter","patch":"Kael'thas","realVotes":13},{"details":"Try to be on the flank. It is easier to hit the backline if there isn't a tank blocking your skillshots. You can flank relatively safe due to your low cooldown teleport.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"When fighting in a lane,  clear the minions for her, so her projectiles don't get intercepted by a stray footman.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Go out of your way to pick up globes. Your squishy Li-Ming sometimes can't risk going out into the lane to grab it, but she'll appreciate the mana and AP bonuses from Power Hungry!","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"While laning try to lane arcne orbs and magic missles from bushes and fog of war. Aiming for minions near your enemy is more effective while casting arcane orb.","type":"As","patch":"Kael'thas","realVotes":8},{"details":"Practice hitting your magic missiles. You get a massive damage spike at 16 with Mirror Ball if you are good will missiles.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Wave of Force is a good finisher and its also the only disruption available for you. If you need to help stop enemy channels or your team needs a disengage, pick it.","type":"As","patch":"Kael'thas","realVotes":8},{"details":"Characters with highly telegraphed cc like Xul can help Li-Ming easily land damage abilities consistently. Consider setting her up with powerslide, bone prison, and the like.","type":"Helper","patch":"Kael'thas","realVotes":13},{"details":"If you are caught in an avalanche move laterally, same applies with liming orbs. You are more likely to dodge her long range crap if you move up or down","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Most of your spells hav good range. Trick for landing them is shooting them behind obstacles and grass zones so your opponent wont have time to react.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Learn her orb timings so you can easily dodge them.  Try picking heroes that spawn minions such like Anub'arak, Nazeboo, Gazlowe to block her skillshots.","type":"Counter","patch":"Kael'thas","realVotes":7},{"details":"Draft Malfurion and keep her topped up mana wise. When Li ming has less than 20% mana, she will do nothing and it's going to be a 4v5 if you engage the enemy team.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Li Ming is the most overrated hero in the game. Her win rate is low and yet everyone picks her. Pick Jaina instead.","type":"As","patch":"Kael'thas","realVotes":-10},{"details":"Always take Force Armor against Zeratul, Valeera, Nova, Chromie, Illidan, and Tracer. These are heroes that you cannot reliably position safely against. Greedy builds accomplish nothing if you're dead. The same applies to Glass Cannon—don't take it if the enemy team is able to get to you.","type":"As","patch":"Kael'thas","realVotes":2}],"leoric":[{"details":"Making good trades is the most important thing with Leoric. If you die but kill an enemy hero along with you, that's a win, because you'll be up much sooner than they will.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"If you dodge or escape his Drain Hope, you've eliminated his ability to sustain himself, and you'll probably be able to burst him down quickly.","type":"Counter","patch":"Kael'thas","realVotes":13},{"details":"While dying isn't as painful for you as it is for most heroes, you're still not Murky.  You give full xp every time you die.","type":"As","patch":"Kael'thas","realVotes":31},{"details":"The lvl 4 talent Fealty unto death is a solid choice all around, but even more powerful on Braxis Holdout since it procs at zerg rush.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"If you see leoric casting drain hope on one of the enemise dont knock it back or move it out of Leoric's range.","type":"Helper","patch":"Kael'thas","realVotes":12},{"details":"If you need to run away and both wraith walk and drain hope is up, try to hit someone with your drain hope before you wraith walk.  Your body will continue to drain health even as you ghost away.","type":"As","patch":"Kael'thas","realVotes":12},{"details":"You can cancel your Entomb by pressing it again if you accidentally trap your own team mate.","type":"As","patch":"Kael'thas","realVotes":19},{"details":"Please stop trying to engage or initiate with a long range drain hope, this is an ability that pays off if you are patient. In 1v1 wait till they engage on you, slow with swing and then land an easy drain hope. If you are getting ganked, try and do a point blank drain hope and then wraith out of there, the drain will keep healing your until your actual body moves out of range.","type":"As","patch":"Kael'thas","realVotes":16},{"details":"Just to add, the reason for this is if you use your drain hope at it's very range limit, they can just walk away from you and cancel it since you are slower.  But, if you grab the talent that increases your speed while doing drain hope, it isn't as bad since you will actually catch up to them unless they use an escape ability.","type":"As","patch":"Kael'thas","realVotes":-8},{"details":"Try to use Skeletal Swing after Drain Hope. Using it before is a big indicator that you're going to try and land Drain Hope and the enemy will likely start moving to make it miss. This also increases the time they are slowed while you are using Drain Hope.","type":"As","patch":"Kael'thas","realVotes":-6},{"details":"If you are playing one of the heroes with high hp pools, move out of leoric range once he casts you drain hope.","type":"Counter","patch":"Kael'thas","realVotes":7},{"details":"If you are playing a tank it is normaly for leoric to directly go after you. Try to ignore him and put other players between you and him in order to avoid drain hope. Drain hope is much less effective on low hp targets.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Your Wraith Walk is best used as an escape tool.  Only use it otherwise in extreme circumstances.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"You can use your Hearthstone as a ghost to jump back to your core in case you died far away and need to get back.  Also you might consider using it if you are being chased as a ghost and won't have a favorable spot to spawn.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Make sure to watch Leoric's spawn timer when he is a ghost.  If he is about to spawn and is alone it's a good chance to set up a combo on him,   He will stand still for about a second right when he spawns.","type":"Counter","patch":"Kael'thas","realVotes":3}],"ltmorales":[{"details":"She can't heal 2 heroes at the same time, if you can't burst them down while receiving healing, try focusing another one instead.","type":"Counter","patch":"Kael'thas","realVotes":18},{"details":"Try to pick dive heroes to get back and pressure Lt. Morales, especially if her team lacks a strong frontline.","type":"Counter","patch":"Kael'thas","realVotes":10},{"details":"Morales has very little in the way of escape and unlike most supports can't heal herself.  Be extra careful to protect her with tanky characters.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Positioning. Always stay safe behind your team.","type":"As","patch":"Kael'thas","realVotes":19},{"details":"Lt. Morales is very vulnerable to stuns as that will interrupt her Healing Beam which she has to recast again. In addition, interrupting her Healing Beam will often nullify the bonus effects of it (such as increased healing after 4 seconds).","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Pay attention to Lt. Morales' Mana. Her abilities drain her mana fast, so get aggressive when she runs out of it as her Healing Beam will be useless with little mana.","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"During Teamfights, let the enemy focus one of your tankier allies rather than multiple allies so that Lt. Morales does not have to change her healing beam target often. Frequently \"switching out\"  damaged allies with allies recently healed by Lt. Morales in the heat of a fight will maximize her healing potential.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Avoid having your healing beam up on a target that is almost full health as even little damage will drain your mana over time. Rather, keep your allies in a healthy state (~ 85%) and let them make use of Regeneration Globes or their own heals to do the rest. You can cancel your Healing Beam by pressing your Trait-Button (default: \"D\").","type":"As","patch":"Kael'thas","realVotes":16},{"details":"Always remember: Lt. Morales can not follow you blindly anywhere, especially when diving an enemy or chasing too far. She has no way to escape when things heat up all of a sudden, so keep an eye on her and stay in range.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"If you are experienced and the enemy lacks CC, you can try to be a bit more aggressive and get the enemy's attention to soak a bit of the damage. Backing out and waiting for your trait to heal you afterwards will also reduce the enemy's pressure and the damage you have to actively heal. But staying alive is the top priority: A dead support is not supporting his team at all.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Save your Displacement Grenade (\"E\") for the right moment in battle: Interrupting for example an enemy E.T.C's Moshpit, Nazeebo's Ravenous Spirit or even pushing retreating enemies back into your team can turn the tides of a battle.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Grouping up with heroes such as Sgt. Hammer or Cho'Gall can be a dangerous threat for the enemy since these heroes are able to deal massive damage to heroes and structures if they can not be pressured due to your support.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Focus Morales","type":"Counter","patch":"Kael'thas","realVotes":-8},{"details":"Use stim drone heroic on a hero with high AA damage (ie. - Raynor, Butcher, others). Best used soon as the enemy team commits to the fight so that your teammate gets full value from the increase attack and move speed. On the other hand, do not use it too early like when the enemy team can simply walk away from the fight. Disengage is one of the  counters to this heroic.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Varian, xul and valeera have healing reduction talents. These talents make her healing meanless.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"Poking morales is efficient since she can't heal herself.","type":"Counter","patch":"Kael'thas","realVotes":-3},{"details":"Sometimes the best thing you can do to MEdic is just starve her out of Mana by  throwing out alot of damage. When she's oom thats your moment to strike","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"Morales is a hard counter to teams with lots of Sustained Damage, but is forced to be extremely skillful with her W (Safeguard) against burst damage (and only the very best will do it consistently).  Do everything you can to build your team towards burst damage against her.","type":"Counter","patch":"Kael'thas","realVotes":5},{"details":"jump her she has no way to defend herself is gonna die very fast always attack her first in teamfight she go down team go down","type":"Counter","patch":"Kael'thas","realVotes":-3},{"details":"When playing with Morales try to pick Nova. This will make you the best hero player killer in the game and you will never die,","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Do not focus her. Displace her from her allies (knockbacks, stuns, slow) giving opportunities to focus on her allies.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"If you have a Morales that picks Medivac try to play close attention to it. It's an amazing tool on most maps. You get a notification when she uses it and you can also see where it goes on the map. Act quickly to surprise enemies and keep the upper hand!","type":"Helper","patch":"Kael'thas","realVotes":0},{"details":"In early game, don't deal damage to her unless she is really out of position. She will quickly regen when out of fight. It's much better to  deal damage to other heroes, causing her to use a lot of mana.","type":"Counter","patch":"Kael'thas","realVotes":5}],"lunara":[{"details":"Lunara is a stable energy generator for Auriel. Crown her.","type":"Helper","patch":"Kael'thas","realVotes":21},{"details":"Lunara's DOT is very effective against healers that single target heal. Such as Morales, Uther, Tyrande.","type":"As","patch":"Kael'thas","realVotes":11},{"details":"Spread you poision, try not to focus on a single target, if a target already has 3 stacks of poision, only hit it when the poision is about to end to renew it.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"Aoe Heals are very effective against her. Heroes like Brightwing and Auriel completely negates the mass aoe poison.","type":"Counter","patch":"Kael'thas","realVotes":-4},{"details":"Versus a high heavy melee team, like Thrall, Artanis,... the Leap ultimate is a great choice as it allows you to easily escape and make massive damage.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Malfurion is awesome at getting rid of Lunara's poison thanks to his powerful and low CD healing over time.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Make sure you learn how to do stutter step attacks. Lunara is most effective when used with his mobility.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"If you blind Lunara or use evasion, you also deny her the poison stacks from her auto attacks.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Lunara's Wisp can be used to block skillshots such as Stitches Hook and Li Ming's projectiles.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Chemotherapy can beat cancer","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Consider taking heroes or talents that can slow enemies. This means Lunara can get Unfair Advantage at 13 to massively increase her poison damage (a bonus %50 while slowed!).","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Nature's Culling talent is pretty much required on maps with bosses like Mines or Battlefield because of extra damage.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Lunara's poison's are very effective against stealth enemies. It will be harder for them to restealth when affected.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"For the wave of stealth characters entering the Nexus these days, as its already been said poison and the vine ultimate can reveal and keep them out of stealth. Your movement speed can also help in a pinch.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"For Valeera, build for AA damage as she can use her Cloak to remove the poison.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"For learning her stutter-step timing, pay attention to Lunara's spear. Sparkles appear when she's able to attack again.","type":"As","patch":"Kael'thas","realVotes":4}],"malfurion":[{"details":"Malfurion excels with healing over time. If you're on his team try to trade poke damage with the enemies, Malfurion will be able to heal you up more efficiently (if you don't die!)","type":"Helper","patch":"Kael'thas","realVotes":17},{"details":"If Malfurion throws a HoT on an ally don't stop attacking them... his healing is delayed and takes 10 seconds to complete... This makes him weak versus burst heavy team but strong versus poke.","type":"Counter","patch":"Kael'thas","realVotes":10},{"details":"Think ahead and use your Entangling Roots (\"E\") on chokepoints on a map rather than for dealing damage only. You do not have to catch an enemy directly when doing so - denying an escape route for the enemy and forcing them to stay in fight is often enough to get an advantage in battle.","type":"As","patch":"Kael'thas","realVotes":14},{"details":"Use D on cooldown, root an enemy's escape route to where they cant go anywhere but to your team.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Try to save your difficult skillshots to combo with Malf roots. Their long duration will give you almost guranteed hits!","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Malfurion is basically a tree","type":"As","patch":"Kael'thas","realVotes":-10},{"details":"With artanis one your team. sometimes you can root an enemy as they decide to swap. the swap will not go through. communication is the key","type":"Helper","patch":"Kael'thas","realVotes":-4},{"details":"Conserve mana by casting entangling roots sparingly. You will be OOM very quickly if you use it on cooldown.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Spread your heal around. If you cast Q twice on the same hero it will refresh the duration of the heal-over-time, but it will not double the rate of healing.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Your trait (Innervate) not only restores mana for your allies, it also lowers their basic CDs! You'll get full value by using it just after your teammates use their longest CDs abilities, like Jaina's Blizzard.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Don't underestimate the power of level 16 full Moonfire build, especially if AOE damage is needed. This coupled with the mana restoration from Twilight Dream makes the mana cost negligible, and you don't need to hit anything to ramp up the stacks. (So keep casting!)","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Twilight Dream is best used after the fight has started, not before. (Unless you can secure a quick pick) The enemy team will just disengage if this is the first ultimate used. Wait until the fight progresses for maximum chaos.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"If you're a mage with long cooldowns (Jaina) call out for an innervate just after you've cast everything for maximum value.","type":"Helper","patch":"Kael'thas","realVotes":0},{"details":"Do not only use your root when you can actual root someone  instantly, you can also for example put down the roots for example a diablo.","type":"As","patch":"Kael'thas","realVotes":0}],"medivh":[{"details":"Medivh has two really good \"get out of jail\" cards: portal, and crow form. As a result, when you see the enemy picking Medivh, it's best to consider picking warriors with strong displacement skills such as Diablo, ETC, and Dehaka. Medivh is most vulnerable when his portal is either on cd, or when he cannot reach it. Medivh is capable of doing a lot of damage if left unattended so always look for an opportunity to deny him getting Master's Touch stacks. However, if he does happen to finish the quest, don't get discouraged and do your best to spread out as much as possible for him not to be able to get too much value off the skill. Do your best to not stay grouped up, and keep a close eye on your back line for he can easily flank your assassins and kill them rather fast.","type":"Counter","patch":"Kael'thas","realVotes":8},{"details":"Keep an eye on Medivh on the minimap -- this is especially important when you're engaged on in a teamfight. You'll be better able to respond to a portal he's about to drop for you so you can escape.\n\nNote if Medivh picks Mage Armor at 4. Mage Armor will allow you to make a strong harassment play during laning with 3 charges of block per portal.","type":"Helper","patch":"Kael'thas","realVotes":-6},{"details":"Keep your eyes open for Medivh's portals. They posses no value if you dont use them.","type":"Helper","patch":"Kael'thas","realVotes":15},{"details":"Use your raven form wisely and  try to pick up low hp targets.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Providing mobile scouting awareness to your team can often be significantly more valuable than helping take a merc or push a lane. \n\nHaving constant vision of where the enemy team is will give you a significant advantage on awareness, and also put them on edge/cause them to hesitate/make bad decisions due to your presence.","type":"As","patch":"Kael'thas","realVotes":10},{"details":"When taking Masters Touch at 7 play like a little bitch until it's finished.  Finishing that quests makes all the difference in how viable he is.","type":"As","patch":"Kael'thas","realVotes":10},{"details":"Do not use your Portals to engage on your own unless you're extremely confident in a favorable result. That Portal is your (and your teams'!) getaway card if things go south- don't waste it too early. It's exciting to get to pop up from nowhere and be awesome, but it will hamper your overall chance of success.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Use displacement to get Medivh away from his portals. Medivh players will often be very aggressive if they think they can just pop back through their portal. If you can push him away as Diablo, or someone similar, you can really ruin his day.","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"When laning against an enemy Medivh, position yourself away from your minion wave, so that he can't hit both you and minions with one Q cast. If he doesn't hit a hero, his Q cooldown does not get reset, severely gutting his waveclear.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"This hero is unplayable without Stable Portal and Quickening. Don't ever pick other talents. The ability to have a Portal active 100% of the time is the key to Medivh's gameplay.","type":"As","patch":"Kael'thas","realVotes":-2},{"details":"When laning try to position so that you can hit the an enemy hero with your Q while hitting the minion wave. Avoid using it on just minions as much as possible, it has a longer coldown and uses mana.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"As Abathur, be especially concerned about Medivh. With Raven Form, Medivh doesn't have to approach you through normal paths and doesn't step on mines, which makes it harder to spot him approaching. With Force of Will and Portal, a good Medivh can even tower dive you briefly.","type":"Counter","patch":"Kael'thas","realVotes":1}],"muradin":[{"details":"Do not spam dwarf toss (E). This ability should generally be saved for escaping (jump over terrain) or engaging the enemy (armour).","type":"As","patch":"Kael'thas","realVotes":15},{"details":"Save your heals for when Muradin is in combat, as his trait provides ample health regeneration out of combat.","type":"Helper","patch":"Kael'thas","realVotes":13},{"details":"Do not allow Muradin to run away injuried, especially not during a teamfight. He will return a few seconds later with much more health. In a similar idea, do not waste powerful abilities on him, he will soak them and heal up later.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"Roots, stuns and displacements interrupt is jump, instantly grounding him. Use this to prevent him from escaping and regenerating.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Go into try mode and practice aiming storm bolt (Q). Storm bolt is very impactful CC if used at the right time. Instead of poking enemies with it, save it to lockdown a low health or out of position enemy hero. Another good use of storm bolt is to peel for squishy teammates - stun enemy dive heroes when they attack your backline.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Use your health/trait as a resource. During the laning phases, slow down rotations and potentially waste the other team's mana. This can be done relatively safe with Dwarf Toss off cooldown.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Be careful not to over chase Muradin - his health regenerates quickly and he may be baiting you into an ambush.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"Try not to waste your cooldowns and mana on him unless it's a sure kill. That frumpy dwarf has ridiculous health regen and wants to trade health for the cooldowns of your carries.","type":"Counter","patch":"Kael'thas","realVotes":1}],"murky":[{"details":"You don't, just let murky win. Mrgl.","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Heroes with fast AAs like Tracer can delete Murky's pufferfish almost instantly.","type":"Counter","patch":"Kael'thas","realVotes":-2},{"details":"Do not chase Murky unless his egg has been killed. The amount of time wasted on a murky kill is often better spent elsewhere.","type":"Counter","patch":"Kael'thas","realVotes":22},{"details":"Dont run away towards Murkey's egg, or in any other way that could cause the enemy to spot it. Youre just gonna get him killed!","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Garden of Terror, just push one lane and get both bottom 3 man camps when obj spawns","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Nova and zeratul kill his egg, then kill him","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Murky can be amazing if played right. He is a great lane pusher, but make sure to instantly move towards your team if fighting breaks out or for objectives. \nTry not to die during objective, but if you do, then you can throw a pufferfish on your lane and go right back to the objective. If you are confident with your egg placement skills consider re-placing it close to fights/objectives.\nDon't lane vs tracer/tychus","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Wait for Nova to try and kill you. Q+W+R and kill her.","type":"As","patch":"Kael'thas","realVotes":-8},{"details":"always chase him he gives a massive amount of exp","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Murky does not have very much team fight presence until level 10. Keep in mind that you're playing a 4v5 until then.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"IF you're going to play murky either have your team draft a good 4man or don't just play pve all game.  You can provide a decent ammount of value with Slow build in a team fight and helpiung to secure kills","type":"As","patch":"Kael'thas","realVotes":1},{"details":"A good murky player will apply tremendous pressure to his lane, abuse this, and either push out another lane, or gain control over the objective. \n\nIf murky is pushing while an objective is active, stall as long as possible. He will either give you massive XP lead, or force the enemy to send people to deal with him, giving you an advantage at the objective.","type":"Helper","patch":"Kael'thas","realVotes":10},{"details":"Be aggressive with your egg placement. Too often I see murky players place the egg next to their fort, and keep it there all game. Place your egg close to objectives, and move it often. The closer it is, the bigger the risk, but the rewards are great.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"pick tracer","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Shot him in his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"FUCK YOUR MOTHER","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"If you haven't played Murky in a while now is time. Post Lucio patch this little bugger is going to be incredibly versatile.  Share some love for the master of slime and upvote :)","type":"As","patch":"Kael'thas","realVotes":-4}],"nazeebo":[{"details":"Don't kill a minion near Nazeebo unless he's had a chance to hit it once. Dealing damage to a minion that then dies gives him a stack of his trait, which is especially important at level 20.","type":"Helper","patch":"Kael'thas","realVotes":16},{"details":"If Nazeebo has poisoned a large wave of minions (say, with frogs) and you can clear them, do it!  It'll help give him his trait stack.","type":"Helper","patch":"Kael'thas","realVotes":18},{"details":"Don't be afraid of talenting into spiders, its not as hard to hit as it may seem, and does a lot of damage.\n\nReally delete people try to trap them in zombie wall (takes a bit of practice) then spiders and gargantuan.","type":"As","patch":"Kael'thas","realVotes":9},{"details":"Try to help your teammates who are stuck inside the zombie wall. Zombies don't have much health and killing one or two of them allows someone to move out.","type":"Counter","patch":"Kael'thas","realVotes":8},{"details":"You can cancel your Zombie Wall by pressing it again if you accidentally trap your own team mate.","type":"As","patch":"Kael'thas","realVotes":19},{"details":"Use frogs as a zoning tool. But if you get caught and you're going to die for certain to a melee assassin, frog him, as a single frog wave deals HUGE amounts of damaga on melee. Often times you'll kill your opponent just by the frogs DoT.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"When being chased, Alt+W to cast zombie wall at your feet, while running away. It has higher success rate to trap your pursuer.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Use slows or stuns for Nazeebo to follow up his zombie wall with,.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"The longer you can keep Nazeebo from doing damage to minions, the weaker he will be in the rest of the game. Keep this in mind.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"If you took Ravenous Spirit at 10, don't activate it until key enemy interrupts have been used (e.g. Polymorph, Wailing Arrow, Powerslide).","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Save Zombie wall to protect a high value ally such as Sgt.Hammer. When an enemy is going straight to dive you can often trap them right in front of your teammate and punish them for diving.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Nazeebo spell animations are a bit subtle but  they still hit like a truck. Frogs are easy to miss and spiders do hurt a lot if you caught the whole jar. Good things is spiders dont hit all at once so you will have time to retreat and survive before you soak damage from other heroes as well.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Practice with the zombie wall before playing in a serious game. Try to get it in front of opponents when you know where they are heading (like in retreat). Force them to make a bad decision: keep going and get trapped, or stop and get blocked in so your team can secure the kill. Practice this, essential zeebo tactic. I highly recommend specing into z wall","type":"As","patch":"Kael'thas","realVotes":1}],"nova":[{"details":"Stealth does not mean invisible.  Look for a faint shimmer and knock her out with AoE abilities.","type":"Counter","patch":"Kael'thas","realVotes":49},{"details":"Nova cannot wave clear.  Don't leave her alone in a lane.  Let her roam and pick.","type":"Helper","patch":"Kael'thas","realVotes":50},{"details":"Your E can soak tower ammo in a pinch.","type":"As","patch":"Kael'thas","realVotes":32},{"details":"Nova has  no escape once she's revealed.  Punish her for getting remotely out of position.","type":"Counter","patch":"Kael'thas","realVotes":21},{"details":"Create opportunities if you see your Nova nearby waiting.  Her snipe can't go through minions, so if you can get a semi-squishy hero a bit damaged and away from minions they can get blown up hard without warning.","type":"Helper","patch":"Kael'thas","realVotes":22},{"details":"Even if you won't get a kill, poking someone with a good chunk of burst and then running off is still more useful than poking someone with a good chunk of burst and then dieing because you didn't run away.  You have great poke, make the enemy scared of you.","type":"As","patch":"Kael'thas","realVotes":35},{"details":"Rexxar's Flare is a great choice against stealth heroes in general.","type":"Counter","patch":"Kael'thas","realVotes":28},{"details":"Triple Tap is blocked by other heroes and structures.  If it's aimed at you and you're about to die, put a big tanky hero between you and Nova or try to run for cover of a structure.","type":"Counter","patch":"Kael'thas","realVotes":37},{"details":"Use Nova to roam and provide vision for your team. Always use Nova to follow up on CCd targets or initiation from your team's tanks. \nHer decoy can also counter Li Li's water dragon.\nnova does have waveclear, but it comes at a cost. You have to take Snipe talents including explosive rounds and Orbital Strike (which is global). The cost is the burst that you deal to heroes.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"When facing an enemy Nova, be very careful to keep an eye on your minimap.\n\nYou could be winning a lane and pushed just a toe over the halfway line with your minions, just getting ready for that perfect kill on the enemy Hero, and next thing you're being slowed and blown up by Nova and the original lane hero.\n\nDamage over time abilities such as Lunaras Poison, Gul'dan Corruption and Kael'thas Living Bomb will not allow her to re-enter stealth.\n\nYou can often tell clones from the real Nova based on movement. If one Nova is running towards you, and one away, it's likely a fake running towards you.\n\nTriple Tap can be body blocked by Heroes and Structures, so unless you're about to die, try to soak a shot for your teammate.","type":"Counter","patch":"Kael'thas","realVotes":10},{"details":"Attempt to utilize the fear factor of Nova. When an enemy Hero pushes too far and she's with you, punish them with her slows and whatever you have to throw at them.\n\nAny roots or stuns will be appreciated for easy Q shots and Precision Strikes.\n\nWhen she grants vision, don't run face first in to the fray - she may not have the whole picture!","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"When playing Nova, play to your strengths and cover your weaknesses.\n\nTeamfight and Waveclear Build (Which is also amazing at single target burst)\n\n- Advanced Cloaking\n- Holo Stability\n- One in the Chamber\n- Precision Strike\n- Explosive Round\n- Lethal Decoy\n- Rewind\n\nSingle Target Burst & Camp Clearing\n\n- Longshot\n- Covert mission\n- One in the Chamber\n- Precision Strike\n- Double Tap\n- Crippling Shot\n- Rewind\n\nIf you absolutely have to, pick Ghost Protocol at 20. It can be a life saver when combined with your Decoy to confuse and enrage an enemy\n\nAs another user has said: Chunk the enemy Hero and run if needs be. They now have to be healed, use a fountain, or hearth to regen properly. Capatalise on this and punish another lane","type":"As","patch":"Kael'thas","realVotes":0},{"details":"You can use your E to block non-piercing skillshots like Li-Ming's Magic Missiles, Jaina's Ice Lance(non-talented), Valla's Q, Zerathul's W for example.","type":"As","patch":"Kael'thas","realVotes":28},{"details":"Nova's Strength : \n@ long range kill potential (pre 16 with a bit of help, or post 16 alone, if you took the vulnerability)\n@ vulnerability really helps your team to get a kill, along with the stun\n@ can help for mercs with lvl 4 talent\n@ global waveclear with nuclear strike (it's often better than send someone do it and fight 4v5, and CD is quite short)\n\nWeaknesses :\n@ weak early game : lvl 7 is your first power spike, then 10 then 16\n@ abysmal waveclear without the nuke (you can take the lvl 13 talent but the 2 charges of W is much better, especially after 16)\n@ frail","type":"As","patch":"Kael'thas","realVotes":-6},{"details":"Trolling ult advice","type":"As","patch":"Kael'thas","realVotes":-10},{"details":"Nova cannot clear waves. If you can create large enough push with mercs/objectives, the game turns into 4v5.  Staying in a 5 man deathball also turns the game into 4v5.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"When facing Abathur, cloak movespeed and clone CD reduction means that you can quickly and often defuse mines.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"If you're playing against Murky, find the real egg and memorize its location. After you kill Murky, use Orbital Strike to take out the egg.","type":"As","patch":"Kael'thas","realVotes":11},{"details":"Stand in the middle of minions, this makes it Snipe hard to hit.","type":"Counter","patch":"Kael'thas","realVotes":16},{"details":"If you want to have fun in QM, Murky and Nova work together surprisingly well because of Octograb + Precision Strike combo.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Make sure to get the most out of \"One in the Chamber\" and weave an AA in between each basic ability. I also make sure to increase my overall dps output by taking \"Rapid Projection\" and \"Double Tap\" to increase the amount of value I get from \"One in the Chamber\".","type":"As","patch":"Kael'thas","realVotes":1},{"details":"The decoy provides vision for 5 seconds (11 talented). Use it.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"If you are being chase run through a bush and drop the decoy as you move through it. This makes the real you harder to spot and you can even U turn in the bush.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Bribe is a great talent. Bribe camp right before an objective and your enemy is either waste time while you're taking mechanics or loosing some structures. \nOne in the chamber build is great for taking camps, because you have great single target damage and can tank with holo for a couple of seconds, thus taking out typical camp minion in mere seconds without wasting precous bribe stacks. \nI generally take all but one camp minions and brust down remaining one.\nIf you have full stacks, you can unleash full bruiser and siege camp on enemy lanes in just 30 seconds.","type":"As","patch":"Kael'thas","realVotes":8},{"details":"Don't do triple tap. Go for orbital strike. Seriously, triple tap is just bad. It's so niche you should be GM to even think about triple tap somebody, and have absolutely no benefit over strike till level 20 upgrade, and there is a fat chance you will loose till then.","type":"As","patch":"Kael'thas","realVotes":-3},{"details":"The most important part in playing Nova is positioning in fights. Flanking is fine only when you have an escape route. Forget about stealth and play her like Valla in terms of positioning, unless you know well what you can and cannot survive. Remember to not rely on your trait as an escape, it's too easy to see it. Try to burst down vulnerable targets and chase if you can, but not overcommit too much. She's more \"hit and run\" hero. If you hit and target is not dead, you should run probably.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Nova is hit and run hero. Usually if you survive her burst it is enough to chase and attack her. Most of mediocre Novas will just run and without escape or cds she will die quickly. Don't be afraid of her, just attack! She's really squishy.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Nova is great with Xul. He has long root, so she can use her whole combo with precision strike and rewind. Also, he has great wave clear, so it is equalize her major weakness.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"Nova is a stealthie, Stealthie's often have low health and high burst. The only exception is Samuro.\n\nTo counter a stealthie, Tassadar is always a good choice if you already have a healer, and a lot of AA. And ANY and i mean ANY skill shot/Ability will take her out of stealth provided it hits. Raynor's Q, valla's W Zera's cleave and even Lucio's Q.\n\nTo counter nova's snipe pinning shot combo, It's best to have a medivh since damage immunity. but high burst heal say from a malf can save you. \n\nFor triple tap, it's best to stun nova, or walk inbetween and soak the shots if you area  tank. buildings can also do this\n\nLastly, her decoy's are reveled as hologram's if you put a reveal on them, \n\n1. Look for the shimmer\n2. Knock her out of stealth\n3. Watch her run and laugh,\n4. dive on her, Get a kill.\n5. don't be fooled by a decoy, the real nova will often be running away rather than towards you.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"Nova is a stealthie, Stealthie's often have low health and high burst. The only exception is Samuro. To counter a stealthie, Tassadar is always a good choice if you already have a healer, and a lot of AA. And ANY and i mean ANY skill shot/Ability will take her out of stealth provided it hits. Raynor's Q, valla's W Zera's cleave and even Lucio's Q. To counter nova's snipe pinning shot combo, It's best to have a medivh since damage immunity. but high burst heal say from a malf can save you. For triple tap, it's best to stun nova, or walk inbetween and soak the shots if you area tank. buildings can also do this Lastly, her decoy's are reveled as hologram's if you put a reveal on them, 1. Look for the shimmer 2. Knock her out of stealth 3. Watch her run and laugh, 4. dive on her, Get a kill. 5. don't be fooled by a decoy, the real nova will often be running away rather than towards you.\n\n(Repost, this was on the wrong section, my bad)","type":"Counter","patch":"Kael'thas","realVotes":-1},{"details":"If someone on your team picks Nova, pick a good laning hero! Ragnaros, Xul, and even The Lost Vikings are very good with Nova. The pairing will help fill each other's gaps, as Nova has excellent kill potential.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Nova does a lot of burst damage, but very poor sustained damage. Draft heroes that mitigate burst damage like Tassadar, Medivh, Zarya, Chen, or even Cho'Gall! Once she expends all her burst, try to dive on her, as she's very vulnerable at that point.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Nova is number one player killer in game.  But she is not number one minion killer.  Try not to engage in team fights in a stack of minions because it kills Nova's shot selection unless your splash clears them away.","type":"Helper","patch":"Kael'thas","realVotes":-3},{"details":"Nova with the snipe build is extremely dependent on hitting her skillshots (gains +15% damage each time she lands it up to 75% and lowers cooldown by 4 seconds with talents).  If you are a hero with a lot of bully potential, like ETC or Diablo, try to push enemies AFTER Nova fires a snipe, because if she misses one it hurts her follow up potential massively.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Don't overlook explosive rounds if your team is hurting for waveclear, and if their healer can't handle AOE damage.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Murky vision talent at level 1 is great against stealth. Play safe and move your egg all the time to get vision. Place it behind a wall while your team get a merc camp to give them vision and protect them against nova. Late game if your are confident with your ability to survive, use it in teamfight to prevent flank.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"NEVER consider picking Nova if your team does not have Teamfight presence, waveclear, main tank or support. You can only fill the \"Finisher\" role in the team and make sure your team can do some job even without yourself.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"If you spot Nova, make sure to let your team know! This will allow them to play more aggressively and may disrupt a gank she was setting up.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"Don't think of Triple Tap as simply an execute for fleeing targets, or even as simply just a quick burst of damage in any teamfight. It's three relatively show shots from afar that can easily be reacted to, though this can work in your favor. Triple Tap inherently forces the primary target's allies to block the shots, which in turn gives it significant utility. Any potential blocker for Triple Tap that has to change their course to block shots must stop what they are doing to accomplish this. This displaces at least part of their team, and in the scenario of chasing fleeing targets, forces one target to change course to take the brunt of the attack, which can in itself cause them to bring about their own deaths.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Be absolutely, unequivocally sure that, if you attempt to block Triple Tap for an ally, you will not die from it, yourself. It's fairly easy to underestimate its overwhelmingly high damage with each individual shot, which, if you can't block it, can potentially cause both you and its primary target to be killed with one cast.","type":"Counter","patch":"Kael'thas","realVotes":2}],"ragnaros":[{"details":"Aim for his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Focus down Ragnaros when he uses molten core when you can. A team of 5 can make short work of the otherwise push-delaying Ragnaros!","type":"Counter","patch":"Kael'thas","realVotes":14},{"details":"When Ragnaros uses molten core, he is still considered a hero.  Abilities that only hit heroes (like Leoric's drain hope) still work on him.  Quests requiring you to hit heroes work as well.","type":"Counter","patch":"Kael'thas","realVotes":20},{"details":"123","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Try not to stack in melee range while attacking him he'll use his Q and out heal your damage","type":"Counter","patch":"Kael'thas","realVotes":14},{"details":"You can use molten core to prevent damage, not only for the different abilities, you havea boss on top of your keep? molten core! spider weaver is attacking your fort? molten core a nuke is about to go down on you keep? molten core!.","type":"As","patch":"Kael'thas","realVotes":22},{"details":"Support your Ragnaros when he becomes a keep. It may not seem like it, but he can be killed easily.\n\nSimilarly, if Ragnaros becomes a keep while a teamfight is happening, your enemy team will attemp to disengage or move the fight away from him. Do your best not to allow this as keep-rag is more effective at close range.","type":"Helper","patch":"Kael'thas","realVotes":13},{"details":"Take wave on two lane maps, and use the wave on CD to help push while Team fighting or doing obj","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Keep in mind that you can use Molten Core offensively. Consider using it on destroyed enemy forts during team fights.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"On certain maps, Ragnaros can use his Molten Core (Trait) and its long-ranged abilities to snipe enemies or monsters at objectives from a safe distance (such as Cursed Hollow or Towers of Doom).","type":"As","patch":"Kael'thas","realVotes":4},{"details":"If you play with your talents based mainly on your Q make sure to hit as much minions/heroes as possible, as it reduces cool down and increases healing received","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Pay attention to his level 13 talent. Resilient Flame makes him take half damage if he's stunned, so consider other methods of crowd control like slows and roots.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Shot him in his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Don't go to the Prometheus school of running away from things","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"DON'T STAND IN THE FIRE","type":"Counter","patch":"Kael'thas","realVotes":1}],"raynor":[{"details":"Weaken him with poke damage and the burst him when he's low so you get past his regeneration. It is not hard to burst him down because he has less health than Jaina.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Learn to stutter step, Raynor heavily relies on auto attacks and stutter steps is crucial for maximizng you damage output and dodging enemy skillshots.","type":"As","patch":"Kael'thas","realVotes":8},{"details":"If you are up against specifically ETC (other stun heavy melees also, to some degree), please for the love of all that is holy go for \"Relentless Leader\" on level 4. You absolutely ruin his day when he tries to Mosh Pit you, and it also messes heavily with his power slide efficiency.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Raynor has a lot of benefits\nOne of those are his attack speed buffs, get some heroes that are attack speed oriented which helps putting out more DPS.\n\nIf Raynor uses his ultimate HYPERION when approaching a fort do not hesitate to initiate the fight and or siege the enemy fort as people see it as a zoning ultimate/threat\n\nFurther Raynor has high basic attack DPS, so make sure you peel the enemy front line off of him.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Samo bubrege udarat","type":"As","patch":"Kael'thas","realVotes":-5}],"rehgar":[{"details":"When you have Bloodlust at your disposal during a teamfight, avoid waiting to cast it when a teammate is low. It's much more effective to initiate the fight than counter-initiating with BL.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"Change up your talent choices depending on the team match-up. (Healing Totem) and (Earth Shield) are great with a double-tank comp, while picking (Spiritwalker's Grace) and (Tidal Waves) can provide more healing against a team with quick damage.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"If Rehgar picks Bloodlust it is usually better to disengage from the fight and wait for it to wear off before fighting again. Falstad and Brightwind are great heroes for doing that.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Tanks that can punish Rehgar's positioning can be deadly, as rehgar is a melee hero that will usually try to get bite/auto attack damage in.  Diablo and ETC come to mind.\n\nFrom a damage perspective, Rehgar's healing is bursty and targetable, so you want to do the opposite, go for high sustain damage dealers to tear down rehgar's entire team over time, and be sure to have some disengage for Bloodlust.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"When playing frontline/bruiser, play more aggressively than you normally would, as rehgar specializes in burst healing single target and giving them a large damage increase with lightning shield/bloodlust.  Making aggressive plays will play to this support's strengths, and not allow his mediocre sustain healing to become a problem.","type":"Helper","patch":"Kael'thas","realVotes":0},{"details":"Do not underestimate his Earthbind totem.  During team-fights try to focus it down fast when you see it, as it often is the difference between landing a kill and/or getting killed.","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"Healing totem on a 30s cooldown gains alot of value in this tanky meta. Make sure to place it in a spot where the enemy team wont kill it such as a nearby brush.  It can also be used as a ward for vision.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Don't be afraid to use Rehgar to support your frontline in body blocking. Z bite into the enmy. Drop E in front of them and body block if possible for the team to follow up and secure a kill.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"The great lord and savior Rehgar is a mighty warrior to have on your team, for his heals are thicc, his totems mighty, and his shields powerful. The church of Rehgar and latter day Shaman fully endorses the use of Rehgar on your team","type":"Helper","patch":"Kael'thas","realVotes":-1},{"details":"By positioning yourself at the right spot you can influence the bounce of your chain heal. If your main target is the solo tank in the frontline and you want a squishy in the backline to be healed as well position yourself in the middle between them.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Remember that it's possible to cast Lightning Shield on an Earthbind Totem. This can be especially useful for revealing stealth, as Earthbind Totem alone will slow, but not reveal them. It's also generally useful as it forces your targets to take some additional damage while being slowed, or force them to prioritize attacking the totem even more. Finally, if you take Lightning Bond at lvl 1, you can double up on Lightning Shields while slowing/meleeing a target.","type":"As","patch":"Kael'thas","realVotes":1}],"rexxar":[{"details":"Rexxar is highly susceptible to burst damage from his flank. Drafting heroes like Zeratul or Kerrigan allow you to exploit gaps in the frontline for a quick kill. Don't be afraid of attacking Misha as well: Misha, Charge! is deceptively strong and frequent and if the opportunity presents itself to force Misha back or kill her it should be taken.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Keep an eye on Misha! Misha, Charge! isn't very well telegraphed and has a very quiet, simple animation but the stun duration is very frequent. Hold onto your stuns until Misha engages first, then follow up. Assist Rexxar himself as soon as possible if he's under attack. He is squishy, and his leash range will force Misha to reset when you need her most if Rexxar is forced to run.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Be constantly aware of your positioning. It's easier said than done, but will keep you safe. Don't be afraid of Taking Flight: Aspect of the Beast is an extremely strong talent, but the extra range on your Q will allow you to have Misha better stick on  your target before Frenzy at 20, and makes mana management significantly easier for more Mend Pet usage.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"If you are playing Abathur, you might consider taking the Hivemind talent at lvl 20. Since Rexxar and Misha are generally close to each other you can have a somewhat more reliable dual symbiote with them. You can symbiote either one to have the same effect (besides who you prefer has the main symbiote of the two).","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"When playing objectives, use Misha to zone out any enemy heroes who want to interrupt you. Also on maps like, Dragon shire, or Braxis Holdout. Misha can stand and take objectives, while you soak on the nearest lane or vice-versa.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"When both Misha and Rexxar are in range and your positioning is safe, attack Rexxar and ignore Misha. If auto attacking Misha is all you can do safely, do it.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"Use Mesha to scout bushes for your team","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Recalling Mesha to you can be used to block enemy  skillshots","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Sending Mesha to stun the enimies backline in a teamfight can be a huge help to your team","type":"As","patch":"Kael'thas","realVotes":1},{"details":"When retreating, position Mesha behind you to block skillshots and stun those who manage to catch up","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Dont be afraid to sacrifice Misha in order to save Rexxar. Then again this doesnt mean you should randomly send this poor bear to his demise at every single opportunity.","type":"As","patch":"Kael'thas","realVotes":9},{"details":"Playing against Rexxar sometimes can be unbearable. If Rexxar sends his bear against your group to bother you, just hit it auto attacks. Only use your High Cd spells if you are sure of killing Misha.","type":"Counter","patch":"Kael'thas","realVotes":6}],"sgthammer":[{"details":"Artanis is very strong against Sgt. Hammer. Both of his ultimates can stop her from using siege mode effectively and his god-swap can put Sgt. Hammer in a dangerous position.","type":"Counter","patch":"Kael'thas","realVotes":18},{"details":"Chromie's Dragon's Breath outranges Hammer even in siege mode and is easy to land on a sieged up tank. She's one of the biggest threats to a Hammer that wants to siege up for a while on map objectives like Infernal Shrines or Battlefield of Eternity.","type":"Counter","patch":"Kael'thas","realVotes":20},{"details":"Trying to knock down keeps with Orbital BFG is a lame gimmick. Get Napalm Strike and wreck face in teamfights. An ult with such a low cooldown is fantastic.","type":"As","patch":"Kael'thas","realVotes":9},{"details":"Never siege up without Z up! Z is a great escape from siege mode and many ganks can land if you don't have it available. If you have a healer or if you're sieging up a LOT for PvE, then the level 4 Z cooldown talent can be well worth it.","type":"As","patch":"Kael'thas","realVotes":14},{"details":"Siege Mode adds nothing to PvP fights except range. If you can stutter step and kite with Valla or Raynor, then you can do it with Hammer too and it's very effective because even out of siege mode she has great range. Siege up if you're super safe when clearing waves, and to attack buildings, and for some objectives.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"FIGHT INSIDE THE CIRCLE","type":"Helper","patch":"Kael'thas","realVotes":33},{"details":"Hammer's kit does not fit a MOBA hero but her long range basic attacks and their high damage make her a good ranged dps. Do not go into the Siege Mode in team fights.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"If you plan to dive her,  commit to it. Dancing in an out of her range will make her slowly destroy your team.","type":"Counter","patch":"Kael'thas","realVotes":9},{"details":"Zarya is a good counter. Her shields forces hammer to either move or to take damage. Grenades outrange siege range and are easy to hit on a stationary target. Block talent for shields gives extra protection for both you and teammates.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"All stuns and roots wich keep the enemys in Hammers Circle are very good. For excample play Malfurion or Dehaka with her.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"Stitches.  Before Chromie came about, Stitches was the original Sgt Hammer counter.   Hook being the main form of by dragging her in for follow up damage.  Hook can later extended with Fishing hook at 16.  Gorge can also be taken to further CC her.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Learn Russian - because those retards love to play her!","type":"Helper","patch":"Kael'thas","realVotes":-9},{"details":"Rotate to gank her early and often. Save your buildings and stop early game snowballing for the enemy team.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"If two or more of your opponents have strong stuns or roots, pick Resistant as your lvl 1 talent.  The dramatically increased survivability benefits your team greatly.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"When playing a warrior, if your hammer is sieged up in range of structures or the objective, positioning yourself near to and directly in front of Hammer is ideal for blocking projectiles that would force Hammer to move otherwise.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"Make sure a neutral or friendly unit is between you and stitches to block the hook.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"In the early game, place mines in bushes often.  This increases vision while reducing the chances of losing valuable mines to minions.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Resistant is an extremely underrated level 1 talent. Hammer comps often live or die by whether Hammer survives in teamfights. If you know the enemy team is going to dive you hard with roots and stuns, pick this talent and watch them be confused as you take half damage from all their burst combos.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Stitches and Artanis are great counters, but time your swaps carefully: Sometimes a teammate is escaping on low health and will get instantly killed by a swapped Hammer. And swapping a sieged Hammer right on top of your team can turn ugly *fast*, if allies aren't ready to burst her down before the enemy team moves in to back her up.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"The greatest power spike for Hammer is Graduating Range at level 16.  This adds insane teamfight power, as long as you choose your battles and position well. If you pass up this talent, make sure it's for a very good reason.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"If you build your comp around Hammer, verify that she's going Graduating Range at 16. Many inexperienced Hammers still pick Hover Siege, and this kills her greatest teamfight strength.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Teaming healer and Hammer at start, can make for a very powerful early push. Add in an extra tank or DPS with some CC for extra fun.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"When tanking for Hammer, make sure you're always in position to block her from Stitches hooks and Artanis swaps.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Any hero with good poke or displacement counters Sgt. Hammer. This includes Li Ming, Stitches, etc., as they can force her to retreat and/or kill her while she is in siege mode.","type":"Counter","patch":"Kael'thas","realVotes":2}],"samuro":[{"details":"Aim for his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"make sure you use W after a critical was already triggered, this way you get 2 quick critical hits.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"Blind blind and more blind, use lili with mass vortex, Artanis's pulse ult or Johana's shield glare, 99% of Samuro's damage is auto attack so blinding him renders him useless.","type":"Counter","patch":"Kael'thas","realVotes":12},{"details":"Tracer and Lunara revealing auto attacks pretty much force Samuro to go Blade Dance heroic since he will not be able to play mind games","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Samuro has nice merc clearing, use it in maps like warhead junction to create lane pressure.","type":"As","patch":"Kael'thas","realVotes":12},{"details":"When you notice Samuro using wind walk to engage, try to get the enemy's attention. Samuro deals more damage and causes more confusion if the opponent is focused on another threat.","type":"Helper","patch":"Kael'thas","realVotes":11},{"details":"Move like an  AI-controlled illusion. It's easy to identify the real Blademaster if his movement is obviously being controlled by a player.","type":"As","patch":"Kael'thas","realVotes":13},{"details":"Best counter to Samuro is to learn how to use Samuro. This makes being against Samuro more predictable, since you'll often know what his movements will be on certain situations. If you're too lazy to learn Samuro, and find it hard to know which of them 3 is real. Its the one that does the most damage and often the one who retreats 1st. (Unless he took illusion ult, and he's a micro god)","type":"Counter","patch":"Kael'thas","realVotes":7},{"details":"Samuro clones count up for the quest talents that require you to hit X heroes. You'll complete them faster than ever if he's around!","type":"Counter","patch":"Kael'thas","realVotes":16},{"details":"Don't ban him all the time. He is not as strong as you think (not saying that he is weak).","type":"Counter","patch":"Kael'thas","realVotes":7},{"details":"Mirror Images can confuse enemies but they don't last forever. Consider having Wind Walk off cooldown so you can make your escape once the damage as been done","type":"As","patch":"Kael'thas","realVotes":2},{"details":"The 2 Samuros still fighting are the fake ones. There is often 1 Samuro walking away to re-stealth and attack again; that's the real one!","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Pick sentry wards if you hero has the option, can save your and your teammate's life. Wards reveal who is copy and the real one","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"You can clear camps, okay that's nice. But don't prioritize camps when map objectives are about to begin (unless you can be at the objective in 30 seconds or so) or when it's time to teamfight.","type":"As","patch":"Kael'thas","realVotes":1}],"sonya":[{"details":"Save your stun for when Sonya casts whirlwind. This will deny her healing and a chunk of her damage.","type":"Counter","patch":"Kael'thas","realVotes":9},{"details":"When being chased by an angry Sonya, run in a serpentine/zigzag pattern to whiff her spear. Once she does, keep in mind the spear's 13sec cooldown,","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"Follow up with cc or engage with cc for Sonya to be able to be useful, since her sustaining damage is very close range. she is not that tanky, have a secondary tank with her.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Always take level 4 Hurricane talent vs strong roots and slows like  Malfurion, Xul, Jaina. It's literally get out of jail free card which lets you remove any slow and root effects with your whirlwind.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"A lot of the time the best defense with Sonya is offense. If you're already in a fight and took War Paint, you should always be hitting something in range. If things are looking bad, try to whirlwind through their team and away. Or spear to their backline squishy and slam/whirlwind. You may suprised by the kinds of engagements where you can solo and come out ahead.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"When thinking about engaging someone as Sonya, do not be scared to pop Wrath of the Berserker. You have incredibly high uptime on it, sometimes to the point of being able to cast it right after it runs out. \nIt increases your damage (and therefore also your healing!) by 40% and reduces the stuns that come towards her to interrupt her Whirlwinds, very important ability to use when fighting enemies at any point if you picked it.","type":"As","patch":"Kael'thas","realVotes":3}],"stitches":[{"details":"Stitches has a very nice combo going with Medivh, he can gorge an enemy than go into Medivh's portal for isolation, Medivh can take increased portal range enabling you to take your target even further, this can also be combined with bolt of the storm at lvl 20.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Stay behind your Minons. Stiches´s hok wount reach you and hook a minion instead","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"If you see Stitches backing up behind your team, move forward. If he hooks a hero, you can follow up with more autoattacks or stuns to focus the target and bodyblock.","type":"Helper","patch":"Kael'thas","realVotes":0},{"details":"Pay attention to Gorge! It has a distinct sound and Stitches' belly will glow green when there's someone inside! Be prepared to unload when the victim is spat out!","type":"Helper","patch":"Kael'thas","realVotes":0},{"details":"When you see one of your allies gorged, try to block slow or stun Stitches, so he can't carry them far.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Use stitches alternate hook to get overextended teammates out of danger","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Hook has 12 second cooldown. Even if Stitches is a good hooker, he cant do it unless its ready. Use it to your advantage.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Always play Stitches","type":"Helper","patch":"Kael'thas","realVotes":-3},{"details":"He just wants to play","type":"Helper","patch":"Kael'thas","realVotes":-1},{"details":"STITCHES WANTS TO PLAY","type":"As","patch":"Kael'thas","realVotes":-1},{"details":"Stitches way of playing is deadly, don't fall for it","type":"Counter","patch":"Kael'thas","realVotes":-1}],"sylvanas":[{"details":"Make sure Sylvanas is not solo laning and do not have her defend attacks such as the grave golem when you have an advantage, instead have her use her trait to make a decent push into a game winning event.","type":"Helper","patch":"Kael'thas","realVotes":18},{"details":"Try to always be with another member of your team so you can make the most use out of your trait for pushing. If the enemy loses one or two heroes  you can create a an opportunity to take a fort or a keep without any true way to stop you.","type":"As","patch":"Kael'thas","realVotes":8},{"details":"In ranked (especially below plat), you will see many sylvanas's who do nothing but split push all game. It might cause her team to lose objective or teamfights. But always try punishing her, for overextending.","type":"Counter","patch":"Kael'thas","realVotes":15},{"details":"Remember that Shadow Dagger (W) is you most reliable source of damage, and try to maximize it as much as possible, hit heroes when they are near a minion wave so that the damage will proc off each minion, or hit a building when a minion wave passes by. you want to hit as many things as possible and not just 1 isolated hero, If you take lost soul on level 4 you can have extremely reduced cooldowns if you use it right, especially against heroes with many bodies such as vikings, Rexxar and Samuro.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Keep your E for escape, (Almost) never use it for damage, you can use it for chase but only if you are completely sure you can get the kill and there's no risk involved.","type":"As","patch":"Kael'thas","realVotes":16},{"details":"you can sort of double disable things (mercs / towers) by using both your q and auto attack in conjunction, you stand near one target (you'll set a target mark that lets you know who'll be hit by your Q), and you auto attack the other target, to maximize the disable affect, don't use q off cd, but only shoot once the disable affect wears off.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Don't use Wailing Arrow just for damage unless it's really necessary. The AoE long silence it brings is infinetely more valuable when used adequately.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"When facing Sylvanas, save your CCs for when she tries to E (Haunting Wave) away. You can interrupt it even with simple displacements like Tychu's granade, Diablo's charge or ETC's knockback.","type":"Counter","patch":"Kael'thas","realVotes":5},{"details":"Sylvanas is Unstoppable (immune to CC) when she dashes to her banshees (E). Smart use of that fact and good timing can let you avoid a lot of harm like Xul's Bone Prison, Butcher's Charge or even Chromie's Temporal Loop.  You can even bait cooldowns of these skills if you're confident enough in your ability to time your E well.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Do not be afraid to dive Towers and Keeps when a good Sylvanas is around, she will disable the structures as long as you keep her safe.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Use Shadow dagger on the first minion of a wave and it will hit the whole minion wave","type":"As","patch":"Kael'thas","realVotes":2},{"details":"The most common mistake is to think of Sylvanas as a split-pusher.\n\nYour role is instead:\n- Sustain damage (like Lunara).\n- A trait that makes your *team* pushes far more dangerous - particularly when you have objective/boss pushing.\n- Insane wave clear.\n\nPick Sylvanas as a Valla who has Black Arrow instead of also being a finisher.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Why mind control?\nBecause Morales. Lili. Jaina. Any \"this hero MUST DIE\" character whether to confirm a kill or disrupt enemy positioning. \nDon't get Artanis get away. Don't let Malf get loose. Take them alive and make them dead!","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Possession gives good constant push pressure and allows for faster orb harvesting. Barbed Arrows are better for Mercs, but putting together a 20 mob push is a real treat. That kind of creep strength eats everything.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"You can save your Withering Fire in max stacks to provide a burst damage to an enemy hero which stood away from his/her team. Use dagger+spam your q when you are sure the hero is the closest target.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"In ranked, enemy team with sylvanas can choose to rush to a structure before you/minions come to the lane. Be aware and try to locate your enemy team at start.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Sylvanas is not a solo laner.","type":"As","patch":"Kael'thas","realVotes":-2},{"details":"She is often worthy of a first round ban on maps with push objectives: Battlefield of Eternity, Infernal Shrines, Braxis Holdout, and Haunted Mines. Her trait can enable these objectives to do far more damage than intended/expected (it's not uncommon to lose a keep with first objective).","type":"Counter","patch":"Kael'thas","realVotes":8},{"details":"No objective and no team fight? Grab some camps. The push is real.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Hold down Q when you want to rapidly fire all your stacks.","type":"As","patch":"Kael'thas","realVotes":0}],"tassadar":[{"details":"Tassadar works well with strong auto attack heroes such as tracer, Zuljin, Raynor, Valla and such, plasma leech enables them to heal off the auto attack damage they deal while shielded, and Khala's embrace removes the duration limit of the shield (50% remains) so the plasma leech keeps going on. you can potentially shield your entire team pre-fight giving them all lifesteal.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Tass will shield his allies most of the time, not himself. So burst him down. his only escape is his e and he will most of the time cast it and walk straight back to his team or forts etc. Predict this and when he pops out of the invisible, kill him","type":"Counter","patch":"Kael'thas","realVotes":-5},{"details":"If you accidentally block a teammate with Forcewall, you can press it again to remove it.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"Press D and fuck that retard who plays Nova","type":"As","patch":"Kael'thas","realVotes":-7},{"details":"Plasma Shield (Q) has a cd of 8 seconds and lasts 8 seconds (Patch January 24, 2017). If Tassadar protects a hero with his shield changing focus of attack if is possible. Up to level 20, he can not protect them all at once","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"(level 1) Khaydarin Resonance:\nTalent Quest: Regeneration Globes grant an additional 50% Mana.\nTalent Reward: After collecting 20 Regeneration Globes, Plasma Shield Retains 50% of its value after it expires.\nOnce you have 20 globes reminds protect your teammates before a fight. Place your Plasma Shield of each ally so when will the fight everyone will be pre-protected","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Tassadar is not a pure healer, therefore, is well with heroes who have autocare or with another healer. Tassadar can still protect  one hero at a time with his Plasma Shield (Q), cd of 8 seconds and lasts 8 seconds (Patch January 24, 2017). If you are protected by the Plasma Shield (Q) you can try to play aggressive. If Tassadar has his shield on CD and you do not have another healer plays more safe because for the next 8 seconds you will have not a cure / shield that will protect you","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Trait Tassadar is Oracle (D), Cd 30 sc: Greatly Increases your vision radius and Allows you to detect enemy Heroes. Lasts for 5 sc (Patch January 24, 2017).\nIs an incredible trait because you have good vision area and no mana cost!\nIf you get to Level 7 Mental Acuity then you have vision every 15 seconds! Remember to abuse it every time you get close to the bushes, to the altars, etc.\n\nTier 3 (Hero Level 7)\nMental Acuity\nTalent Quest: Each Takedown earned lowers the cooldown of Oracle by 3 seconds, to a maximum of 15 seconds.\nTalent Reward: Upon getting 5 Takedowns, Increase the sight range of Oracle by 50%.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Archon or Force Wall? Choose your ultimate  according with your team and not just to your habits. If the team have CC but needs damage then certainly Archon is the best choice. If your team has so much damage but not enough CC then the wall is the right solution.\nR1) Archon [Heroic Ability] Mana: 80 Cooldown: 100 seconds. Tassadar transforms into an Archon and gains a Plasma Shield. His Basic Attacks deal 175 (+4% per level) damage, slow the target by 40% for 1 second and splash for 91 (+4% per level) damage to enemies within 2.5 range. Lasts for 10.5 seconds.\nR2) Force Wall [Heroic Ability] Mana: 35 Cooldown: 12 seconds Create a wall that blocks all units from moving through it for 2.5 seconds. Passive: Increases the slow amount of Distortion Beam to 30%.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Keep in mind that your basic attack is effectively rooting yourself to slow an enemy. You don't do damage worth mentioning with it.","type":"As","patch":"Kael'thas","realVotes":4}],"tracer":[{"details":"Varian's point-and-click stun and taunt are highly effective at dealing with tracer.","type":"Counter","patch":"Kael'thas","realVotes":25},{"details":"Don't take block talents against Tracer. Her extremely fast AAs will just shred through them.","type":"Counter","patch":"Kael'thas","realVotes":19},{"details":"Tassadar has (used to have, at least, can't speak for the rework on January 24th) great synergy with Tracer, giving her life leech and burst protection.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Use your recall wisely. Don't be afraid to use your Pulse Bomb (R) often. Try not to pick Tracer into a lot of hard CC.","type":"As","patch":"Kael'thas","realVotes":8},{"details":"Consider picking tracer rounds @lvl1, your enemies will think they might have a chance of getting away using the brush, only to find that you aren't face checking the bush, but standing there finishing them off. I pick this talent every time","type":"As","patch":"Kael'thas","realVotes":11},{"details":"If you don't have a healer (eg, quick match), consider taking the health pack talent and backing frequently. Don't take poke damage, be patient and be a finisher for your team, not so much sustain.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Zuljin can be extremely good against Tracer. His extremely high AAs and accelerating attack speed means he can get a lot of damage on her quickly, especially if you can mark her with your Q, which moves quite quickly","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"Don;t pick tracer.","type":"As","patch":"Kael'thas","realVotes":-10},{"details":"To maximize damage, make sure you are targeting your intended opponent before you enter range, so that Tracer will begin damaging him immediately.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Point and Click CCs are her best counters such as Brightwing or Varian or Valeera. Other ranged auto attackers usually out trade her to threaten her out of the team fight such as Raynor, Zuljin, Tychus, Hammer... Lunara, Falstad and Valla are good but they can be Tracer easy targets as well.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Using Smartcast helps a ton when playing Tracer. Go into trymode to familiarize yourself with her movements and control scheme. You can right click on the ground, hold and drag to move her around during team fights to avoid misclicks. This also helps when you want to blink and run as the same time.","type":"As","patch":"Kael'thas","realVotes":2}],"thebutcher":[{"details":"Do not let Butcher heal from you. When he casts butcher's brand you will see a big X on your hero. Move away from Butcher to deny the healing.","type":"Counter","patch":"Kael'thas","realVotes":22},{"details":"Play safe until full meat stacks are obtained.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"Help a Butcher build stacks by waiting before killing a minion wave if you know he's rotating into your lane.","type":"Helper","patch":"Kael'thas","realVotes":13},{"details":"Do not let him complete his quest easily! Harass him at every opportunity.","type":"Counter","patch":"Kael'thas","realVotes":11},{"details":"After you stun an enemy with charge, immediately move forward while slowing and stutterstepping. You want to bodyblock the victim.","type":"As","patch":"Kael'thas","realVotes":8},{"details":"A rough estimate of how much meat you should have, I look at the clock. 3:45, i should have ~34meat, 5:30, ~52meat. so at 12:50, you'd better have your meat.\nFast is 6-7min, but the clock just lets me know where I should at least be for a hard match.","type":"As","patch":"Kael'thas","realVotes":-3},{"details":"Butcher is not an initiator. Never start a team fight head on. Wait for your oppenents use their big spells and skills on tanks and charge later on.","type":"As","patch":"Kael'thas","realVotes":15},{"details":"When butcher charges you with ruthless onslaught, there is a short time between the cast and impact. During this time try to  move to a position that is unfavourable for him to engage you  (ie. - in range of towers, in range of support with cleanse). Competent butchers will cancel the charge while less competent may engage into their doom.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Don't make butcher engage, as he is very squishy. Engage for him instead it will make him far more usefull.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Tyrael's Sanctification, Supports' Cleanse, and Li Li and Johanna's blinds hard counter Lamb to the Slaughter.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Your big and mean but that doesn't mean you should charge into the enemy team all the time. The safest way to charge is on enemies who are overextended or isolated from their team.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Don't force an engagement. Be patient and wait for the enemy to be out of position then  charge in and make them pay.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Shot him in his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"cancel your charge by pressing E again if you're not sure you'll survive.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"FRESH MEAT!","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Zone him away from his precious meat, this will anger the butcher and make him weak","type":"Counter","patch":"Kael'thas","realVotes":1}],"thelostvikings":[{"details":"Do not push your lane, make the wave stay on your side of the lane, it'll be dangerous for Vikings to soak XP.","type":"Counter","patch":"Kael'thas","realVotes":19},{"details":"Team up with the other 3 players and go ganking.","type":"Helper","patch":"Kael'thas","realVotes":20},{"details":"Communication with your teammates is more important than usual. You need to make sure that they know to always be grouped up, as you can soak all 3 lanes.","type":"As","patch":"Kael'thas","realVotes":16},{"details":"A small gank squad of even 2 heroes can wipe out Vikings, causing the other team to miss a lot of exp.","type":"Counter","patch":"Kael'thas","realVotes":8},{"details":"Vikings are the best heroes for getting  a level lead. When the first objective starts try to delay it as much as possible to get the lead and snowball for the rest of the game.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Let the dwarf and baleog wait in base. Olaf will carry solo.","type":"As","patch":"Kael'thas","realVotes":-8},{"details":"When playing with the vikings, stay grouped as a team. You can apply a lot of pressure this way, and allow the vikings to soak xp. Be aware of enemies over extending, they often will when trying to kill a viking. Gank them.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"If enemy vikings are seperated into 3 lanes and your lane viking seems inactive just go for it. For avarage players it takes a while for them  to react when they are not looking.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Try to pick global.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Listen to them, let them soak, roam as 4, try to delay teamfights.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"A common mistake is to micro one at a time while the other two vikings stay in lets say a bush and NOT SOAKING. This mistake will decrease your xp by a ton. This means that you need to have over 140 apm at all time to be successful with the vikings.","type":"As","patch":"Kael'thas","realVotes":0}],"thrall":[{"details":"Thrall is one of the strongest solo laners in the game.  Use your Q to poke your lane opponent for efficient mana usage.  Save your W and E for when you know you can secure a kill, or to follow up on a teammate's initiation.","type":"As","patch":"Kael'thas","realVotes":12},{"details":"Instead of using W from a long range and give the enemy the opportunity to juke it, try to use E as a gap closer and W from a short range, obviously, you only want to do it when its safe to get close, and its better to use it when you can secure a kill.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Susceptible to being mispositioned due to being a frontliner with little escape.  Diablo and ETC are both good counters as they can isolate him from the rest of his team and have the team collapse on him.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"With the current Earthquake meta, it is very important to have some kind of disengage against him in the draft.  This can be Falstad's Gust, Brightwing's Emerald Wind, Medivh's Ley Line Seal, or Artanis Blind Ultimate.","type":"Counter","patch":"Kael'thas","realVotes":10},{"details":"As a support, don't focus on healing thrall during the poke stages of a battle, as he will self heal significantly, but when he dives with windfury or earthquake, be ready to back him up.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Windfury causes your next basic attack to strike immediately. So, activating it immediately after performing a basic attack will result in 4 attacks in a short amount of time.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"When laning as Thrall, use Q on CD, wolf the wave ONLY when needing hp, and E as necessary, thrall is mana hungry so hearth before obj spawns and show up as it begins with full hp and mana= GG","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Only use wolf when you KNOW your team can kill that target. blindly throwing it into a tank is dumb. Usually I use it when we are chasing them back and you can hit the least fast person, or when someone dives us and they overextend and we can lock them down.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Thrall can instantly 100-0 most squshies on level 20 by utilizing Sundering, Bolt and follow through procs. Tutorial how to do it: https://www.youtube.com/watch?v=7n076ioaxgE&feature=youtu.be&t=4m6s","type":"As","patch":"Kael'thas","realVotes":2}],"tychus":[{"details":"Tychus is a tank buster.  He is best picked into heavy frontline comps (like double tank).  Using his trait on a high health target can often allow your team to remove the enemy's source of CC/frontline damage absorption and open up a direct path to the squishy backline damage.","type":"As","patch":"Kael'thas","realVotes":16},{"details":"Tychus's trait works on dragon knight and garden of terror.","type":"As","patch":"Kael'thas","realVotes":14},{"details":"Odin outranges buildings. You can use it to lay siege.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"If you have a Tychus on the team, don't be afraid to focus the tank!","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Tychus ults are best countered by disengaging. He wants to pop both of them right as a fight starts to get max value, so hold on to your ults for a few seconds to see if you can get him to R, then spam retreat. Bonus points if your team is informed before hand.","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"Odin has Resistance now, so don't be afraid to stand in a little more fire than usual if it means securing a kill.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Always save your grenade for disrupting a cast, finishing an enemy, or getting your last bit of damage in before you or your enemy retreats.\n\nYou can use your grenade while channeling Q.\n\nTake Quarterback at 7 unless you need relentless soldier. It's amazing.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"If the enemy comp has long stuns/roots and loves ganking, take Relentless Soldier at 7 and Odin ult at 10. During your ult, you'll have 75% damage reduction whenever you get stunned, effectively 16,800 health at level 20. For example, Pyroblast would remove 5% of your health bar.\n\nIt's gross.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Only take Dash at level 1 on maps that provide lots of globes (Garden, Spider Tomb, etc)\n\nDash synergizes with the Odin ult, giving you 3 Odin dashes. If you only have a few seconds left in Odin and want to get somewhere quickly, you can spam your 3 charges of dash, he'll drop out of Odin, and you can dash 3 more times. We tracer now!","type":"As","patch":"Kael'thas","realVotes":6},{"details":"If your Tychus takes Laser Drill at 10, try to fight underneath it's range while it's out.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"Tychus loves to duo with characters that can peel for him or lock down targets. ETC, Xul, Malf, Thrall, Arthas.\n\nTychus also loves an Abby hat.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"Save your blinds for when the tip of his minigun glows bright orange and he stands still. It takes the value from his trait and forces him to Q early.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"Tychus has no healing except his talented trait at 13 (which he is almost guaranteed to take). Any safe poke you can throw at him before 13 is effective.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Don't 1v1 Tychus with a  melee character after level 13, even when it looks like you at an advantage. If they took 'In the Rhythm' at 4 and 'That's the Stuff!' at 13, they probably just activate their trait and eat you alive. He functionally Blood for Blood's you every second for 5+ seconds.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"Retreat early against Tychus if you dont have a disengage. Overkill + Grenade does 2000 damage without talents at 20, and he can unload all that damage at 100% movement speed. If you start getting focused, try to recognize if an escape will even be possible, and just dump damage on him if it isn't.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"If Tychus is moving and channeling Q, it means he isn't healing. This is the best time to pressure him with damage, and potentially force him to disengage and waste his cooldown.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Shot him in his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Odin gives you Unstoppable while it's dropping on you -- Use this to your advantage, it can effectively act as a Cleanse ,making it especially useful for baiting out an Ult such as Temporal Loop without having to burn your Support's Cleanse.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"The mechanics of a good Tychus are simple:\n1) (E)+D for AA on tank.\n2) Q + W on tank if stays in fight otherwise focus on assasins or healer\n3) repeat","type":"As","patch":"Kael'thas","realVotes":3}],"tyrael":[{"details":"Aim for his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Consider picking the sanctification heroic when the enemy team has one or more wombo combos (ie. - ring of frost, earthquake, apocalypse). Make sure your team is grouped and cast it just before you think the enemy team will cast their heroics.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Holy Ground at 16 is far too strong of a talent to pass up in most circumstances; setting up kills and blocking off paths in the jungle outvalues any sort of damage on that tier. Place the blocking field in the middle of paths, rather than extensions of the terrain in order to block more effectively.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Watch the ground!\n\nYellow wing symbol - gives you movespeed.\n\nPale yellow circular shield - enemies cannot walk through here.\n\nsemi-transparent yellow swirling circle (accompanied by a loud crash when deployed) - you are invulnerable (STAND HERE)","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Sanctification makes heroes invulnerable to damage and CC, make sure to not waste your abilities. That being said, you can use time stopping abilities like Ley Line Seal and Void Prison to effectively stun the heroes inside. Sanctification's timer will still run out in that case.","type":"Counter","patch":"Kael'thas","realVotes":3},{"details":"Stay close to Tyrael if he is you only warrior, his shield and sanctification only hit you if you are close to him, he usually plays like a pocket tank, following an assassin and shielding them, slowing enemies, giving move speed, and blocking, especially at lvl 16","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Only go judgment if the enemy has a Morales and you have no way to get to her, go sanctification all other times and remember it has a small channel time so pop it as you see the enemy ults about to be thrown","type":"As","patch":"Kael'thas","realVotes":1}],"tyrande":[{"details":"She's a prime target for divers because she has low mobility and health. If she steps out of line, collapse on her.","type":"Counter","patch":"Kael'thas","realVotes":5},{"details":"Use your stun on either predictably moving targets or as a follow-up to your tank's initiation.","type":"As","patch":"Kael'thas","realVotes":9},{"details":"If you pick Empower and Pierce, you can shoot an owl through the enemy team after using an ability to give you double heals or double stuns. It even lowers your ultimate cooldown!","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Synergize well with Heroes that Slow and Burst suck as Nova, Jaina, Xul. Easier to Stun and Mark gets real value.","type":"Helper","patch":"Kael'thas","realVotes":-4},{"details":"Synergize well with Heroes that Slow and Burst such as Nova, Jaina, Xul. Easier to Stun and Mark gets real value.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"When playing ETC with Tyrande, coordinate with each other. It is usually best to hold off from using Face Melt after landing a Power Slide in order to let her land Lunar Flare well.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Her best map is Battlefield of Eternity. Hunter's mark on the immortal helps your team win the dps race","type":"As","patch":"Kael'thas","realVotes":3},{"details":"she has no good self heal unlike other good healers so if someone is dumb enough to pick her just punish her by going malfurion (her hubby if you dont play WoW lmao) and actaully heal people and help ur team. this will demolish her self esteem and she will likely play so bad it will be 5v4.","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Your heal will always heal you, even when cast on another target. So always try to cast it on someone ( heroes or minions) else to get more use out of it.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"You can shoot an owl from core (after B or respawn) basically for free and mount instantly. CD wil end by the time you get to lanes.","type":"As","patch":"Kael'thas","realVotes":3}],"uther":[{"details":"If you're in trouble, sometimes it's not a bad idea to die early in a teamfight so you can use your trait and quickly heal your allies.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Sustained damage.  \n\nUther's healing is very centered around single target long cooldown burst healing.  Sustained aoe damage will cause chaos and mayem to the poor paladin.","type":"Counter","patch":"Kael'thas","realVotes":5},{"details":"Don't play uther he's not viable at all any other healer is better than him","type":"As","patch":"Kael'thas","realVotes":-7},{"details":"If the enemy team is low and so is uther kill uther's allies before you kill him as he can heal a lot of his team back up if he dies first.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"You cant counter uther. Uther counters you. OP","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Uther can only heal one high priority bruiser/diver. Be prepared to do not get heals. But he will casts one of his 3 (!) possible shields on you, so you can engage. DIf you get a shield be very fast for not wasting it.","type":"Helper","patch":"Kael'thas","realVotes":0},{"details":"Uther is the only support-slot with a click+point stun besides brightwings Polymorph. Consider this when your draft needs a Stun.","type":"As","patch":"Kael'thas","realVotes":1}],"varian":[{"details":"Varian's strongest feat is the ability to CC lock, not his damage output, charge with warbringer into taunt followed up by your team can be devastating.","type":"As","patch":"Kael'thas","realVotes":11},{"details":"Varian is relatively weak before level 10. You can use this to your advantage with aggresive rotations and  pokes to his lane.","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"If possible try to position the teamfight inside Varian's banner AOE. Often, it is a reduce 25% damage taken (green) banner which gives your team a huge advantage. If Varian goes Colossus  Smash (leap 2h sword) build though, he might take +20% ablity damage (red) banner.  Which is good if your team has alot of casters/poke.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"It is easy to kite varian after he charges. Be sure to save that valla dash, after he chage stuns you, then fire away. Jaina's constant snares is also a very good counter pick to varian.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"You can easily solo camps at lvl 10, if you took Twin Blades as your lvl 10 talent, with Second wind at lvl 7.","type":"As","patch":"Kael'thas","realVotes":6},{"details":"When choosing the colossus smash heroic, be sure to chain your damage and stun from war bringer (if taken at lvl4) after colossus smash has impacted to maximize burst on the target. Varian can effectively duel most squishies if he lands the combo of colossus smash (R) + charge ( E) + heroic strike  (trait) + lion's fang (Q) on the target in rapid succession.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"If you go for Taunt, be sure to alter your playstyle to accommodate the painful drop in AA damage. Thing like a Joahanna- AA occasionally, but don't expect it to do much. Focus on using your abilities and body to help your team succeed.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Do not use Varian as a solo tank. Before 10 he is not a tank by any means.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"You are weak before level 10. Play smart and safe.","type":"As","patch":"Kael'thas","realVotes":8},{"details":"If you use Taunt on a melee Hero, make sure to move towards your team as it acts like Dehaka's Drag -- the Taunted Hero will try to get in range to land an AA. On the other hand, if you Taunt a ranged Hero do NOT move away from them : they will not chase you as you will still be in AA range so you'll just end up getting farther away from them for no reason.","type":"As","patch":"Kael'thas","realVotes":9},{"details":"Varian can punish easily any out-of-position enemy and get a kill if his team follows up. Especially as a squishy, be extremely careful about your positioning. Poke him and bait him.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"Varian flips a switch at 10.  Before that he's not particularly great, but after that he becomes a whole new hero.  Try not to take fights with friendly Varians involved before 10 unless you have an overwhelming advantage.","type":"Helper","patch":"Kael'thas","realVotes":1}],"valla":[{"details":"Fuck that bitch","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Keep your hatred stacks up! Valla does very little damage without her stacks, and if she has to ramp up at the beginning of a fight can lose kill opportunities.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"When she casts the Strafe heroic, interrupt it with stun/silence/poly.","type":"Counter","patch":"Kael'thas","realVotes":7},{"details":"When you use your strafe, anything can and will try to interrupt you.  Try to max range your ult, and still get as much bullets of as you would close range.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Valla needs engages to be effective, she also needs to build up stacks, try and go for ongoing team fights as she will OUT DPS, most DPS heroes becuase of  her stacks.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"Range is your safety. There is no reason to be up in front of your team or in the face of your target.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"If both teams are in a poke war in lane and you're waiting for the engagement, use minions or structure walls to keep your stacks up if that's the only thing you can safely attack. If you're already at 10 stacks, stagger your AA as much as possible so that you can remain at 10 stacks longer.","type":"As","patch":"Kael'thas","realVotes":0}],"xul":[{"details":"Pick Xul on Blackheart's Bay and forget that bot lane and your team mates exist.","type":"As","patch":"Kael'thas","realVotes":-5},{"details":"Maximize the usage of Xul's trait by rotating between lanes. Avoid solely pushing 1 lane, especially since your abilities do not damage structures well.","type":"As","patch":"Kael'thas","realVotes":13},{"details":"Xul is not only a good wave clearer, he also has an easy to use root that is very helpful for gankers. Rotating between lanes is definitely the way to play alongside Xul.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"If you're an autoattack assassin, try to disengage momentarily if Xul casts his Cursed Strikes. (Sweeping attack that slows enemy auto-attacks by 40%). This buff lasts 4sec on Xul, and has a 15sec CD.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Xul should be rotating lanes. If he comes into your lane he will clear minions much faster than you. Protect him.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Never force Xul into solo laning, his greatest strength comes from having godly waveclear along with good CC potential that lets him gank. He is one of the only Heroes in the game that can rotate between 2 lanes while losing literally no XP -- take use of that, try to delay an early objective on a map like Infernal Shrines and snowball from there on, just like you'd do with TLV.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"Xul has problems dealing with most ranged heroes, especially those that can kite him. So if you're in draft, keep this in mind.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"When laning against Xul, try to zone him out from using Cursed Strikes. If he can't mow down minions, he can't create skeletons.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"Your skeletons are your mercs. You push more by raising skeletons than you do by capping a merc camp.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Xul has no escape and is very vulnerable to AOE abilities. If he engages, he is a prime target for focusing down.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"Consider him top priority on Tomb of the Spider Queen, and rotate between mid and top lane safely.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Don't be afraid to go a build different all skeletons. The attack speed slow boost can do wonders for those AA heroes.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Even if you can't kill Xul in lane pressure him by forcing out his shield, especially if he took shade. This should make him play more carefully in his rotations.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"Never take shade unless the enemy team is all auto-attackers and you genuinely think you'll be in danger. The increased CD is almost never worth it and will impact your ability to safely rotate without assistance in the early game.","type":"As","patch":"Kael'thas","realVotes":-1},{"details":"In the early game you want to clear and rotate as much as possible. Avoid skirmishing unless you can get a kill or force someone out of lane and do not take damage if you don't have have your healer nearby. Time spent backing or turtling under towers is a tremendous loss in what Xul can offer in the early game.","type":"As","patch":"Kael'thas","realVotes":0},{"details":"Xul's team fight is rather weak. Make sure you draft strong DPS heroes for a balanced comp.","type":"Helper","patch":"Kael'thas","realVotes":-1}],"zarya":[{"details":"Try your best not to deal damage to Zarya's shields as it only makes her much more powerful. Common sense advice but it's still needed here.","type":"Counter","patch":"Kael'thas","realVotes":17},{"details":"As Zarya baiting out abilities into your shields is the key. Don't open a fight straight away with a shield, but try to land your shields to block key abilities.","type":"As","patch":"Kael'thas","realVotes":16},{"details":"Zarya'z ults has some nice combos with other heroes, Expulsion zone into nazeebo's zombie wall or butcher's lamb to the slaughter is devastating.\n\ngravition can very strong if followed up by diablo's apocalypse (or even lightning breath) or jaina's RoF.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"If Zarya has you shield try to let something hit you, it gives her energy letting her output more damage.","type":"Helper","patch":"Kael'thas","realVotes":10},{"details":"zarya has no mobility and relies on her abilities for survivability unlike other tanks that have large health pools, so disposition and cc screw her up pretty bad, Guldan's horrify for example can be devastating on her if used right as she won't be able to shied herself for a brief moment and can get out of position.","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"Always look for an opportunity to soak turret shots. A shield holds for 2x2 or 1x3 shots.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"If you're being mobbed by melee heroes, alt+R Expulsion Zone to save yourself.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"If you have full energy, you can solo the camps easily. When taking giants, position yourself so that you hit both at once. Also wait for them to stand up and throw rocks before shielding yourself. Grenade in the middle.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"With Pain Is Temporary (extra shield) and Unyielding Defender (rewind) you can have a total of 4 shields: W, Pain, W, Rewind, W.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Auriel complements Zarya perfectly. With their powers combined, they have infinite sustain with tons of damage and waveclear. It generally takes 3 people to deal with Zariel.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"She's like Raynor – both are immobile ranged heroes with an emergency sustain. Play safe and smart since there's no panic button to fix overextension. You cannot fight until 1hp and then vault away, so as a rule of thumb play as if you have a 2 second lag.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Ideally you want to let a teammate (preferably melee) to initiate. Initial energy from their shield will make you a threat once you yourself go in with W.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"While at the beginning of the match everyone is going to mid brawl, go top or bot soak to tower shots before rotating mid.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"When the fight starts, there's a desire to shield someone immediately. However it's better to spend a second to assess a situation to determine who is actually being focused and shield them instead.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Since Zarya is a warrior/assassin/support hybrid, she fits in almost any comp that has the main bases covered. Zarya hard counters easily telegraphed damage: Mages, Butcher, Kerrigan, Leoric, Azmodan, Nazeebo, Xul, Falstad etc. Zarya's best friends are Tracer and melee heroes, especially melee assassins because she has a clear target to shield that enemy cannot avoid.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Look closely – just because someone is bashing an enemy it doesn't mean they need shielding. Example: don't shield Kerrigan/Butcher while they're diving, do it when stun wears off and they start taking damage. While posturing, it's better to let some small poke damage through than to regret a second later when nukes start flying.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Many russians think that Zarya is actually Sgt. Hammer due to the strong similarities both heroes have in the popular game \"World Of Tanks\".\nWarn the russian teammate from making a mistake by saying some of this template words:\n\n\"Курва бля это не такой танк!\"\n\"Котол гиф мана!\"\n\"Идите обратно в доту бляяяяя\"","type":"Helper","patch":"Kael'thas","realVotes":-4},{"details":"The shield from Pain Is Temporary gives you energy like your normal shields. If it takes a lot of damage, you can immediately regain all the energy you lost.","type":"As","patch":"Kael'thas","realVotes":2}],"zagara":[{"details":"Have a least 1 hero that easily takes care of creep is ideal. If not, a tank with (Burning Rage) can make quick work of them.","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"Creep saves lives.  Put in bushes.  Put it at choke points.  Put it in back alleys.  Put it everywhere.","type":"As","patch":"Kael'thas","realVotes":15},{"details":"don't underestimate infestation talent on level 1, it may seem underwhelming, but it can make laning against you extremely hard  for heroes that don't have a very good wave clear.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"When laning, try to focus on zoning out the enemy hero in your lane instead of killing the minion wave, if you kill the minion wave, your minions will proceed to the enemy gates and die where they can be safely soaked but the enemy, you want to zone out the enemy hero with auto attacks and hunter killers and get them out of soak range, let the minions die, thus getting and denying exp at the same time, while enabling you to keep soaking without having to go forward into dangerous position.\n\nWhile doing all that, use E to drain towers ammo and deal damage and Q to deal more damage.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Pay attention to her heroic ability choice: If she takes Devouring Maw, she can give your team an opening to engage during  teamfights. Coordinating your abilities will be rewarding. Nydus Network however will give her the ability to split push excellently, so be a bit more defensively when a teamfight is about to erupt while Zagara is splitpushing. Eventually, the enemy has to deal with her somehow, giving you an opportunity to force a favorable teamfight for your team or buying time for Zagara.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Global heroes and gankers can stop her from pushing. Don't leave her unattended for long!","type":"Counter","patch":"Kael'thas","realVotes":2}],"zeratul":[{"details":"Brightwing with Polymorph and Peekaboo can give him a really hard time.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"In a solo lane, try to trade blows with your opponent as much as possible.  Zeratul's ganks make short work of an injured opponent.","type":"Helper","patch":"Kael'thas","realVotes":11},{"details":"If no target is ripe for a kill, harass the opponent. Engage from stealth, quickly use your abilities, and blink to safety before they can retaliate.","type":"As","patch":"Kael'thas","realVotes":11},{"details":"Zeratul is efficient at chunking a person and getting out. You don't necessarily have to kill the person or chase them to where you both die. Zeratul is about creating fear and making the opponent hearth back alot.","type":"As","patch":"Kael'thas","realVotes":7},{"details":"Tracer is your best friend when vs a Zeratul.","type":"Counter","patch":"Kael'thas","realVotes":-8},{"details":"Void Prison on Warhead Junction is GOAT! when they cast nuke on your to stuff, VP right before it hits=wasted nuke","type":"As","patch":"Kael'thas","realVotes":7},{"details":"If most of your team is inside the Void Prison, and you're isolated outside of it, with the enemy team surrounding you - Intentionally entering the VP is your best move for surviving and doing a counter-play.","type":"Counter","patch":"Kael'thas","realVotes":9},{"details":"You can cancel Void Prison earlier if you press the R key again. Useful if you want to time your team's wombo-combos, or to free a trapped team mate.","type":"As","patch":"Kael'thas","realVotes":11},{"details":"Pick Nova - best hero killer in game","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Zeratul's void prison disables structures as well as heroes. You can use it to prevent damage to your own or to kill someone behind your enemies'.","type":"As","patch":"Kael'thas","realVotes":3},{"details":"Don't make Zeratul solo lane. His potential is wasted if he cannot gank and roam.","type":"Helper","patch":"Kael'thas","realVotes":10},{"details":"Stay in range of your supports or peel warrior if you're a squishy hero. Several heroes with counter engage ultimates can help against Void prison wombo combo such as Tyrael Sanct, Falstad Gust, Malf Twilight Dream, Zag Maw or Brightwing Emerald Wind.","type":"Counter","patch":"Kael'thas","realVotes":1},{"details":"You can use your Void Prison ultimate on teammates as well as enemies. Sometimes it's not a bad idea to use it on allies to save their lives (for example, when you see a Pyroblast, Kael'thas's ultimate, that is about to land on your friendly, use void prison to make them invulnerable and then quickly release it by pressing R again to free them)","type":"As","patch":"Kael'thas","realVotes":1}],"zuljin":[{"details":"Aim for his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"if you see taz'dingo CC him at the end for easy kill. also blinds F him up","type":"Counter","patch":"Kael'thas","realVotes":12},{"details":"Stiches can Gorge Zul'jin during taz'dingo, it will kill Zul;jin when Stiches spits him out since taz'dingo will have expired.","type":"Counter","patch":"Kael'thas","realVotes":21},{"details":"Anub'arak can cocoon Zul'jin during Taz'dingo as well, which will take him out of the fight.","type":"Counter","patch":"Kael'thas","realVotes":10},{"details":"Varian with taunt and invulnerability at 4 can control him during taz'dingo","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"When you Taz'Dingo, it's a good idea to never stop auto attacking unless you know you can escape cleanly as Taz'Dingo is a last stand to put out your most valuable damage and get some Takedowns.","type":"As","patch":"Kael'thas","realVotes":13},{"details":"Just blind him (Johanna, Lili, Artanis), also polimorf him with Brightwing or Medihvh as he uses taz'dingo","type":"Counter","patch":"Kael'thas","realVotes":6},{"details":"Always remember that Zul'jin's strength lies in the management of his health: As a support, do not heal him to full health in battle but rather keep him at ~ 70% or less, depending on the situation. Fewer heals on Zul'jin means more damage from his trait as well as more mana for you to spend elsewhere.","type":"Helper","patch":"Kael'thas","realVotes":12},{"details":"Kill him with fire","type":"Counter","patch":"Kael'thas","realVotes":-9},{"details":"Robert');","type":"As","patch":"Kael'thas","realVotes":-8},{"details":"Shot him in his poopybutthole","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Arthas is the pinnacle of Zul'jin-killing technology. Arthas' high HP and innate armor combined with Frozen Tempest mean Zul'jin is going to have a very bad time against him. Zul'jin's attack speed and movement speed will slow to a crawl in Frozen Tempest, and if Zul'jin is still crazy enough to get Taz'dingo into an Arthas, Frozen Tempest will instantly kill him once the effect ends.","type":"Counter","patch":"Kael'thas","realVotes":0},{"details":"Don't be afraid!\nZul'jin is a hero that rewards agressive players.\nIf you choose \"You want axe?\" as your to go level 1 talent, don't be afraid. Stick to your support and tank, and deliver as many  AAs you can. \nJust for comparison: If you choose boneslicer, your Q will make you crit with 65% damage. If you have 200 basic attack damage, your total damage in marked enemies will be 330 (without your trait).\nBut if you completed your quest and have 24 stacks (+36 attack damage), your basic attack damage will be 236, and with your Q (50%) your damage in marked enemies will be 354 (without your traid), AAing in a safe distance (+1.1 range)\nBe agressive, and receive the rewards as the game scales into late game.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"Don't get too greedy. Trying to keep your HP low for higher damage is often a good way to get yourself killed.","type":"As","patch":"Kael'thas","realVotes":5},{"details":"Remember to treat your health as a resource, just because you can put mad damage out at 1% doesn't mean you always should. If you can help it try to hover around 50% to get the most out of your talents regarding your auto attacks and trait. \n\nDa Amani de Chuka!","type":"As","patch":"Kael'thas","realVotes":1}],"valeera":[{"details":"Your trait is great for escaping when you split push.","type":"As","patch":"Kael'thas","realVotes":-3},{"details":"Do not engage in her smokescreen. Just walk out.","type":"Counter","patch":"Kael'thas","realVotes":22},{"details":"If you see her attacking a back-liner, do your best as a range to help her out once the opponent gets restored from any stuns or silences.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Just wait for this overpowered char will be balanced","type":"Counter","patch":"Kael'thas","realVotes":-10},{"details":"Always keep in mind her Vanish has an 8 second cooldown (5 seconds if she takes the level 20 Talent).\nIf you see her unstealthed in a team fight she's probably waiting to Vanish into a Stun/Silence on someone so be careful.","type":"Counter","patch":"Kael'thas","realVotes":2},{"details":"She doesn't have much kill potential on her own (aside from killing low hp targets), always try to help her secure a kill when she CCs someone.","type":"Helper","patch":"Kael'thas","realVotes":-3},{"details":"Don't overextend when vanish is on cooldown","type":"As","patch":"Kael'thas","realVotes":6},{"details":"If you have a Valeera in your Team choose talents like Executioner to burst Valeeras targets down.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Valeera's Smokescreen may seem powerful (and it is to a certain degree) but keep in mind that she often has to stay within the smoke to gain value out of this heroic. Unfortunately for her, being unrevealable does not mean she is invulnerable – AoE-Abilities such as Kael'thas' Flamestrike or even Leoric's Drain Hope still damage and affect her while staying within the smoke. Forcing her to step out of it or taking the damage will put her into an unfavorable situation.","type":"Counter","patch":"Kael'thas","realVotes":14},{"details":"Always be vary of stray AoEs knocking you out of stealth, Sometimes it's best to engage out of stealth to make use of the one second unrevealabilty.","type":"As","patch":"Kael'thas","realVotes":-1},{"details":"Try not to overlap CCs with Valeera if you see her creeping up on someone to do her combo. Also don't use knockbacks (Diablo! Auriel!) unnecessarily just because they're off cooldown either.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Valeera offers the only baseline stun in the Assassin Slot available. This gives your darft more flexibility in the other roles if melee stun is needed to counter an enemy hero (i.e. Chen Drinks, Dehaka Drag, Guldans Drain)","type":"As","patch":"Kael'thas","realVotes":3},{"details":"You are not Zeratul/Nova. This means you can start fighting visible then vanish instantly using the openers as mid-fight abilities. This is especially usefull if they use Anti-Stealth (Done, Flare) making it less usefull for them. Vanishing gives a short Undetection.","type":"As","patch":"Kael'thas","realVotes":9},{"details":"Remember that she is very weak and can only kill damaged squishies.","type":"Helper","patch":"Kael'thas","realVotes":-4},{"details":"Different openers serve different purposes, while Cheapshot is good most of the time, try to utilize other 2 for correct situations to maximize your energy, especially the early game. Garrote is good against ability based heroes while Ambush gives you quick burst and fast combo with low energy. Rotate with team or solo roam from lane to lane for kills early game, try to flank or follow up with your warrior during team fights.","type":"As","patch":"Kael'thas","realVotes":1},{"details":"If you play a Hero with a Knockback, do not use it on her target, specially if it is a followup on another stun like ETC.","type":"Helper","patch":"Kael'thas","realVotes":0},{"details":"Remember she is not invincible inside her smoke bomb. Use AoE spells to  force her out / kill her. Or other movement spells like Alarak push or Dehaka tongue.","type":"Counter","patch":"Kael'thas","realVotes":8},{"details":"Pick sentry wards if you hero has the option, can save your and your teammate's life","type":"Counter","patch":"Kael'thas","realVotes":10},{"details":"Don't overextend in a lane if you don't know where valeera is, keep an eye after her player icon on the map and get better at spotting stealths. She preys on over extended squishy targets","type":"Counter","patch":"Kael'thas","realVotes":0}],"lucio":[{"details":"Azmodan","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Make sure to pick Lucio in maps where your team does objectives without being separated. Infernal Shrines, Cursed Hollow, Garden of Terror and Battlefield of Eternity are great for Lucio.","type":"As","patch":"Kael'thas","realVotes":11},{"details":"Often he wants to run behind the enemy team and push with his q people out off position. Punish him for that. He can be bursted down easy, once he is stunned.","type":"Counter","patch":"Kael'thas","realVotes":5},{"details":"If played right, he can outrun anyone - consider heroes with lockdowns (stuns, roots).","type":"Counter","patch":"Kael'thas","realVotes":7},{"details":"Like Tracer, Lucio has the most kiting power against melee heroes (despite the lack of damage). Be careful when chasing him.","type":"Counter","patch":"Kael'thas","realVotes":4},{"details":"Lucio heals/boosts everyone around him, just like Brightwing. Try to rotate in taking damage and don't get too far from him.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"You are squishy! If the enemy has many roots and stuns, be careful with your positioning, as you can be bursted down quickly.","type":"As","patch":"Kael'thas","realVotes":4},{"details":"Stuns are lucio's biggest weakness, Heroes like Varian or Uther are fantastic at disrupting him","type":"Counter","patch":"Kael'thas","realVotes":8},{"details":"Amp up speed boost during team-fights. It allows your squishies to kite better, allows the team to retreat faster if things aren't going well, and it allows melee to stick to what they need to hit. You can also use it to chase down the enemy preventing any of them from retreating safely. All of that is more valuable than the small amount of AOE healing you can provide, especially against an enemy team that focus fires one target.","type":"As","patch":"Kael'thas","realVotes":2},{"details":"Let's Break it DOWN!","type":"Helper","patch":"Kael'thas","realVotes":-3},{"details":"Diablo with his Q is a quintessential counter that can make enemy Lucios wary of wall riding near him at all.","type":"Counter","patch":"Kael'thas","realVotes":1}]}