{"tombofthespiderqueen":{"name":"Tomb of the Spider Queen","description":"Three lane map. One siege camp at the very bottom. Two bruiser camps on the left and right. Boss at the very top.","timings":{"First altar spawn":"0:30","Altar respawn":"0:15","Respawn conditions":"After all Spider Queens die"},"notes":["Unclaimed gems last for 8 seconds.","Channeling an altar takes 6 seconds.","Murky, The Lost Vikings, and Misha each drop 1 gem upon death. All other heroes drop 3 gems upon death. These gems are claimable by the enemy team.","Each hero can hold up to 100 gems. However, The Lost Vikings can hold up to 100 gems each Viking.","Past the 15 minute mark, scaling for Webweavers and their minions jump by 50%.","The queens drop down in front of the closest enemy minions, making it important to clear waves."],"mercenaryTimings":{"Siege Camp":{"initialSpawn":"2:00 minutes","respawn":"3:00 minutes"},"Bruiser Camp":{"initialSpawn":"2:30 minutes","respawn":"4:00 minutes"},"Boss Camp":{"initialSpawn":"3:00 minutes","respawn":"5:00 minutes"}},"bestHeroes":["sylvanas","kaelthas","xul","azmodan","zagara","ragnaros","jaina","johanna","nazeebo","guldan","blaze","sonya"]},"battlefieldofeternity":{"name":"Battlefield of Eternity","description":"Two lane map. One siege camp at the top, another siege camp at the bottom. Two bruiser camps on the left and right. Immortals spawn in the middle, occupying two of the four circles.","timings":{"First Immortals spawn":"1:45","Immortals respawn":"1:45","Respawn conditions":"After the last Immortal dies"},"notes":["An Immortal can spawn in the north, east, south, or west. The enemy immortal is always opposite from yours.","The Immortals' duel is done in two stages. Once one Immortal hits half health, both Immortals reach the second stage by switching to a different position.","When an Immortal is won, the Immortal enters the strongest enemy lane.","When an Immortal is won, it gains shields equal to the remaining health of the enemy team's Immortal.","In lane, an Immortal has ranged attacks so long as it has shields. Each attack it makes drains shields until it has none. It switches to melee afterward.","The Bruiser camp Shamans spawn and respawn two dogs in lane until it is killed. Shamans can also be healed. Shamans are incredibly effective pushers; it's imperative to kill the Shaman first before the dogs.","Spawn configurations<br><br>The first Immortal spawn always spawns first in one of two positions: north/south or south/north. When the Immortals switch, the Immortals go to the opposite side of the teams' map. So the west team's Immortal will be on the east, and the east team's Immortal will be on the west.<br><br>The Immortals' positions in the first stage of their duel must be different than the previous first stage.<br><br>The Immortals' positions in the second stage of their duel must be different than the first stage. NOTE: If this is the second spawn, then the position also cannot be the same as the first spawn's second stage."],"mercenaryTimings":{"Siege Camp":{"initialSpawn":"2:00 minutes","respawn":"3:00 minutes"},"Bruiser Camp":{"initialSpawn":"2:30 minutes","respawn":"4:00 minutes"}},"bestHeroes":["valla","greymane","artanis","lunara","malthael","zuljin","liming","hanzo","sylvanas","tyrande","sgthammer","jaina"]},"blackheartsbay":{"name":"Blackheart's Bay","description":"Three lane map. Large gap between top/mid and bot. Siege camps at bottom-left and bottom-right. Slightly above each siege camp are Doubloon camps, which do not generate any lane mercenaries upon capture. Three bruiser camps are far-left, far-right, and bot. Near the Watchtower are two more Doubloon camps. The Boss camp is at the very top. Chests spawn in the middle.","timings":{"First chests spawn":"0:50","Chests respawn":"2:30 - 3:15","Respawn conditions":"After both chests break"},"notes":["Each hero can hold up to 100 doubloons.","Upon death, a hero will drop all their doubloons.","Each captured camp drops 2 doubloons in addition to the Regeneration Globe.","Blackheart himself spawns at 1:15 minutes.","A team must give Blackheart 10 doubloons to have cannonballs attack enemy team structures. Subsequent turn-ins for that team require 2 more doubloons.","Cannonballs deal 2,815 damage each directly to structures. Cannonballs deal 750 splash damage in a small radius around the impact.","Fountains near Keeps have 2,100 health and 700 shields, which equals 2,800 life overall. One cannonball hit should destroy said fountain. However, Tassadar can shield the fountain to force a second cannonball to kill it. Fountains near Forts have only 2,200 life overall, but Tassadar can force a second cannonball if he takes the Reinforce Structure talent at level 1 or if he's level 15.","Cannonballs attack in this order:<br>1. Outer mid lane<br>2. Outer top lane<br>3. Outer bot lane<br>4. Inner mid lane<br>5. Inner top lane<br>6. Core","The first cannonball volley of the game (regardless of which side fires first) follows special rules if it attacks an outer lane. It will always attack the external towers and gate first before moving onto the fountain and inner tower, then finally the fort.","Within the outer lanes, the cannonball will randomly target the external towers, gate, fountain and inner tower. After that, they will target the fort. Within the inner lanes, the cannonball will randomly target the external towers, gate, and fountain, then randomly target the inner tower and keep. It may be advantageous to destroy inner towers so cannonballs focus the keeps."],"mercenaryTimings":{"Doubloon Camp":{"initialSpawn":"1:30 minutes","respawn":"2:30 minutes"},"Siege Camp":{"initialSpawn":"2:00 minutes","respawn":"3:00 minutes"},"Bruiser Camp":{"initialSpawn":"2:30 minutes","respawn":"4:00 minutes"},"Boss Camp":{"initialSpawn":"3:00 minutes","respawn":"5:00 minutes"}},"bestHeroes":["xul","zagara","illidan","falstad","tracer","zeratul","sonya","rehgar","samuro","etc","brightwing","thrall"]},"braxisholdout":{"name":"Braxis Holdout","description":"Two lane map. Beacons at the top and bottom, toward the middle. The Zerg swarms out of the top and bottom pens. Two siege and two bruiser camps total. Boss camp in the very center.","timings":{"First beacons spawn":"2:00","Beacons respawn":"1:55","Respawn conditions":"After both Zerg swarms die"},"notes":["Capturing a beacon takes 3 seconds if it's uncaptured, or 6 seconds if the enemy has captured it.","Beacons progress by 2% every 0.6 seconds. Going straight from 0% to 100% takes 30 seconds.","The regeneration globes at the top and bottom of the map respawn every 45 seconds.","The initial Zerg wave spawn location is random. Subsequent Zerg waves swap lanes from the previous one.","Zerg waves prioritize minions and structures.","Banelings deal decent kamikaze siege damage but have low HP. It's a good idea to clear those first.","The map's Boss will push the least-pushed lane. If there is no clear decider, then it'll push a random lane.","A Zerg wave consists of zerglings, hydralisks, banelings, guardians, and ultralisks.","Every 5% spawns a new Zergling if the team progress is under 50%. You always have 6 zerglings to start with. (15 maximum.)","Every 5% spawns a new Baneling if the team progress is over 50%. (10 maximum.)","(A team progress of 50% doesn't spawn a Zergling nor a Baneling. As the maximum number of Zerglings becomes an odd number, this means the map is literally unplayable.)","Every 14% spawns a new Hydralisk. (7 maximum.)","Every 30% spawns a new Guardian. (3 maximum.)","Every 50% spawns a new Ultralisk. (2 maximum.) Ultralisks drop a regeneration globe upon death.","Not counting the Zerglings and Banelings, the relevant percentages are: 14%, 28%, 30%, 42%, 50%, 56%, 60%, 70%, 84%, 90%, 98%, 100%."],"mercenaryTimings":{"Siege Camp":{"initialSpawn":"2:00 minutes","respawn":"1:30 minutes"},"Bruiser Camp":{"initialSpawn":"2:30 minutes","respawn":"4:00 minutes"},"Boss Camp":{"initialSpawn":"3:00 minutes","respawn":"4:10 minutes"}},"bestHeroes":["ragnaros","guldan","kaelthas","sylvanas","blaze","johanna","sonya","rexxar","jaina","dehaka","stukov","zagara"]},"cursedhollow":{"name":"Cursed Hollow","description":"Three lane map. Two Watchtowers at top-left and bot-right. Two siege camps, two bruiser camps, and two Boss camps total.","timings":{"First tribute spawn":"2:25 - 3:05","Tribute respawn":"0:50 - 1:30 or 2:00 - 2:40","Respawn conditions":"After the last taken tribute, or after a curse ends."},"notes":["A curse lasts 70 seconds, and each tribute has a timer of 70 seconds with 20 seconds of variance.","Capturing a tribute takes 6 seconds.","The tributes are pseudo-random and spread across 2 rows (top, bot) and 3 columns (left, mid, right).","The first tribute of the game always spawns in one of the mid columns.","All tributes are partitioned into sets of threes. That is, the 1st, 2nd, and 3rd tributes of the game are a single set, as are the 4th, 5th, and 6th tributes. However, the 2nd, 3rd, and 4th tributes don't make a set.","A tribute cannot spawn in the same spot as the previous tribute.","3 consecutive tributes cannot spawn in the same row, even if part of a different set.","Tributes in a set cannot spawn in the same column.","Finally, the tribute spawns in one of the remaining possible locations.","Example: Tribute #2 spawns top left. Tribute #3 spawns top right. Because of rule 2, tribute #4 will spawn in the bottom row, but since tribute #4 is the first tribute of a new set, rule 3 does not apply, and so the column will be random."],"mercenaryTimings":{"Siege Camp":{"initialSpawn":"2:00 minutes","respawn":"3:00 minutes"},"Bruiser Camp":{"initialSpawn":"2:30 minutes","respawn":"4:00 minutes"},"Boss Camp":{"initialSpawn":"3:00 minutes","respawn":"5:00 minutes"}},"bestHeroes":["dehaka","falstad","abathur","brightwing","liming","junkrat","etc","chromie","thelostvikings","kaelthas","nazeebo","genji"]},"dragonshire":{"name":"Dragon Shire","description":"Three lane map. Two siege camps and three bruiser camps total.","timings":{"First shrines spawn":"1:15","Shrines respawn":"2:00","Respawn conditions":"After the last dragon dies"},"notes":["Channeling the Dragon Knight statue takes 3 seconds.","Capturing an uncaptured shrine takes 4 seconds. If the shrine has been captured by the enemy team, capturing it will take 8 seconds.","That means if an enemy starts re-capturing a shrine just as you start channeling the Dragon Knight statue, you will finish channeling with a second to spare.","The dragon lasts (50 + 2 × each full minute of game time) seconds. So if the game time is 17:54, the dragon will last 84 seconds, or 1:24 minutes."],"mercenaryTimings":{"Siege Camp":{"initialSpawn":"2:00 minutes","respawn":"3:00 minutes"},"Bruiser Camp":{"initialSpawn":"2:30 minutes","respawn":"4:00 minutes"}},"bestHeroes":["falstad","dehaka","brightwing","leoric","thrall","zagara","garrosh","johanna","zeratul","rehgar","anubarak","nazeebo"]},"gardenofterror":{"name":"Garden of Terror","description":"Three lane map. Four siege camps and two bruiser camps total.","timings":{"First seeds spawn":"1:30","Seeds respawn":"3:20","Respawn conditions":"After all plant monsters die"},"notes":["Small seed camps grant 15 seeds. Garden terrors grant 60 seeds. In total, a single night contains 180 seeds.","The pod image next to each team's seed count is either open or closed. If it's closed, there aren't enough seeds remaining for that team to get a terror.","When the terrors reach 70% HP and 30% HP, they drops a purple regeneration globe.","Terrors drop 5 seeds per 10% HP lost, starting at 80% HP. When a terror dies, it drops 20 seeds.","Small seed camps consist of three seed minions. Each seed minion drops 1 seed per 30% HP lost. When a small seed minion dies, it drops 2 seeds for a total of 5 seeds."],"mercenaryTimings":{"Siege Camp":{"initialSpawn":"2:00 minutes","respawn":"3:00 minutes"},"Bruiser Camp":{"initialSpawn":"2:30 minutes","respawn":"4:00 minutes"}},"bestHeroes":["johanna","thelostvikings","murky","valla","greymane","sylvanas","rehgar","diablo","malthael","kaelthas","anubarak","tracer"]},"infernalshrines":{"name":"Infernal Shrines","description":"Three lane map. Three siege camps and two bruiser camps. Punisher shrines spawn in one of the three circles in the middle.","timings":{"First shrine spawn":"~1:55","Shrine respawn":"~1:55","Respawn conditions":"After the last Punisher dies"},"notes":["Shrines spawn in one of 3 locations with one of 3 Punisher types.","99.985% of the time, a shrine's location and type will both be different from the previous one. Otherwise (0.015%), a shrine's location and/or type can be the same as the previous one.","You can tell which Punisher will spawn by the color of the shrine. Purple is Arcane, orange is Mortar, and blue is Frozen.","The Bruiser camp Shamans spawn and respawn two dogs in lane until it is killed. Shamans can also be healed. Shamans are incredibly effective pushers; it's imperative to kill the Shaman first before the dogs.","The shrine monsters spawn in 0.15 second intervals until 10 monsters exist. From that point, a 5-second timer starts, which triggers another Shrine monster spawn."],"mercenaryTimings":{"Siege Camp":{"initialSpawn":"2:00 minutes","respawn":"3:00 minutes"},"Bruiser Camp":{"initialSpawn":"2:30 minutes","respawn":"4:00 minutes"}},"bestHeroes":["kaelthas","johanna","jaina","sonya","guldan","sylvanas","ragnaros","kerrigan","azmodan","leoric","xul","arthas"]},"skytemple":{"name":"Sky Temple","description":"Three lane map. Watchtower between top and mid lanes. Two siege camps between bot and mid lanes, on the left and right. Two bruiser camps between top and mid lanes, on the left and right. Another bruiser camp at the very bottom. Boss between bot and mid lanes, in the middle. Temples spawn in the three engraved circles top, mid, and bot.","timings":{"First temples spawn":"1:30","Temples respawn":"2:00","Respawn conditions":"After all temples clear"},"notes":["A configuration of temples will not spawn twice in a row.","Three temples never spawn at once.","In most cases, the first three spawns are most actionable. The temples spawn in this order:<br>1. Top and mid temples.<br><br>2. Bottom temple.<br><br>3. Bottom and randomly chosen between top or mid.<br><br>4. 50% chance of one temple, randomly chosen. 50% chance of two temples: the temple that the third spawn didn't activate, and another randomly chosen temple. This means the temple not activated in the third spawn has a 2/3 chance of spawning.<br><br>5. The 4th and 5th spawns rotate the number of temples. So if the previous spawn activated two temples, then this spawn activates one randomly chosen temple. If the previous spawn activated one temple, then this spawn activates two randomly chosen temples.<br><br>6. We can predict the sixth spawn with nearly 100% accuracy, but it's complicated. The next spawn is based on the previous three temple activations. It tries to reach an activation goal: 3-2-2 or 2-3-2.<br>If top has activated more than mid, then the activation goal is 3-2-2. If mid has activated more than top, then the activation goal is 2-3-2. If top has activated as much as mid, then the activation goal is randomly selected between 3-2-2 and 2-3-2.<br>The temples that have not reached these activation goals will be activated next. In practical terms, these are all the possible configurations (bot is always activated at least once):<br>> 2-0-3: top and mid.<br>> 0-2-3: top and mid.<br>> 1-1-3: top and mid.<br>> 3-0-2: mid temple only.<br>> 0-3-2: top temple only.<br>> 2-1-2: top and mid.<br>> 1-2-2: top and mid.<br>> 3-1-1: mid and bot.<br>> 1-3-1: top and bot.<br>> 2-2-1: bot and random between top and mid.<br>In other words, If top or mid temple has been activated thrice, then that temple will not be activated. If bottom temple has been activated twice or more, then that temple will not be activated. The temples will now spawn to match the activation goals.<br><br>7. Each spawn from now on can't repeat the same number of temples three times in a row (ignoring spawns #1-6). That means if spawn #7 and #8 have two temples, then spawn #9 must have only one temple. When the temple numbers change, the temple spawn locations are completely random.<br>If two spawns in a row have repeated numbers, the second spawn follows special rules to ensure we don't repeat temple configurations. If the spawned number of temples is two after a previous two-spawn, then one of the temples will always be the left-out temple from the previous spawn. If the spawned number of temples is one after a previous single-spawn, then the next temple will be one of the remaining two temples.<br>If we aren't repeating the number of temples, then a two-spawn has a 2/3 chance of occurring, and a one-spawn has a 1/3 chance of occurring.<br>Since we can only predict with certainty whether the next spawn will not be a repeat, we can only derive probabilities for the next temples.","Each temple has their own individual attack rules. Generally, a temple's priorities are:<br>1. Attack outer lanes, starting with their lane. (Middle temple attacks top lane after middle is cleared.)<br>2. Attack inner lanes, again starting from their lane.<br>3. Attack core.","Within each group of buildings (e.g. outer mid lane), each temple has special rules. Generally:<br>1. Attack external towers and gate. The order depends on distance.<br>2. Attack internal tower, fountain, and fort. The order depends on distance.<br> This has some implications. For example, top temple will attack top lane's inner tower before the fort, whereas the middle temple will attack the fort first before going to the inner tower. That means top temple will give a slight XP lead if it manages to snag the top inner tower.","The exact attack order for each temple hasn't been confirmed yet, and only incomplete data exists. This data is in the process of being collected and presented."],"mercenaryTimings":{"Siege Camp":{"initialSpawn":"2:00 minutes","respawn":"3:00 minutes"},"Bruiser Camp":{"initialSpawn":"2:30 minutes","respawn":"4:00 minutes"},"Boss Camp":{"initialSpawn":"3:00 minutes","respawn":"5:00 minutes"}},"bestHeroes":["dehaka","brightwing","falstad","zagara","nazeebo","sonya","samuro","artanis","kaelthas","thrall","murky","rehgar"]},"towersofdoom":{"name":"Towers of Doom","description":"Three lane map. Two siege camps between bot and mid lanes, on the left and right. Another siege camp at the very top. Boss between top and mid lanes.","timings":{"First altars spawn":"1:50-2:20","Altars respwan":"1:50 - 2:20","Respawn conditions":"After all altars captured"},"notes":["Capturing an altar takes 6 seconds.","The possible configurations of altars are:<br>1. Top-left and top right altars<br>2. Middle altar.<br>3. Bottom altar.<br>4. Middle and bottom altars.<br>5. Top-left, top-right, and middle altars.<br>6. Top-left, top-right, and bottom altars.","The first and fifth set of altars always spawn as three altars at once. Other sets always spawn as one or two altars at once.","The first six altar spawns have unique configurations. The next four altar spawns have unique configurations (as we no longer have three-altar spawns). After the tenth set, the next configuration is randomly chosen between all the one- or two-altar configurations, which means there is now a chance of repeating.","This means we will always know the 5th, 6th, and 10th altar spawn configurations.","The one-way tunnel from your base to the middle of the battlefield opens at 12:00 minutes, or, if altars have spawned, 15 seconds after the last altar is captured.","Minor technical detail: If altars spawn within 11:45-12:00 minutes, then the tunnel opens one second after the altars spawn.","When the tunnel opens, all forts upgrade to keeps, including their Kill EXP given. Less significantly, towers and healing fountains also upgrade, affecting their HP and shields.","If you capture all six towers (forts or keeps), your team's Core will periodically fire at the enemy team's Core for one point of damage each.","Captured siege mercenaries that reach the enemy core deal a point of damage each.","Mercenary Lord increases the kamikaze damage siege mercenaries do.","A captured Boss mercenary deals 4 points of damage to the enemy Core instead of spawning a mercenary in lane.","When attacking the boss, a green flying skull occasionally spirals out. If this skull hits a hero, it transforms into a green pool that deals percentage damage within a circle. This percentage damage increases with the length of the game."],"mercenaryTimings":{"Siege Camp":{"initialSpawn":"2:00 minutes","respawn":"1:45 minutes"},"Boss Camp":{"initialSpawn":"5:00 minutes","respawn":"5:00 minutes"}},"bestHeroes":["dehaka","falstad","chromie","stukov","liming","zagara","brightwing","johanna","junkrat","genji","sylvanas","thrall"]},"warheadjunction":{"name":"Warhead Junction","description":"Three lane map. Two siege camps and two bruiser camps on the left and right. Two Boss camps, one at the very top, and another at the bottom. Nine possible warhead spawn points; three at the bottom, three in middle, three at the top.","timings":{"First warheads spawn":"2:00","Warheads respawn":"2:55","Respawn conditions":"After all warheads collected"},"notes":["Each hero can only hold 1 nuke at a time. For The Lost Vikings, each Viking can hold one.","Nukes have a 1.5-second cast-time and, once cast, take 4 seconds before exploding.","Upon death, a hero drops any warhead they're holding.","Nukes deal 2,300 base damage.","Nukes deal 70% extra damage in the center.","Nukes scale by a flat 70 every minute. For example, at minute 20, they deal 3,700 damage (6,290 in the center).","The exception is heroes. Nukes hit heroes for 30% of their max health, and 45% in the center. Note that the center increases damage by 50%, not 70%.","2 or 4 warheads spawn at a time.","Nukes spawn in 3 possible lanes: top, mid, and bot.","The number of nukes is fixed, and cycles. Objective spawn #1 has 2 nukes. Spawn #2 has 4 nukes. Spawn #3 has 2 nukes, and so on.","Each objective spawn picks one lane from the 3 possible lanes. This lane must differ from 2 spawns ago. On odd cycles, this lane has 0 nukes (2 nukes total). On even cycles, this lane has 2 nukes (4 nukes total).","Example: Spawn #3 can have bot lane empty of nukes, and spawn #4 can have bot lane have two nukes. However, because spawn #3 picked bot lane, spawn #5 cannot also pick bot lane.","You should use early Nukes to destroy the outer walls, healing well, and towers of each Fort to maximize your XP.","Nuke as many structures as you can at Forts, always hit center with Keeps. XP is important early but securing Keeps is important late.","If you are going to die and you have a nuke, use it before you die so that enemies cannot pick it up and use it against you.","Nukes can be used against Merc camps, including bosses. If you are defending alone against a big push, you can nuke the entire enemy wave, merc camps, and incoming boss. You can also nuke a boss to capture it faster (but this is very niche).","Nuke damage versus Heroes cannot be reduced via Resistance or Spell Shield, but it can be shielded with Heroes like Tassadar.","You'll almost never want to use a nuke on a fort if all towers and gates are already dead, it's better to just attack it and save the nuke for difficult-to-break sieges."],"mercenaryTimings":{"Siege Camp":{"initialSpawn":"2:00 minutes","respawn":"1:30 minutes"},"Bruiser Camp":{"initialSpawn":"2:30 minutes","respawn":"4:00 minutes"},"Boss Camp":{"initialSpawn":"3:00 minutes","respawn":"5:00 minutes"}},"bestHeroes":["dehaka","brightwing","falstad","thelostvikings","zagara","abathur","illidan","etc","lucio","zeratul","ragnaros","samuro"]},"hauntedmines":{"name":"Haunted Mines","description":"Two lane map. Four siege camps.","timings":{"First objective spawn":"2:00","Objective respwan":"2:00","Respawn conditions":"After both golems die"},"notes":["The mines are closed until the first objective spawns. After that, they remain open.","The Sapper camps deal more damage than the actual map objective, the Golem.","The initial Golem spawn is random. Subsequent Golem spawns swap lanes from the previous one.","When the Boss camp reaches 70% HP and 30% HP, it drops a purple regeneration globe.","4 minutes after each objective phase, the game takes stock of the skulls collected. If 60 or more skulls have been collected, the game takes a snapshot of the Golems' scaling and they won't scale further with time for that objective phase. However, skulls will still count toward scaling.","Each objective phase creates 100 skulls total. In the Underground, there are 9 skull camps each, one being a Boss camp.","There are 36 minions divided among 8 camps. Two camps in the top right and two camps in the bottom left have 5 minions each. The other 4 camps have 4 minions each. Minions drop 2 skulls upon death.","The Boss camp drops 28 skulls total. It drops 6 skulls at 75% HP, 6 skulls at 50% HP, 6 skulls at 25% HP, then 10 skulls once killed.","The Golem's base damage is 110.","The Golem's base HP is 4000.","The Golem's damage scales by 0.5 flat damage per minute up through 15:00. After that, damage scales by 3.0 flat damage per minute up through 25:00. That means at 15:00, the Golem has 117.5 damage, a 6.8% increase from the beginning of the game. Yes, this is low.","The Golem's HP increases by 700 per minute up through 5:00, by 300 up through 10:00, by 500 up through 15:00, then by 600 up through 25:00.","Each Golem gets skull stacks based on the skulls you collected — each skull stack grants 5% bonuses to HP and damage, applied after the time-based scaling.","However, the skulls you collect do not precisely convert to the number of skull stacks. The game applies a formula to the skull stacks: -0.0054 × s × s + 1.2913 × s, rounded down, where s is the skulls you collected. This formula applies a minor catch-up effect until you collect 54 skulls. At that point, the more skulls you get, the less impact they will have. At 100 skulls, you'll have 75 stacks.","Example: At 5:27 (5 minutes) the Golem has spawned in lane and is pushing. Your team has collected 66 skulls. Applying the skull stack formula, we get 61 skull stacks, or a 4.05 multiplier. The Golem's HP is (4000 + 700 × 5) × (1 + 61 × 0.05) = 30,375. The Golem's damage is (110 + 0.5 × 5) × (1 + 61 × 0.05) = 456."],"mercenaryTimings":{"Siege Camp":{"initialSpawn":"1:30 minutes","respawn":"3:00 minutes"},"Sapper Camp":{"initialSpawn":"0:45 minutes","respawn":"1:45 minutes"}},"bestHeroes":["sylvanas","jaina","tassadar","johanna","arthas","malthael","ragnaros","brightwing","malfurion","nazeebo","kelthuzad","leoric"]},"hanamura":{"name":"Hanamura","description":"Two-lane map. Recon camps spawn in the center, in the top-left and bottom-right directions. Fortification camps spawn in the top-left and bottom-right corners of the map, near one of the payload delivery points. Support camps spawn in the center, in the left and right directions. Boss spawns in the very center of the map.","timings":{"Center payloads spawn":"2:30","Center payloads respawn":"4:00","Edge payloads spawn":"4:30","Edge payloads respawn":"4:00","Respawn conditions":"After payload hits enemy core"},"notes":["Each Core has 7 points of health total. You cannot attack the Core directly.","Two payloads per team spawn in the center and on the edge of the map. Upon reaching their destination, they deal 1 Core damage.","Delivered payloads deal +1 additional damage per destroyed Fort or Keep. This additional damage does not apply to the next delivery.","Destroying an enemy lane's fort and keep creates a Sapper minion for you every other minion wave. This Sapper minion puts intense pressure on the enemy; if it reaches the enemy Core, it will deal 1 Core damage.","Mercenary camps grant large EXP bonuses to the capturing team.","Enemy payload paths intersect with yours. If your payload is on the intersection, then it will block the enemy payload from moving.","Capturing mercenary camps do not spawn mercenaries in lane.","A captured Boss mercenary deals 1 enemy Core damage.","The payloads each have their own respawn timers; they respawn independently from other payloads.","Payload delivery timings<br><br>Speed depends on the number of nearby allied heroes (3 max).<br>1 hero: 50 seconds to escort.<br>2 heroes: 40 seconds to escort.<br>3 heroes: 30 seconds to escort.<br>If left alone for 10 seconds, the payload starts to reverse. It takes 2:15 minutes to return to the initial position from the delivery point.","Mercenary details<br><br>All mercenary camps except the Boss drop an item. Once picked up, you can use the item with the Map Mechanic Ability hotkey.<br><br>Recon camps: The Henchmen deal little damage and are easy to kill. Once captured, the camp drops Dragon Spirits. Dragon Spirits, when used, seeks out the nearest 3 enemy heroes and reveals them for 5 seconds. A Dragon Spirit is destroyed when it finds a hero or after 10 seconds.<br><br>Fortification camps: The mechanic repairs the turret, so kill the mechanic first. Once captured, the camp drops a Turret. The Turret can be placed on a payload or on the ground to body-block heroes.<br><br>Support camp: The Sentinel occasionally heals itself. Once captured, the camp drops a Healing Pulse. Once used, the token restores 35% HP and 23% mana over 15 seconds to you and all nearby allies at the time.<br><br>Boss camp: The Boss gorges a hero for 5 seconds with a 12-second cooldown. After gorging, the Boss creates a ring of fire that does periodic damage. Once captured, the Boss deals 1 Core damage to the enemy team."],"mercenaryTimings":{"Recon Camp":{"initialSpawn":"1:00 minutes","respawn":"2:00 minutes"},"Fortification Camp":{"initialSpawn":"1:30 minutes","respawn":"2:30 minutes"},"Support Camp":{"initialSpawn":"2:30 minutes","respawn":"3:00 minutes"},"Boss Camp":{"initialSpawn":"5:00 minutes","respawn":"5:00 minutes"}},"bestHeroes":["brightwing","azmodan","falstad","lucio","varian","genji","rexxar","dehaka","muradin","valeera","dva","tracer"]}}