{"braxisholdout":[{"name":"2016-10-18 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20328243/heroes-of-the-storm-patch-notes-october-18-2016","content":"\n              Bug Fixes\n              \nBraxis Holdout: Fixed an issue in which a captured Archangel could target enemy Heroes with its Bullet Storm Ability.\n\n\n              \nBraxis Holdout: Fixed an issue in which Zagara’s Mutalisk could cause a captured Archangel to exhibit pathing issues.\n\n\n              \nBraxis Holdout: Neutral Raven Mercenaries will no longer clip into the terrain after being knocked back.\n\n\n            "},{"name":"2016-09-27 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20285864/heroes-of-the-storm-patch-notes-september-27-2016","content":"\n              Battleground Updates\n              \nAll Zerg Units have received the following changes:\n\nEarly-game damage scaling significantly reduced\nMid-game damage scaling slightly reduced\nLate-game damage scaling moderately increased\n\nBanelings\n\nBase damage increased by 20%\n\nHydralisks\n\nBase damage increased by 25%\n\nGuardians\n\nBase damage increased by roughly 17%\n\nUltralisks\n\nBase damage increased by 20%\n\n\n\n\n  Developer Comments: We’ve noticed a few more one-sided games than we’d\n  like on Braxis Holdout. The battleground plays faster by design, but we think\n  that a few changes to reduce the early game effectiveness of the zerg will put\n  the balance closer to what we’d like after the battleground goes live.\n\n\n            "},{"name":"2016-09-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20243513/heroes-of-the-storm-patch-notes-september-13-2016","content":"\n              Design & Gameplay\n              Mounts\n\n\nMovement Speed reduced from 40 to 30%\n\n\nRegeneration Globes\n\n\nTime before Globes despawn reduced from 8 to 6 seconds\n\n\n              Battleground Updates\n              The Dominion used the remote and hostile planet Braxis to conduct experiments\non ways to turn the Zerg swarm into a weapon they could unleash on their\nenemies. Though the Dominion's main psi disrupter was destroyed, this space\nplatform's beacons remain fully operational and ready to be used. Capture the\nbeacons and watch what happens when a flood of weaponized Zerg ravages the\nbattlefield.\n\n\nCapture the Beacons\n\nTwo Beacons will periodically spawn near the center of the Battleground. Capture both to fill your team’s Holding Cell with Zerg over time.\n\nFill Holding Cells\n\nThe longer a team holds both Beacons, the stronger and more numerous their Zerg army will become. Once either team has completely filled their Holding Cell, both will open, unleashing Zerg forces into each lane.\n\nUnleash the Swarm\n\nEach team must decide whether to defend against the opposing Zerg rush, or push with their own to lay siege to all who stand in the way of the Swarm.\n\n\n\n              Battlegrounds\n              Mercenaries\n\n\nTiming Changes\n\nPreviously all Mercenary camps spawned at 120 seconds. The following adjustments have been made to spawn times:\n\n90 seconds: Sappers, Doubloon Pirates\n120 seconds: Siege Giants (unchanged), Impalers (unchanged)\n150 seconds: Knights, Fallen Shaman\n180 seconds: Grave Golem (unchanged)\n300 seconds: Headless Horseman (unchanged)\n\n\nCaptured Mercenaries will no longer grant Experience when killed.\n\n\n\n  Developer Comments: We started playtesting with staggered Mercenary\n  Camp spawn times, and quickly began to realize that it added more strategic\n  depth to the game, and coincided with some of our Battleground events. We have\n  been happy with the changes overall, and are listening to any feedback you may\n  have!\n\n\n              Bug Fixes\n              \nHeroes can no longer push captured Mercenaries by walking into them.\n\n\n            "}],"gardenofterror":[{"name":"2016-10-18 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20328243/heroes-of-the-storm-patch-notes-october-18-2016","content":"\n              Bug Fixes\n              \nGarden of Terror: Shielding a Structure will no longer prevent a Garden Terror's bonus siege damage from being applied.\n\n\n            "},{"name":"2016-09-27 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20285864/heroes-of-the-storm-patch-notes-september-27-2016","content":"\n              Bug Fixes\n              \nAnub'arak: It is no longer possible to cast Cocoon on Heroic Vehicles, such as the Garden Terror or Dragon Knight.Garden of Terror, Dragon Shire\n\n\n              \nDiablo: It is no longer possible to cast Overpower on Heroic Vehicles, such as the Garden Terror or Dragon Knight.Garden of Terror, Dragon Shire\n\n\n            "},{"name":"2016-09-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20243513/heroes-of-the-storm-patch-notes-september-13-2016","content":"\n              Design & Gameplay\n              Mounts\n\n\nMovement Speed reduced from 40 to 30%\n\n\nRegeneration Globes\n\n\nTime before Globes despawn reduced from 8 to 6 seconds\n\n\n              Battlegrounds\n              Mercenaries\n\n\nTiming Changes\n\nPreviously all Mercenary camps spawned at 120 seconds. The following adjustments have been made to spawn times:\n\n90 seconds: Sappers, Doubloon Pirates\n120 seconds: Siege Giants (unchanged), Impalers (unchanged)\n150 seconds: Knights, Fallen Shaman\n180 seconds: Grave Golem (unchanged)\n300 seconds: Headless Horseman (unchanged)\n\n\nCaptured Mercenaries will no longer grant Experience when killed.\n\n\n\n  Developer Comments: We started playtesting with staggered Mercenary\n  Camp spawn times, and quickly began to realize that it added more strategic\n  depth to the game, and coincided with some of our Battleground events. We have\n  been happy with the changes overall, and are listening to any feedback you may\n  have!\n\n\n              Bug Fixes\n              \nHeroes can no longer push captured Mercenaries by walking into them.\n\n\n            "},{"name":"2016-08-09 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20212896/heroes-of-the-storm-patch-notes-august-9-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer push Neutral and Enemy Mercenaries by walking into them.\n\n\n              \nGarden of Terror: Fixed an issue which prevented the Garden Terror’s Overgrowth from being cast if its area of effect would overlap with the opposing team’s Hall of Storms.\n\n\n            "},{"name":"2016-07-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20184555/heroes-of-the-storm-balance-update-july-27-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer be pushed by walking another Hero into them. \n\n\n              \nCollision: Heroes who are channeling an Ability can no longer be pushed when another Hero walks into them during the channel. \n\n\n            "},{"name":"2016-07-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20164442/heroes-of-the-storm-patch-notes-july-12-2016","content":"\n              Design & Gameplay\n              Core\n\n\nVictory determination is now much more precise in situations where both Cores are destroyed within fractions of a second. As a result, Victory will no longer be decided at random in cases where it appears that both Cores are destroyed at the same moment.\n\n\nRegeneration Globes\n\n\nHealth Regeneration\n\nPreviously: Restore 6.24% of maximum Health over 4 seconds\nNow: Restore 12% of maximum Health over 5 seconds\n\nMana Regeneration\n\nPreviously: Restore 32 Mana over 4 seconds.\nNow: Restore 8% of maximum Mana over 5 seconds\n\n\n\n\n  Developer Comments: Thank you for all your discussion and feedback on\n  our recent Health sustain post! We are still heavily evaluating a lot of it\n  but wanted to get the first round of changes in. Internally, we enjoyed the\n  increased importance on Regeneration Globes and have cleaned up the system a\n  bit. With a larger importance, denying enemies their Globes in lane has a much\n  larger impact.\n\n\nHealing Wells\n\n\nCooldown increased from 100 to 120 seconds\nHealth Regeneration\n\nPreviously: Restore 41% of maximum Health over 20 seconds.\nNow: Restore 40% of maximum Health over 20 seconds.\n\nMana Regeneration\n\nPreviously: Restore 20% of maximum Mana over 20 seconds.\nNow: Restore 30% of maximum Mana over 20 seconds.\n\n\n\n\n  Developer Comments: Much like the changes to Regeneration Globes, we\n  wanted to add a larger impact to the moment you click a Healing Well. Again,\n  we cleaned up the system a fair bit (hence the ~41% to 40% Health change) and\n  added a larger impact for heavy Mana users. The increased cooldown should make\n  the decision of when to tap the Healing Well slightly more interesting.\n\n\nMinions\n\n\nRanged, Melee, and Wizard Minions\n\nNow deal an additional 50% damage to Structures.\n\n\n\n\n  Developer Comments: Our goal with this change is to make escorting\n  Minions to Towns to be more impactful, such that they can really start to do\n  some damage if left unattended. Before this change, Minions were primarily XP\n  carriers that absorbed some Ammo shots from Towers. Now the armies of the\n  Nexus are a bit scarier when they march down a lane.\n\n\n\nCatapult Minions\n\nAttack range increased by 20%.\nSight range increased by 17%.\nWill now fixate on Structures. Catapults will not acquire a new target after fixating until the target is destroyed or the Catapult is killed.\n\n\n\n\n  Developer Comments: Catapults would often reach the Core, but have a\n  Minion wave spawn on them, distract them, and allow them to be killed off\n  before doing any significant damage. With increased range and fixation on a\n  Structure once they’ve started attacking, even one Catapult will more\n  consistently punch through a Core’s Shield and do actual damage.\n\n\n              Battleground Updates\n              \nIncreased Overgrowth's damage bonus against Structures from 100% to 200%.\n\n\n\n  Developer Comments: In an effort to reduce the game length on Garden\n  of Terror, we’re increasing the bonus damage that Garden Terrors deal to\n  Structures. We’re not quite happy with the way that Garden of Terror is\n  playing at the moment, and will likely be making larger changes if the current\n  tuning adjustments don’t make it more enjoyable.\n\n\n            "},{"name":"2016-06-14 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20143449/heroes-of-the-storm-patch-notes-june-14-2016","content":"\n              Bug Fixes\n              \nGarden of Terror: The Garden Terror's basic attack splash will now correctly deal bonus damage to structures affected by Overgrowth.\n\n\n            "},{"name":"2016-05-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20120032/heroes-of-the-storm-patch-notes-may-17-2016","content":"\n              Battlegrounds\n              Healing Well\n\n\n25% of a Healing Well’s maximum Health has been converted into a Shield. Shield Regeneration delay of 8 seconds.\n\n\n\n  Developer Comments: We’ve noticed some rather un-fun behavior in the\n  form of sniping Healing Wells over time using very long range Abilities. While\n  we’re okay with players doing this to a degree, we found it was too effective\n  given how little counterplay there was. To help solve this, turned a sizable\n  portion of Healing Well Health into a Shield. This means that if you offer\n  your Healing Well some respite from enemy attacks by chasing opponents away\n  every now and then, it will start to regenerate some of that Shield. Only\n  you can protect Healing Wells from those pesky Arcane Orbs!\n\n\n              Bug Fixes\n              \nFixed an issue in which attacking enemy Walls at certain angles would cause the Hero’s Basic Attack animation to play, but deal no damage.\n\n\n            "},{"name":"2016-04-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20102776/heroes-of-the-storm-balance-update-notes-april-27-2016","content":"\n              Bug Fixes\n              \nIssuing a Mount command while holding down the right mouse button to move will no longer interrupt Mount channeling.\n\n\n            "},{"name":"2016-04-19 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20099322/heroes-of-the-storm-patch-notes-april-19-2016","content":"\n              Bug Fixes\n              \nRe-issuing an attack order on a Structure in the Fog of War will no longer cause Basic Attack animations to repeat without applying damage.\n\n\n            "},{"name":"2016-03-29 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20063493/heroes-of-the-storm-patch-notes-march-29-2016","content":"\n              Battleground Updates\n              \nGarden Terror (Player Controlled)\n\nBasic Attack damage reduced by 15%\nBasic Attacks now deal 50% damage to nearby non-Heroic enemies\nBasic Attacks now instantly kill Minions\nOvergrowth (W)\n\nNo longer affects Minions or Mercenaries\nNo longer deals damage to Structures\nGarden Terror now deals 100% bonus damage to Structures disabled by Overgrowth\nMaximum duration increased from 15 to 25 seconds\nCooldown increased from 15 to 25 seconds\nHealth increased by 100%\n\n\n\n\n\n  Developer Comments: We don’t like the common (and, usually, optimal)\n  gameplay tactic of playing hit-and-run with the Garden Terror. Chasing it as\n  it ran between lanes dropping Overgrowths wasn’t enjoyable for the defending\n  team, and didn’t fit the spirit of what the Garden Terror was intended to do.\n  The new functionality attempts to create a larger “moment” when Overgrowth is\n  placed, as it gives a huge bonus—provided the Garden Terror can attack—and\n  also makes killing the Overgrowth a bigger deal. Overall, we think Garden\n  Terror combat will be more interesting and tactical.\n\n\n            "},{"name":"2016-03-01 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20049139/heroes-of-the-storm-patch-notes-march-1-2016","content":"\n              Bug Fixes\n              \nTowers will now properly fire Ammo provided by an allied M.U.L.E. immediately after 2 Ammo has been restored.\n\n\n            "},{"name":"2016-02-10 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20008204/heroes-of-the-storm-balance-update-notes-february-10-2016","content":"\n              Bug Fixes\n              \nDying will no longer cause the player’s Healing Well cooldown to reset.\n\n\n            "},{"name":"2016-02-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19995509/heroes-of-the-storm-patch-notes-february-2-2016","content":"\n              Design & Gameplay\n              Battleground Monsters\n\n\nBattleground-specific creatures are now universally defined as Monsters (ex: Neutral Garden Terrors, Sky Temple Guardians, etc.)\nSeveral Talents and Abilities have been changed to reflect this new categorization, and the following no longer affect Monsters:\n\nMercenary Lord\nJohanna's Knight Takes Pawn\nLunara's Cruel Bloom\nRexxar's Easy Prey and Bird of Prey\nThe Butcher's Chop Meat\n\nThe following now affect Monsters:\n\nAnub'arak's Beetle, Juiced\nAzmodan's Demonic Smite\n\nSeveral Talents that could previously trigger against both captured Mercenaries and Minions will now only affect Minions (ex: Seasoned Marksman, Black Soulstone, etc.)\n\n\n              Battlegrounds\n              Structures\n\n\nTowers, Forts, and Keeps now deal 50% bonus damage to Heroes\nCores will now display an “Invulnerable” message if attacked by an enemy when no allied Keeps have been destroyed.\nStructures can no longer be made Vulnerable\n\n\n\n  Developer Comments: The scaling changes we released in December made\n  it so Heroes could dive into Structures with impunity during the early game.\n  Increasing the damage that Structures deal to Heroes allows defending players\n  to feel a bit safer. We are exploring other fixes to help Structures feel more\n  meaningful throughout the game and will release them when they are ready.\n\n\n              Bug Fixes\n              \nAI-piloted Dragon Knights and Garden Terrors can now properly follow the player when pinged.Dragon Shire, Garden of Terror\n\n\n              \nDiagonally placed shrubs will now properly hide Heroes within them.\n\n\n              \nPlayers punted out of an enemy Hall of Storms will no longer be persistently stunned if an enemy unit blocked the path of the punt.\n\n\n              \nSilences will no longer prevent Heroes from entering a Dragon Knight or Garden Terror.Dragon Shire, Garden of Terror\n\n\n            "},{"name":"2015-12-15 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19981657/heroes-of-the-storm-patch-notes-december-15-2015","content":"\n              Bug Fixes\n              \nDiagonally placed Shrubs will no longer sometimes fail to properly hide a Hero within.\n\n\n            "},{"name":"2015-11-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19960704/heroes-of-the-storm-patch-notes-november-17-2015","content":"\n              Design & Gameplay\n              Scaling Changes\n\n\nHealth and damage scaling for all Heroes, Battleground Events, Minions, and Mercenaries has been changed from flat, additive values to values that are multiplicative by percentage.\nA large portion of Heroes’ total scaling amounts, which were previously gained over the course of a game, have been added to their base values.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: Due to the way that our old level scaling system worked, early game level discrepancies created a larger difference in power level than we liked.  This often led to situations where a team could be up two or more levels early in a game, and use this advantage to create a larger lead.  We didn’t feel that games were fun for the winning or losing team in these types of scenarios.   As a result of these changes, all Heroes will have more power early, but gain less from each level.  Battleground Events, Minions, Mercenaries, and Structures have all been adjusted to compensate for this and should feel close to what they did previously.   The aim of these adjustments to the scaling system is to make level differences have a similar impact on your Hero’s statistics at all points in a game.  Now, each level offers about 4% Health and 4% damage, which mirrors what late game leads felt like in our previous version of the game.  It is important to note, that while being down a few levels will be less punishing than it was previously, Talent tier advantages can and will still have a noticeable impact on enemy engagements.\n\n\nRespawn Timers\n\n\nRespawn timers have been increased for levels 1 – 10.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: In order to reward players for getting early game\n  Takedowns, we’re also increasing the respawn time of dead Heroes at low\n  levels. Now, getting early game Takedowns (and the experience associated with\n  it) won’t give your team as much pure power as it did previously. Instead,\n  early kills will offer a “power play” moment, in which your team can destroy\n  enemy Structures, complete Battleground Events, or take more Mercenaries.\n  These meaningful strategic advantages will position a team closer to victory,\n  without giving them a large stat advantage and the ability to bully the\n  opposing enemy team.\n\n\nAttack Speed Slows\n\n\nAttack speed slows now apply only to Heroes and Summons.\n\n\n              Bug Fixes\n              \nThe tooltip for the Plant Terror’s Overgrowth Ability no longer states that it does not disable the enemy Core.Garden of Terror\n\n\n            "},{"name":"2015-10-20 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19923883/heroes-of-the-storm-patch-notes-october-20-2015","content":"\n              Bug Fixes\n              \nFixed an issue that caused abnormal Hero movement when a Dragon Knight or Garden Terror was killed or expired nearby.Dragon Shire, Garden of Terror\n\n\n            "},{"name":"2015-10-06 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19893628/heroes-of-the-storm-patch-notes-october-6-2015","content":"\n              Design & Gameplay\n              A.I. Talent Selection\n\n\nA.I. controlled Heroes will now select their Talents from a group of preset Talent builds.\n\n\n\n  Developer Comments: A.I. players will now choose from predetermined\n  Talent builds instead of randomly selecting Talents. This is especially\n  important for players who disconnect as the A.I. will now no longer randomly\n  choose Talents, but instead try to pick builds that are closer to what players\n  would expect. In addition, A.I. controlled Heroes in Versus A.I. games will\n  also have their own Talent builds to choose from.\n\n\nVehicles and Regeneration Globe Interaction\n\n\nRegeneration Globes will no longer heal Dragon Knights and Garden Terrors.\n\nInstead, Regeneration Globe effects will now be applied directly to the Hero inside the Dragon Knight or Garden Terror.\n\nPlayers within a Dragon Knight or Garden Terror can now also accumulate stacks for Talents such as Seasoned Marksman, Gathering Power, Regeneration Master, etc.\n\n\nSummoned Unit Attacks\n\n\nSummoned unit Basic Attacks will now miss if that Summon is Blinded or the target is Evading.\nSummoned unit Basic Attacks will no longer consume Block Talent stacks.\n\n\n              Battleground Updates\n              \nGarden Terror\n\nOvergrowth (W)\n\nNow also disables the enemy Core\nHealth now increases the longer the game progresses\n\n\n\n\n\n  Developer Comments: We didn’t like the gameplay of Garden Terrors\n  being used defensively to slow down an enemy Garden Terror push. Now that the\n  Overgrowth can disable the Core, it will be much less effective to defend as a\n  Garden Terror, encouraging teams to be more offensive with their Garden\n  Terrors.\n\n\n              Bug Fixes\n              \nFixed an issue that could allow A.I. controlled Garden Terrors to briefly continue casting their Abilities after death.Garden of Terror\n\n\n            "},{"name":"2015-08-18 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19818499/heroes-of-the-storm-patch-notes-august-18-2015","content":"\n              Bug Fixes\n              \nEnemy Heroes within a Dragon Knight or Garden Terror will no longer become unresponsive if that vehicle is killed by Sylvanas’ Unstable Poison. Dragon Shire, Garden of Terror\n\n\n              \nFixed an issue in which certain movement-based Abilities, such as Kerrigan’s Ravage or Chen’s Flying Kick, could not target the Doubloon Chests on Blackheart's Bay, or Plant Terror Overgrowths on Garden of Terror.\n\n\n            "},{"name":"2015-05-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19067455/heroes-closed-beta-patch-notes-may-12-2015","content":"\n              Bug Fixes\n              \nAlerts proclaiming that the Core is under attack will no longer play when an enemy Hero is within range of the Core before a Keep has been destroyed.\n\n\n              \nPlayers will no longer enter an infinite rejoin loop if both Cores are destroyed simultaneously, and victory will be assigned to one team at random.\n\nPlease note: Randomly assigned victory/defeat is intended as a temporary solution, intended to fix the infinite rejoin loop as soon as possible. A more robust solution for games that end in a draw will be implemented with a future patch.\n\n\n\n            "},{"name":"2015-03-24 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/18401781/heroes-closed-beta-patch-notes-march-24-2015","content":"\n              Design & Gameplay\n              General\n\n\nIn-game XP Changes\n\nThe in-game leveling curve has been adjusted slightly to slow down the first 10 team levels, though the amount of XP required to reach level 20 remains the same. \n\n\n\n              Battleground Updates\n              \nPlayer-controlled Garden Terrors are now more resistant to disable effects. \nMovement Speed reduced to equal Hero Movement Speed\nOvergrowth (W)\n\nOvergrowth Health increased by 25%\nNow receives additional Health bonuses past the 15 minute mark\nNow deals 70 (+7 per minute) damage each tick to Minions and Mercenaries instead of 20% of their Maximum Health. This is the same as the Structure damage.\n\n\n\n              Battlegrounds\n              Mercenaries\n\n\nMercenary initial and scaling XP has been reworked.\nMercenary Camp tooltips now indicate which Camps can be Bribed.\n\n\nStructures\n\n\nGate, Tower, Town Hall, and Wall Health reduced by approximately 10%.\n\n\n              Bug Fixes\n              \nFixed a rare issue in which a Core with less than 1 Health could suddenly be destroyed without taking additional damage.\n\n\n              \nPlayer-controlled Garden Terrors can no longer place a Plant Terror Overgrowth within an allied Hall of Storms.Garden of Terror\n\n\n            "},{"name":"2015-02-10 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/17906504/heroes-closed-beta-patch-notes-february-10-2015","content":"\n              Battlegrounds\n              General\n\n\nHuman teams can now begin Coop games on either side of the Battleground, rather than only on the left side.\nCollecting various Battleground items (Doubloons, Skulls, Seeds, Regeneration Globes) should now be more responsive.\n\n\nStructures\n\n\nCore\n\nThe Core is now invulnerable until both the Keep and Fort in a single lane are destroyed.\n\nThis is now consistent with the way in which Catapult Minions are spawned.\n\n\nWalls\n\nVision provided by Walls reduced by approximately 15%.\n\n\n\n              Bug Fixes\n              \nAbathur’s Hivemind Talent can no longer benefit the Dragon Knight or player-controlled Garden Terrors.Dragon Shire, Garden of Terror\n\n\n              \nBattleground objective units such as Grave Golems, Garden Terrors, and Mercenaries will now become invulnerable while leashing. \n\n\n              \nGrave Golems, Mercenaries, and Minions will no longer completely ignore Structures affected by Zeratul’s Void Prison.\n\n\n              \nResolved a crash that could occur while playing on the Garden of Terror Battleground.\n\n\n            "},{"name":"2015-01-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/17345414/heroes-closed-beta-patch-notes-january-13-2015","content":"\n              Battlegrounds\n              Structures\n\n\nCore\n\nDamage versus Heroes increased by 20%\nAbathur’s Symbiote and Tassadar’s Plasma Shield can once again be cast on the Core.\n\nTowers\n\nThe amount of time that towers are disabled while regenerating ammunition has been increased from 20 to 30 seconds.\n\nThis was done to align with a previous change, in which the rate of tower ammo regeneration was reduced to 1 per 15 seconds. As such, towers will now come back online with 2 ammunition.\n\n\n\n\nMercenaries\n\n\nGrave Golem\n\nRoot\n\nGrave Golems will no longer pause when casting Root.\nRoot will now be cast on ranged Minions.\nHeroic units will remain the preferred targets.\n\nStomp\n\nThe post-cast delay on Stomp has been removed.\nStomp will now be cast when there are at least 2 Heroic units around the Grave Golem, or at least 3 Minions.\nStomp will not be cast unless the Grave Golem is already stationary.\nStomp now deals increased damage versus Minions.\n\n\n\n\n              Bug Fixes\n              \nCatapult Minions no longer deal half their intended damage, and once again deal area of effect damage around their target.\n\n\n              \nNeutral Garden Terrors will no longer drop regeneration globes inside of walls.Garden of Terror\n\n\n            "},{"name":"2014-12-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/16467431/heroes-technical-alpha-patch-notes-december-2-2014","content":"\n              Battleground Updates\n              \nGarden Terror (Summoned)\n\nSpore Queen’s Curse (Q)\n\nRadius decreased by 10% \n\n\n\n\n              Battlegrounds\n              General\n\n\nTown Halls no longer contain all of a town’s experience points. While Town Halls retain a majority of the experience, the surrounding towers protecting the town now yield experience as well.\n\n\n              Bug Fixes\n              \nHeroes can no longer be affected by enemy abilities while within the allied Hall of Storms.\n\n\n              \nHeroes with a permanent Cloak will now properly Decloak when exiting the Dragon Knight or Garden Terror. Dragon Shire, Garden of Terror\n\n\n            "},{"name":"2014-10-07 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/16081848/heroes-technical-alpha-patch-notes-oct-7-2014","content":"\n              Battleground Updates\n              \nReady text on a summoned Garden Terror will now start blinking when the Terror is about to expire.\n\n\n              Battlegrounds\n              General\n\n\nMinimap icons for the underground Grave Golem on the Haunted Mines, and neutral Garden Terrors on the Garden of Terror, no longer blink when they are in combat\nMinion damage dealt to opposing Minions has been reduced, allowing for stronger pushes with Minions in unattended lanes\n\n\n              Mercenary Camps\n\n\nKnight Mercenary Camp\n\nThe Healer Mercenary no longer heals other Mercenaries or Minions, and now casts a damaging Arcane Bolt on enemies instead.\n\n\n\nStructures\n\n\nThe Core now regenerates Shields after it has not taken damage for 8 seconds, rather than 10 seconds.\nTowers, Forts, and Keeps now regenerate Ammunition once every 15 seconds, rather than once every 10 seconds.\n\n\n              Bug Fixes\n              \nAttacking a Mercenary Camp at the moment it spawns will no longer cause the defending Mercenaries’ Health to reset mid-fight.\n\n\n              \nThe Garden Terror is now properly immune to the effects of an opposing Garden Terror’s Spore Queen’s Curse Ability. Garden of Terror\n\n\n            "},{"name":"2014-09-10 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/15787795/heroes-technical-alpha-patch-notes-sept-10-2014","content":"\n              Battleground Updates\n              \nThis Battleground has received significant updates.\n\nUpon collecting 100 Seeds, the Fertile Soil (located near the Core) will automatically grow into a Garden Terror after 15 seconds.\nOnce the Garden Terror has spawned, a 1 minute countdown timer will begin. Right click the Garden Terror to take control of it before the timer expires.\n\nIf no player takes control of the Garden Terror within 1 minute, it will reset to its Fertile Soil state, and the team will lose the ability to unleash the Garden Terror.\n100 Seeds will be automatically consumed whether or not a player takes control of the Garden Terror.\n\n\nInfested Servants\n\nExperience reward increased from 30 (+1.5 per minute) to 60 (+2 per minute)\n\nGarden Terror\n\nExperience reward increased from 175 (+5 per minute) to 350 (+12 per minute)\n\nThis specific change refers to the neutral Garden Terror found in the Gardens during the Night sequence.\n\nSpore Queen’s Curse (Q)\n\nRadius increased from 2.5 to 3\nThe curse is now a persistent effect which continues to pulse once per second for 3 seconds.\n\nGarden Terror Overgrowth (W)\n\nHealth increased from 960 (+55 per minute) to 1250 (+80 per minute)\n\nNew Ability: Sprint (E)\n\nIncreases the Garden Terror’s Movement Speed by 30% for 3 seconds\n\n\n\n\n              Battlegrounds\n              Core\n\n\nHealth Regeneration has been removed from the Core, but Shield regeneration is unchanged.\n\n\nSiege Giants\n\n\nHealth regeneration when Siege Giants are out of combat for 8 or more seconds has been removed.\n\n\n              Bug Fixes\n              \nCorrected an issue in which Towers could unintentionally see through certain Line of Sight blockers.\n\n\n              \nForts and Keeps will no longer expend ammo without firing when a player quickly moves in and out of range.\n\n\n              \nMercenary Camps that are captured simultaneously by one team with the Mercenary Lord Talent, and one without, no longer causes the Mercenaries from both Camps to gain the Mercenary Lord buff.\n\n\n              \nPings issued on Mercenary Camps no longer require the player to target an individual Mercenary in order to request assistance with capturing the Camp.\n\n\n              \nUncaptured Mercenary Camps now appropriately reactivate when a player exits a Dragon Knight or Garden Terror. Dragon Shire, Garden of Terror\n\n\n            "},{"name":"2014-07-23 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14742016/heroes-technical-alpha-patch-notes-july-23-2014","content":"\n              Design & Gameplay\n              General\n\n\nThe amount of in-game experience required to reach levels 2-19 has been increased by approximately 6%.\n\n\nUnderdog Bonus\n\n\nThe amount of XP received from Hero takedowns is now more granular.\nThis will now have less impact during close games.\n\n\n              Battleground Updates\n              Garden of Terror, a brand new 3-lane Battleground, has been added to Heroes of the Storm and is now available for play in all matchmaking queues!\n\n\nAfter 90 seconds, Night will fall and Horrors will rise within the garden.\n\nVenture into the garden to kill the Horrors and collect the Seeds they drop.\nNight will persist until all remaining Horrors have been destroyed.\nCollect 100 Seeds and then return to base to take control of a monstrous Garden Terror!\n\nOnce unleashed, Garden Terrors can use the following powerful abilities:\n\nSpore Queen’s Curse (Q)\n\nAfter a short delay, enemy Heroes in the target area are turned into Plant Zombies for 5 seconds.\nWhile in Plant Zombie form, Heroes deal reduced damage, have their Movement Speed reduced by 30%, and become silenced.\n\nPlant Horror Overgrowth (W)\n\nDisables and damages all enemy structures within a large area as long as the Horror Overgrowth remains alive.\nDeals heavy damage to Minions within its area of effect.\n\n\nCheck out our latest Developer Insights blog, which offers an in-depth look at the design behind the Garden of Terror Battleground.\n\n\n              Battlegrounds\n              Core\n\n\nHealth now scales throughout the game.\nSplash damage radius increased from 1.5 to 2.\n\n\n            "}],"infernalshrines":[{"name":"2016-10-18 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20328243/heroes-of-the-storm-patch-notes-october-18-2016","content":"\n              Bug Fixes\n              \nInfernal Shrines: Fallen Shaman Mercenaries will now prioritize attacking enemy Structures over Walls.\n\n\n            "},{"name":"2016-09-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20243513/heroes-of-the-storm-patch-notes-september-13-2016","content":"\n              Design & Gameplay\n              Mounts\n\n\nMovement Speed reduced from 40 to 30%\n\n\nRegeneration Globes\n\n\nTime before Globes despawn reduced from 8 to 6 seconds\n\n\n              Battleground Updates\n              \nKhazra Impaler\n\nCaptured Impaler attack damage increased from 40 to 46\n\n\n\n              Battlegrounds\n              Mercenaries\n\n\nTiming Changes\n\nPreviously all Mercenary camps spawned at 120 seconds. The following adjustments have been made to spawn times:\n\n90 seconds: Sappers, Doubloon Pirates\n120 seconds: Siege Giants (unchanged), Impalers (unchanged)\n150 seconds: Knights, Fallen Shaman\n180 seconds: Grave Golem (unchanged)\n300 seconds: Headless Horseman (unchanged)\n\n\nCaptured Mercenaries will no longer grant Experience when killed.\n\n\n\n  Developer Comments: We started playtesting with staggered Mercenary\n  Camp spawn times, and quickly began to realize that it added more strategic\n  depth to the game, and coincided with some of our Battleground events. We have\n  been happy with the changes overall, and are listening to any feedback you may\n  have!\n\n\n              Bug Fixes\n              \nHeroes can no longer push captured Mercenaries by walking into them.\n\n\n            "},{"name":"2016-08-09 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20212896/heroes-of-the-storm-patch-notes-august-9-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer push Neutral and Enemy Mercenaries by walking into them.\n\n\n            "},{"name":"2016-07-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20184555/heroes-of-the-storm-balance-update-july-27-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer be pushed by walking another Hero into them. \n\n\n              \nCollision: Heroes who are channeling an Ability can no longer be pushed when another Hero walks into them during the channel. \n\n\n            "},{"name":"2016-07-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20164442/heroes-of-the-storm-patch-notes-july-12-2016","content":"\n              Design & Gameplay\n              Core\n\n\nVictory determination is now much more precise in situations where both Cores are destroyed within fractions of a second. As a result, Victory will no longer be decided at random in cases where it appears that both Cores are destroyed at the same moment.\n\n\nRegeneration Globes\n\n\nHealth Regeneration\n\nPreviously: Restore 6.24% of maximum Health over 4 seconds\nNow: Restore 12% of maximum Health over 5 seconds\n\nMana Regeneration\n\nPreviously: Restore 32 Mana over 4 seconds.\nNow: Restore 8% of maximum Mana over 5 seconds\n\n\n\n\n  Developer Comments: Thank you for all your discussion and feedback on\n  our recent Health sustain post! We are still heavily evaluating a lot of it\n  but wanted to get the first round of changes in. Internally, we enjoyed the\n  increased importance on Regeneration Globes and have cleaned up the system a\n  bit. With a larger importance, denying enemies their Globes in lane has a much\n  larger impact.\n\n\nHealing Wells\n\n\nCooldown increased from 100 to 120 seconds\nHealth Regeneration\n\nPreviously: Restore 41% of maximum Health over 20 seconds.\nNow: Restore 40% of maximum Health over 20 seconds.\n\nMana Regeneration\n\nPreviously: Restore 20% of maximum Mana over 20 seconds.\nNow: Restore 30% of maximum Mana over 20 seconds.\n\n\n\n\n  Developer Comments: Much like the changes to Regeneration Globes, we\n  wanted to add a larger impact to the moment you click a Healing Well. Again,\n  we cleaned up the system a fair bit (hence the ~41% to 40% Health change) and\n  added a larger impact for heavy Mana users. The increased cooldown should make\n  the decision of when to tap the Healing Well slightly more interesting.\n\n\nMinions\n\n\nRanged, Melee, and Wizard Minions\n\nNow deal an additional 50% damage to Structures.\n\n\n\n\n  Developer Comments: Our goal with this change is to make escorting\n  Minions to Towns to be more impactful, such that they can really start to do\n  some damage if left unattended. Before this change, Minions were primarily XP\n  carriers that absorbed some Ammo shots from Towers. Now the armies of the\n  Nexus are a bit scarier when they march down a lane.\n\n\n\nCatapult Minions\n\nAttack range increased by 20%.\nSight range increased by 17%.\nWill now fixate on Structures. Catapults will not acquire a new target after fixating until the target is destroyed or the Catapult is killed.\n\n\n\n\n  Developer Comments: Catapults would often reach the Core, but have a\n  Minion wave spawn on them, distract them, and allow them to be killed off\n  before doing any significant damage. With increased range and fixation on a\n  Structure once they’ve started attacking, even one Catapult will more\n  consistently punch through a Core’s Shield and do actual damage.\n\n\n              Bug Fixes\n              \nInfernal Shrines: Punishers will no longer prefer to attack non-Heroic enemies that are affected by Abathur’s Symbiote over enemy Heroes.\n\n\n            "},{"name":"2016-05-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20120032/heroes-of-the-storm-patch-notes-may-17-2016","content":"\n              Battlegrounds\n              Healing Well\n\n\n25% of a Healing Well’s maximum Health has been converted into a Shield. Shield Regeneration delay of 8 seconds.\n\n\n\n  Developer Comments: We’ve noticed some rather un-fun behavior in the\n  form of sniping Healing Wells over time using very long range Abilities. While\n  we’re okay with players doing this to a degree, we found it was too effective\n  given how little counterplay there was. To help solve this, turned a sizable\n  portion of Healing Well Health into a Shield. This means that if you offer\n  your Healing Well some respite from enemy attacks by chasing opponents away\n  every now and then, it will start to regenerate some of that Shield. Only\n  you can protect Healing Wells from those pesky Arcane Orbs!\n\n\n              Bug Fixes\n              \nFixed an issue in which attacking enemy Walls at certain angles would cause the Hero’s Basic Attack animation to play, but deal no damage.\n\n\n            "},{"name":"2016-04-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20102776/heroes-of-the-storm-balance-update-notes-april-27-2016","content":"\n              Bug Fixes\n              \nIssuing a Mount command while holding down the right mouse button to move will no longer interrupt Mount channeling.\n\n\n            "},{"name":"2016-04-19 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20099322/heroes-of-the-storm-patch-notes-april-19-2016","content":"\n              Battleground Updates\n              \nPunisher\n\nPunisher starting Health has been increased, and scaling Health has been reduced to compensate.\nFrozen Punisher\n\nDelay between ice trap spawn and detonation decreased from 2.5 to 2 seconds.\nRoot duration while frozen decreased from 2 to 1.5 seconds.\n\n\n\n\n\n  Developer Comments: Although we are very happy with the current tuning\n  of Infernal Shrines, we have been noticing a tendency to under-value the first\n  couple of Punishers. In order to help incentivize players into valuing them,\n  we have boosted their starting Health and decreased their early scaling values\n  to compensate. While early event Punishers should be a bit stronger, any event\n  past the 15-minute mark should be identical to those from the previous patch.  \n  \n  Frozen Punishers are great at zoning enemy teams but we felt they were a bit\n  too easy to avoid without preliminary team initiation. These changes should\n  increase the frequency in which players get rooted, while feeling a little\n  less punishing when this occurs.\n\n\n              Bug Fixes\n              \nFixed an issue in which a Punisher that leaps to a Hero as that Hero activates Hearthstone could cause it to leap to the opposing Hall of Storms.Infernal Shrines\n\n\n              \nRe-issuing an attack order on a Structure in the Fog of War will no longer cause Basic Attack animations to repeat without applying damage.\n\n\n            "},{"name":"2016-03-01 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20049139/heroes-of-the-storm-patch-notes-march-1-2016","content":"\n              Bug Fixes\n              \nTowers will now properly fire Ammo provided by an allied M.U.L.E. immediately after 2 Ammo has been restored.\n\n\n            "},{"name":"2016-02-10 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20008204/heroes-of-the-storm-balance-update-notes-february-10-2016","content":"\n              Bug Fixes\n              \nDying will no longer cause the player’s Healing Well cooldown to reset.\n\n\n            "},{"name":"2016-02-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19995509/heroes-of-the-storm-patch-notes-february-2-2016","content":"\n              Design & Gameplay\n              Battleground Monsters\n\n\nBattleground-specific creatures are now universally defined as Monsters (ex: Neutral Garden Terrors, Sky Temple Guardians, etc.)\nSeveral Talents and Abilities have been changed to reflect this new categorization, and the following no longer affect Monsters:\n\nMercenary Lord\nJohanna's Knight Takes Pawn\nLunara's Cruel Bloom\nRexxar's Easy Prey and Bird of Prey\nThe Butcher's Chop Meat\n\nThe following now affect Monsters:\n\nAnub'arak's Beetle, Juiced\nAzmodan's Demonic Smite\n\nSeveral Talents that could previously trigger against both captured Mercenaries and Minions will now only affect Minions (ex: Seasoned Marksman, Black Soulstone, etc.)\n\n\n              Battleground Updates\n              \nThe minimap now more clearly indicates when a Shrine is ready to activate\nArcane Punisher\n\nArcane Sentry damage reduced by 20%\n\n\n\n\n  Developer Comments: The Arcane Punishers have shown to be more\n  effective than their Frozen and Mortar counterparts, so we lowered their\n  Arcane Sentry damage to bring them more in line with other Punisher types.\n\n\n              Battlegrounds\n              Structures\n\n\nTowers, Forts, and Keeps now deal 50% bonus damage to Heroes\nCores will now display an “Invulnerable” message if attacked by an enemy when no allied Keeps have been destroyed.\nStructures can no longer be made Vulnerable\n\n\n\n  Developer Comments: The scaling changes we released in December made\n  it so Heroes could dive into Structures with impunity during the early game.\n  Increasing the damage that Structures deal to Heroes allows defending players\n  to feel a bit safer. We are exploring other fixes to help Structures feel more\n  meaningful throughout the game and will release them when they are ready.\n\n\n              Bug Fixes\n              \nDiagonally placed shrubs will now properly hide Heroes within them.\n\n\n              \nPlayers punted out of an enemy Hall of Storms will no longer be persistently stunned if an enemy unit blocked the path of the punt.\n\n\n            "},{"name":"2015-12-15 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19981657/heroes-of-the-storm-patch-notes-december-15-2015","content":"\n              Bug Fixes\n              \nDiagonally placed Shrubs will no longer sometimes fail to properly hide a Hero within.\n\n\n              \nPunishers on the Infernal Shrines Battleground will no longer fly outside the playable area after leaping into Zeratul’s Void Prison.\n\n\n            "},{"name":"2015-11-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19960704/heroes-of-the-storm-patch-notes-november-17-2015","content":"\n              Design & Gameplay\n              Scaling Changes\n\n\nHealth and damage scaling for all Heroes, Battleground Events, Minions, and Mercenaries has been changed from flat, additive values to values that are multiplicative by percentage.\nA large portion of Heroes’ total scaling amounts, which were previously gained over the course of a game, have been added to their base values.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: Due to the way that our old level scaling system worked, early game level discrepancies created a larger difference in power level than we liked.  This often led to situations where a team could be up two or more levels early in a game, and use this advantage to create a larger lead.  We didn’t feel that games were fun for the winning or losing team in these types of scenarios.   As a result of these changes, all Heroes will have more power early, but gain less from each level.  Battleground Events, Minions, Mercenaries, and Structures have all been adjusted to compensate for this and should feel close to what they did previously.   The aim of these adjustments to the scaling system is to make level differences have a similar impact on your Hero’s statistics at all points in a game.  Now, each level offers about 4% Health and 4% damage, which mirrors what late game leads felt like in our previous version of the game.  It is important to note, that while being down a few levels will be less punishing than it was previously, Talent tier advantages can and will still have a noticeable impact on enemy engagements.\n\n\nRespawn Timers\n\n\nRespawn timers have been increased for levels 1 – 10.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: In order to reward players for getting early game\n  Takedowns, we’re also increasing the respawn time of dead Heroes at low\n  levels. Now, getting early game Takedowns (and the experience associated with\n  it) won’t give your team as much pure power as it did previously. Instead,\n  early kills will offer a “power play” moment, in which your team can destroy\n  enemy Structures, complete Battleground Events, or take more Mercenaries.\n  These meaningful strategic advantages will position a team closer to victory,\n  without giving them a large stat advantage and the ability to bully the\n  opposing enemy team.\n\n\nAttack Speed Slows\n\n\nAttack speed slows now apply only to Heroes and Summons.\n\n\n              Bug Fixes\n              \nFixed an issue that prevented Hero vision radiuses from displaying on Infernal Shrines and Battlefield of Eternity minimaps. \n\n\n            "},{"name":"2015-10-06 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19893628/heroes-of-the-storm-patch-notes-october-6-2015","content":"\n              Design & Gameplay\n              A.I. Talent Selection\n\n\nA.I. controlled Heroes will now select their Talents from a group of preset Talent builds.\n\n\n\n  Developer Comments: A.I. players will now choose from predetermined\n  Talent builds instead of randomly selecting Talents. This is especially\n  important for players who disconnect as the A.I. will now no longer randomly\n  choose Talents, but instead try to pick builds that are closer to what players\n  would expect. In addition, A.I. controlled Heroes in Versus A.I. games will\n  also have their own Talent builds to choose from.\n\n\nVehicles and Regeneration Globe Interaction\n\n\nRegeneration Globes will no longer heal Dragon Knights and Garden Terrors.\n\nInstead, Regeneration Globe effects will now be applied directly to the Hero inside the Dragon Knight or Garden Terror.\n\nPlayers within a Dragon Knight or Garden Terror can now also accumulate stacks for Talents such as Seasoned Marksman, Gathering Power, Regeneration Master, etc.\n\n\nSummoned Unit Attacks\n\n\nSummoned unit Basic Attacks will now miss if that Summon is Blinded or the target is Evading.\nSummoned unit Basic Attacks will no longer consume Block Talent stacks.\n\n\n              Battleground Updates\n              \nPunisher\n\nStarting and scaling Health decreased by 10%\nNow leap to the nearest enemy Hero within range, rather than selecting one at random\n\nSkeletal Defenders\n\nThe amount of Skeletal Defenders required to summon a Punisher has been increased from 30 to 40.\nSkeletal Defenders will no longer take increased damage from abilities and talents that deal bonus damage to minions.\nThe range at which Skeletal Defenders will detect and attack players has been decreased by 25%\n\n\n\n\n  Developer Comments: Player feedback has been centered around how hard\n  it is to comeback when falling behind on Infernal Shrines. We agree that the\n  Punishers are overly punishing, so we’re nerfing their Health slightly. Teams\n  that successfully bait the Punishers deep within their base will be able to\n  put an end to this threat sooner.\n\n\n              Bug Fixes\n              \nCorrected an issue that could cause Punishers to prioritize attacking enemy Structures after initially targeting a Hero.Infernal Shrines\n\n\n              \nFixed an issue that allowed Punishers to attack structures while enraged on the Infernal Shrines Battleground.\n\n\n              \nSkeletal Defender Health will now properly scale over time on the Infernal Shrines Battleground.\n\n\n            "},{"name":"2015-08-18 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19818499/heroes-of-the-storm-patch-notes-august-18-2015","content":"\n              Battleground Updates\n              \nThis three-lane Battleground features three Infernal Shrines that will periodically gather power. Only one Shrine will gather power at any given time, and either team can activate it to unleash its might.\nOnce activated, the Shrine’s Guardians will pour forth in waves to defend it. The first team to kill 30 Guardians will summon a devastating Punisher to fight for their cause.\nA Punisher is a powerful boss that will attack down the lane that corresponds with the Shrine it was summoned from. Punishers will hunt down any nearby enemy Heroes that cross its path, and can spawn with one of three deadly affixes:\n\nArcane – The Punisher summons beams of arcane energy which rotate in a circular motion, and deal massive damage to enemy targets they pass through.\nFrozen – The Punisher calls forth frigid ice shards, which explode after a short delay, dealing damage and freezing enemies in place for a short time.\nMortar – The Punisher launches a stream of firebombs high into the air, which explode and deal damage to any enemies they strike upon landing.\n\n\n\n            "}],"warheadjunction":[{"name":"2016-10-12 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20307801/heroes-of-the-storm-balance-update-october-12-2016","content":"\n              Battleground Updates\n              \nReduced Nuke inner damage bonus from 100 to 50%\nTime at which Nukes upgrade their damage changed from 14 to 18 minutes\n\n\n\n  Developer Comments: This is a temporary solution to prevent the Nuke\n  Core rushes at the 14-minute mark. In a coming patch, we’ll likely be making\n  further changes that makes Nukes gradually scale over time, so that they\n  mirror the Core’s scaling over time.\n\n\n            "},{"name":"2016-09-27 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20285864/heroes-of-the-storm-patch-notes-september-27-2016","content":"\n              Battleground Updates\n              Once a testing facility for nuclear weapons, Warhead Junction has since fallen\ninto ruin. However, the site's abandonment hasn't stopped its glitchy adjutant\nfrom continuing to produce and hand out nuclear weapons. Join the arms race of\nWarhead Junction, build up your stockpile, and rain hell on your enemies!\n\n\nWarhead Deployment\n\nMultiple Warheads will spawn periodically across the battleground.\n\nCollect Warheads\n\nPick up a Warhead to activate your Nuke. Use it or you will drop it when you die!\n\nCall Down the Thunder\n\nLaunch Nukes to devastate the enemy team's fortifications.\n\n\n\n            "}],"dragonshire":[{"name":"2016-09-27 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20285864/heroes-of-the-storm-patch-notes-september-27-2016","content":"\n              Bug Fixes\n              \nAnub'arak: It is no longer possible to cast Cocoon on Heroic Vehicles, such as the Garden Terror or Dragon Knight.Garden of Terror, Dragon Shire\n\n\n              \nDiablo: It is no longer possible to cast Overpower on Heroic Vehicles, such as the Garden Terror or Dragon Knight.Garden of Terror, Dragon Shire\n\n\n            "},{"name":"2016-09-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20243513/heroes-of-the-storm-patch-notes-september-13-2016","content":"\n              Design & Gameplay\n              Mounts\n\n\nMovement Speed reduced from 40 to 30%\n\n\nRegeneration Globes\n\n\nTime before Globes despawn reduced from 8 to 6 seconds\n\n\n              Battlegrounds\n              Mercenaries\n\n\nTiming Changes\n\nPreviously all Mercenary camps spawned at 120 seconds. The following adjustments have been made to spawn times:\n\n90 seconds: Sappers, Doubloon Pirates\n120 seconds: Siege Giants (unchanged), Impalers (unchanged)\n150 seconds: Knights, Fallen Shaman\n180 seconds: Grave Golem (unchanged)\n300 seconds: Headless Horseman (unchanged)\n\n\nCaptured Mercenaries will no longer grant Experience when killed.\n\n\n\n  Developer Comments: We started playtesting with staggered Mercenary\n  Camp spawn times, and quickly began to realize that it added more strategic\n  depth to the game, and coincided with some of our Battleground events. We have\n  been happy with the changes overall, and are listening to any feedback you may\n  have!\n\n\n              Bug Fixes\n              \nHeroes can no longer push captured Mercenaries by walking into them.\n\n\n            "},{"name":"2016-08-09 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20212896/heroes-of-the-storm-patch-notes-august-9-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer push Neutral and Enemy Mercenaries by walking into them.\n\n\n              \nDragon Shire: The tooltip for the Dragon Knight’s Rubble Maker Trait no longer incorrectly states that it reduces the duration of Silence effects.\n\n\n            "},{"name":"2016-07-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20184555/heroes-of-the-storm-balance-update-july-27-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer be pushed by walking another Hero into them. \n\n\n              \nCollision: Heroes who are channeling an Ability can no longer be pushed when another Hero walks into them during the channel. \n\n\n            "},{"name":"2016-07-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20164442/heroes-of-the-storm-patch-notes-july-12-2016","content":"\n              Design & Gameplay\n              Core\n\n\nVictory determination is now much more precise in situations where both Cores are destroyed within fractions of a second. As a result, Victory will no longer be decided at random in cases where it appears that both Cores are destroyed at the same moment.\n\n\nRegeneration Globes\n\n\nHealth Regeneration\n\nPreviously: Restore 6.24% of maximum Health over 4 seconds\nNow: Restore 12% of maximum Health over 5 seconds\n\nMana Regeneration\n\nPreviously: Restore 32 Mana over 4 seconds.\nNow: Restore 8% of maximum Mana over 5 seconds\n\n\n\n\n  Developer Comments: Thank you for all your discussion and feedback on\n  our recent Health sustain post! We are still heavily evaluating a lot of it\n  but wanted to get the first round of changes in. Internally, we enjoyed the\n  increased importance on Regeneration Globes and have cleaned up the system a\n  bit. With a larger importance, denying enemies their Globes in lane has a much\n  larger impact.\n\n\nHealing Wells\n\n\nCooldown increased from 100 to 120 seconds\nHealth Regeneration\n\nPreviously: Restore 41% of maximum Health over 20 seconds.\nNow: Restore 40% of maximum Health over 20 seconds.\n\nMana Regeneration\n\nPreviously: Restore 20% of maximum Mana over 20 seconds.\nNow: Restore 30% of maximum Mana over 20 seconds.\n\n\n\n\n  Developer Comments: Much like the changes to Regeneration Globes, we\n  wanted to add a larger impact to the moment you click a Healing Well. Again,\n  we cleaned up the system a fair bit (hence the ~41% to 40% Health change) and\n  added a larger impact for heavy Mana users. The increased cooldown should make\n  the decision of when to tap the Healing Well slightly more interesting.\n\n\nMinions\n\n\nRanged, Melee, and Wizard Minions\n\nNow deal an additional 50% damage to Structures.\n\n\n\n\n  Developer Comments: Our goal with this change is to make escorting\n  Minions to Towns to be more impactful, such that they can really start to do\n  some damage if left unattended. Before this change, Minions were primarily XP\n  carriers that absorbed some Ammo shots from Towers. Now the armies of the\n  Nexus are a bit scarier when they march down a lane.\n\n\n\nCatapult Minions\n\nAttack range increased by 20%.\nSight range increased by 17%.\nWill now fixate on Structures. Catapults will not acquire a new target after fixating until the target is destroyed or the Catapult is killed.\n\n\n\n\n  Developer Comments: Catapults would often reach the Core, but have a\n  Minion wave spawn on them, distract them, and allow them to be killed off\n  before doing any significant damage. With increased range and fixation on a\n  Structure once they’ve started attacking, even one Catapult will more\n  consistently punch through a Core’s Shield and do actual damage.\n\n\n              Bug Fixes\n              \nDragon Shire: The Dragon Knight’s Savage Charge can no longer be cast on neutral Siege and Bruiser Mercenaries.\n\n\n            "},{"name":"2016-05-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20120032/heroes-of-the-storm-patch-notes-may-17-2016","content":"\n              Battlegrounds\n              Healing Well\n\n\n25% of a Healing Well’s maximum Health has been converted into a Shield. Shield Regeneration delay of 8 seconds.\n\n\n\n  Developer Comments: We’ve noticed some rather un-fun behavior in the\n  form of sniping Healing Wells over time using very long range Abilities. While\n  we’re okay with players doing this to a degree, we found it was too effective\n  given how little counterplay there was. To help solve this, turned a sizable\n  portion of Healing Well Health into a Shield. This means that if you offer\n  your Healing Well some respite from enemy attacks by chasing opponents away\n  every now and then, it will start to regenerate some of that Shield. Only\n  you can protect Healing Wells from those pesky Arcane Orbs!\n\n\n              Bug Fixes\n              \nFixed an issue in which attacking enemy Walls at certain angles would cause the Hero’s Basic Attack animation to play, but deal no damage.\n\n\n            "},{"name":"2016-04-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20102776/heroes-of-the-storm-balance-update-notes-april-27-2016","content":"\n              Bug Fixes\n              \nIssuing a Mount command while holding down the right mouse button to move will no longer interrupt Mount channeling.\n\n\n            "},{"name":"2016-04-19 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20099322/heroes-of-the-storm-patch-notes-april-19-2016","content":"\n              Bug Fixes\n              \nRe-issuing an attack order on a Structure in the Fog of War will no longer cause Basic Attack animations to repeat without applying damage.\n\n\n            "},{"name":"2016-03-29 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20063493/heroes-of-the-storm-patch-notes-march-29-2016","content":"\n              Battleground Updates\n              \nDragon Knight\n\nNow immune to Attack Speed slows applied by attacks from enemy Forts and Keeps\nSavage Charge (W)\n\nTargets punted by Savage Charge will no longer be stunned after landing\n\n\n\n\n\n  Developer Comments: We want to encourage players to be really\n  aggressive and feel like they can tank shots from Forts and Keeps when\n  piloting the Dragon Knight. The Attack Speed slows from these Structures were\n  discouraging players from tanking the structures, and often led to a Dragon\n  Knight having less than the desired impact.\n\n\n            "},{"name":"2016-03-01 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20049139/heroes-of-the-storm-patch-notes-march-1-2016","content":"\n              Bug Fixes\n              \nTowers will now properly fire Ammo provided by an allied M.U.L.E. immediately after 2 Ammo has been restored.\n\n\n            "},{"name":"2016-02-10 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20008204/heroes-of-the-storm-balance-update-notes-february-10-2016","content":"\n              Bug Fixes\n              \nDying will no longer cause the player’s Healing Well cooldown to reset.\n\n\n            "},{"name":"2016-02-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19995509/heroes-of-the-storm-patch-notes-february-2-2016","content":"\n              Design & Gameplay\n              Battleground Monsters\n\n\nBattleground-specific creatures are now universally defined as Monsters (ex: Neutral Garden Terrors, Sky Temple Guardians, etc.)\nSeveral Talents and Abilities have been changed to reflect this new categorization, and the following no longer affect Monsters:\n\nMercenary Lord\nJohanna's Knight Takes Pawn\nLunara's Cruel Bloom\nRexxar's Easy Prey and Bird of Prey\nThe Butcher's Chop Meat\n\nThe following now affect Monsters:\n\nAnub'arak's Beetle, Juiced\nAzmodan's Demonic Smite\n\nSeveral Talents that could previously trigger against both captured Mercenaries and Minions will now only affect Minions (ex: Seasoned Marksman, Black Soulstone, etc.)\n\n\n              Battleground Updates\n              \nDragon Knight\n\nDamage reduction from Structures increased from 50% to 60%\nSavage Charge (W)\n\nChannel time reduced from 1.125 to 0.75 seconds\nCooldown increased from 8 to 10 seconds\n\n\n\n\n\n  Developer Comments: Since the Dragon Knight is flagged as a Hero, the\n  increased structure damage was doing too much damage; Increasing Rubble\n  Maker’s effectiveness to compensate felt appropriate.\n  \n  Savage Charge felt like a dead button a lot of the time due to the Ability’s\n  long channel time. This change has made the button feel a lot better to press.\n\n\n              Battlegrounds\n              Structures\n\n\nTowers, Forts, and Keeps now deal 50% bonus damage to Heroes\nCores will now display an “Invulnerable” message if attacked by an enemy when no allied Keeps have been destroyed.\nStructures can no longer be made Vulnerable\n\n\n\n  Developer Comments: The scaling changes we released in December made\n  it so Heroes could dive into Structures with impunity during the early game.\n  Increasing the damage that Structures deal to Heroes allows defending players\n  to feel a bit safer. We are exploring other fixes to help Structures feel more\n  meaningful throughout the game and will release them when they are ready.\n\n\n              Bug Fixes\n              \nAI-piloted Dragon Knights and Garden Terrors can now properly follow the player when pinged.Dragon Shire, Garden of Terror\n\n\n              \nDiagonally placed shrubs will now properly hide Heroes within them.\n\n\n              \nPlayers punted out of an enemy Hall of Storms will no longer be persistently stunned if an enemy unit blocked the path of the punt.\n\n\n              \nSilences will no longer prevent Heroes from entering a Dragon Knight or Garden Terror.Dragon Shire, Garden of Terror\n\n\n            "},{"name":"2015-12-15 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19981657/heroes-of-the-storm-patch-notes-december-15-2015","content":"\n              Bug Fixes\n              \nDiagonally placed Shrubs will no longer sometimes fail to properly hide a Hero within.\n\n\n            "},{"name":"2015-11-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19960704/heroes-of-the-storm-patch-notes-november-17-2015","content":"\n              Design & Gameplay\n              Scaling Changes\n\n\nHealth and damage scaling for all Heroes, Battleground Events, Minions, and Mercenaries has been changed from flat, additive values to values that are multiplicative by percentage.\nA large portion of Heroes’ total scaling amounts, which were previously gained over the course of a game, have been added to their base values.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: Due to the way that our old level scaling system worked, early game level discrepancies created a larger difference in power level than we liked.  This often led to situations where a team could be up two or more levels early in a game, and use this advantage to create a larger lead.  We didn’t feel that games were fun for the winning or losing team in these types of scenarios.   As a result of these changes, all Heroes will have more power early, but gain less from each level.  Battleground Events, Minions, Mercenaries, and Structures have all been adjusted to compensate for this and should feel close to what they did previously.   The aim of these adjustments to the scaling system is to make level differences have a similar impact on your Hero’s statistics at all points in a game.  Now, each level offers about 4% Health and 4% damage, which mirrors what late game leads felt like in our previous version of the game.  It is important to note, that while being down a few levels will be less punishing than it was previously, Talent tier advantages can and will still have a noticeable impact on enemy engagements.\n\n\nRespawn Timers\n\n\nRespawn timers have been increased for levels 1 – 10.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: In order to reward players for getting early game\n  Takedowns, we’re also increasing the respawn time of dead Heroes at low\n  levels. Now, getting early game Takedowns (and the experience associated with\n  it) won’t give your team as much pure power as it did previously. Instead,\n  early kills will offer a “power play” moment, in which your team can destroy\n  enemy Structures, complete Battleground Events, or take more Mercenaries.\n  These meaningful strategic advantages will position a team closer to victory,\n  without giving them a large stat advantage and the ability to bully the\n  opposing enemy team.\n\n\nAttack Speed Slows\n\n\nAttack speed slows now apply only to Heroes and Summons.\n\n\n            "},{"name":"2015-10-20 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19923883/heroes-of-the-storm-patch-notes-october-20-2015","content":"\n              Bug Fixes\n              \nFixed an issue that caused abnormal Hero movement when a Dragon Knight or Garden Terror was killed or expired nearby.Dragon Shire, Garden of Terror\n\n\n            "},{"name":"2015-10-06 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19893628/heroes-of-the-storm-patch-notes-october-6-2015","content":"\n              Design & Gameplay\n              A.I. Talent Selection\n\n\nA.I. controlled Heroes will now select their Talents from a group of preset Talent builds.\n\n\n\n  Developer Comments: A.I. players will now choose from predetermined\n  Talent builds instead of randomly selecting Talents. This is especially\n  important for players who disconnect as the A.I. will now no longer randomly\n  choose Talents, but instead try to pick builds that are closer to what players\n  would expect. In addition, A.I. controlled Heroes in Versus A.I. games will\n  also have their own Talent builds to choose from.\n\n\nVehicles and Regeneration Globe Interaction\n\n\nRegeneration Globes will no longer heal Dragon Knights and Garden Terrors.\n\nInstead, Regeneration Globe effects will now be applied directly to the Hero inside the Dragon Knight or Garden Terror.\n\nPlayers within a Dragon Knight or Garden Terror can now also accumulate stacks for Talents such as Seasoned Marksman, Gathering Power, Regeneration Master, etc.\n\n\nSummoned Unit Attacks\n\n\nSummoned unit Basic Attacks will now miss if that Summon is Blinded or the target is Evading.\nSummoned unit Basic Attacks will no longer consume Block Talent stacks.\n\n\n              Battleground Updates\n              General\n\n\nA.I. controlled Heroes can now travel long distances more effectively, and will travel to take part in objectives from anywhere on the Battleground.\nA.I. controlled Heroes will now wait near an objective until enough allies have arrived that they can commit to a team fight at that objective.\n\n\n            "},{"name":"2015-08-18 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19818499/heroes-of-the-storm-patch-notes-august-18-2015","content":"\n              Bug Fixes\n              \nEnemy Heroes within a Dragon Knight or Garden Terror will no longer become unresponsive if that vehicle is killed by Sylvanas’ Unstable Poison. Dragon Shire, Garden of Terror\n\n\n              \nHeroes that are near a Dragon Knight when it is killed will no longer exhibit unexpected movement behavior. Dragon Shire\n\n\n            "},{"name":"2015-05-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19067455/heroes-closed-beta-patch-notes-may-12-2015","content":"\n              Bug Fixes\n              \nAlerts proclaiming that the Core is under attack will no longer play when an enemy Hero is within range of the Core before a Keep has been destroyed.\n\n\n              \nFixed an issue that could cause Mercenary Camps on the Dragon Shire Battleground to permanently vanish when the Dragon Knight is killed.\n\n\n              \nHeroes killed just before being struck by the Dragon Knight’s Savage Charge Ability will no longer fly to the location where they would have landed upon respawning.Dragon Shire\n\n\n              \nPlayers will no longer enter an infinite rejoin loop if both Cores are destroyed simultaneously, and victory will be assigned to one team at random.\n\nPlease note: Randomly assigned victory/defeat is intended as a temporary solution, intended to fix the infinite rejoin loop as soon as possible. A more robust solution for games that end in a draw will be implemented with a future patch.\n\n\n\n            "},{"name":"2015-03-24 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/18401781/heroes-closed-beta-patch-notes-march-24-2015","content":"\n              Design & Gameplay\n              General\n\n\nIn-game XP Changes\n\nThe in-game leveling curve has been adjusted slightly to slow down the first 10 team levels, though the amount of XP required to reach level 20 remains the same. \n\n\n\n              Battleground Updates\n              \nPlayer-controlled Dragon Knights are now more resistant to disable effects.\n\n\n              Battlegrounds\n              Mercenaries\n\n\nMercenary initial and scaling XP has been reworked.\nMercenary Camp tooltips now indicate which Camps can be Bribed.\n\n\nStructures\n\n\nGate, Tower, Town Hall, and Wall Health reduced by approximately 10%.\n\n\n              Bug Fixes\n              \nFixed a rare issue in which a Core with less than 1 Health could suddenly be destroyed without taking additional damage.\n\n\n            "},{"name":"2015-02-10 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/17906504/heroes-closed-beta-patch-notes-february-10-2015","content":"\n              Battlegrounds\n              General\n\n\nHuman teams can now begin Coop games on either side of the Battleground, rather than only on the left side.\nCollecting various Battleground items (Doubloons, Skulls, Seeds, Regeneration Globes) should now be more responsive.\n\n\nStructures\n\n\nCore\n\nThe Core is now invulnerable until both the Keep and Fort in a single lane are destroyed.\n\nThis is now consistent with the way in which Catapult Minions are spawned.\n\n\nWalls\n\nVision provided by Walls reduced by approximately 15%.\n\n\n\n              Bug Fixes\n              \nAbathur’s Hivemind Talent can no longer benefit the Dragon Knight or player-controlled Garden Terrors.Dragon Shire, Garden of Terror\n\n\n              \nBattleground objective units such as Grave Golems, Garden Terrors, and Mercenaries will now become invulnerable while leashing. \n\n\n              \nGrave Golems, Mercenaries, and Minions will no longer completely ignore Structures affected by Zeratul’s Void Prison.\n\n\n              \nSpirits created by Chen’s Storm, Earth, Fire Heroic Ability can no longer capture the Dragon Knight on Dragon Shire. \n\n\n            "},{"name":"2015-01-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/17345414/heroes-closed-beta-patch-notes-january-13-2015","content":"\n              Battlegrounds\n              Structures\n\n\nCore\n\nDamage versus Heroes increased by 20%\nAbathur’s Symbiote and Tassadar’s Plasma Shield can once again be cast on the Core.\n\nTowers\n\nThe amount of time that towers are disabled while regenerating ammunition has been increased from 20 to 30 seconds.\n\nThis was done to align with a previous change, in which the rate of tower ammo regeneration was reduced to 1 per 15 seconds. As such, towers will now come back online with 2 ammunition.\n\n\n\n\nMercenaries\n\n\nGrave Golem\n\nRoot\n\nGrave Golems will no longer pause when casting Root.\nRoot will now be cast on ranged Minions.\nHeroic units will remain the preferred targets.\n\nStomp\n\nThe post-cast delay on Stomp has been removed.\nStomp will now be cast when there are at least 2 Heroic units around the Grave Golem, or at least 3 Minions.\nStomp will not be cast unless the Grave Golem is already stationary.\nStomp now deals increased damage versus Minions.\n\n\n\n\n              Bug Fixes\n              \nBrightwing’s Phase Shift can no longer target the Dragon Statue while it is capturable on the Dragon Shire Battleground.\n\n\n              \nCatapult Minions no longer deal half their intended damage, and once again deal area of effect damage around their target.\n\n\n            "},{"name":"2014-12-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/16467431/heroes-technical-alpha-patch-notes-december-2-2014","content":"\n              Battleground Updates\n              \nThe Dragon Knight is no longer targetable by allied Abilities or Talents\n\n\n              Battlegrounds\n              General\n\n\nTown Halls no longer contain all of a town’s experience points. While Town Halls retain a majority of the experience, the surrounding towers protecting the town now yield experience as well.\n\n\n              Bug Fixes\n              \nHeroes can no longer be affected by enemy abilities while within the allied Hall of Storms.\n\n\n              \nHeroes with a permanent Cloak will now properly Decloak when exiting the Dragon Knight or Garden Terror. Dragon Shire, Garden of Terror\n\n\n            "},{"name":"2014-10-07 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/16081848/heroes-technical-alpha-patch-notes-oct-7-2014","content":"\n              Battlegrounds\n              General\n\n\nMinimap icons for the underground Grave Golem on the Haunted Mines, and neutral Garden Terrors on the Garden of Terror, no longer blink when they are in combat\nMinion damage dealt to opposing Minions has been reduced, allowing for stronger pushes with Minions in unattended lanes\n\n\n              Mercenary Camps\n\n\nKnight Mercenary Camp\n\nThe Healer Mercenary no longer heals other Mercenaries or Minions, and now casts a damaging Arcane Bolt on enemies instead.\n\n\n\nStructures\n\n\nThe Core now regenerates Shields after it has not taken damage for 8 seconds, rather than 10 seconds.\nTowers, Forts, and Keeps now regenerate Ammunition once every 15 seconds, rather than once every 10 seconds.\n\n\n              Bug Fixes\n              \nAttacking a Mercenary Camp at the moment it spawns will no longer cause the defending Mercenaries’ Health to reset mid-fight.\n\n\n            "},{"name":"2014-09-10 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/15787795/heroes-technical-alpha-patch-notes-sept-10-2014","content":"\n              Battlegrounds\n              Core\n\n\nHealth Regeneration has been removed from the Core, but Shield regeneration is unchanged.\n\n\nSiege Giants\n\n\nHealth regeneration when Siege Giants are out of combat for 8 or more seconds has been removed.\n\n\n              Bug Fixes\n              \nCorrected an issue in which Towers could unintentionally see through certain Line of Sight blockers.\n\n\n              \nForts and Keeps will no longer expend ammo without firing when a player quickly moves in and out of range.\n\n\n              \nMercenary Camps that are captured simultaneously by one team with the Mercenary Lord Talent, and one without, no longer causes the Mercenaries from both Camps to gain the Mercenary Lord buff.\n\n\n              \nPings issued on Mercenary Camps no longer require the player to target an individual Mercenary in order to request assistance with capturing the Camp.\n\n\n              \nUncaptured Mercenary Camps now appropriately reactivate when a player exits a Dragon Knight or Garden Terror. Dragon Shire, Garden of Terror\n\n\n            "},{"name":"2014-07-23 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14742016/heroes-technical-alpha-patch-notes-july-23-2014","content":"\n              Design & Gameplay\n              General\n\n\nThe amount of in-game experience required to reach levels 2-19 has been increased by approximately 6%.\n\n\nUnderdog Bonus\n\n\nThe amount of XP received from Hero takedowns is now more granular.\nThis will now have less impact during close games.\n\n\n              Battlegrounds\n              Core\n\n\nHealth now scales throughout the game.\nSplash damage radius increased from 1.5 to 2.\n\n\n            "},{"name":"2014-06-25 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14537490/heroes-technical-alpha-patch-notes-june-25-2014","content":"\n              Battleground Updates\n              \nPlayer controlled Dragon Knight duration now increases by 2 seconds for each minute of elapsed game time.​\n\n\n              General\n              Experience and Snowballing\n\n\nExperience earned by killing Minions in-lane has been increased by 20%.\nBonus trickle experience granted to a team that is behind by 3 or more levels during a game has been removed.\nEarly implementation for the “Underdog Bonus” has been added.\n\nA team that is behind in levels – the “underdog” – now earns bonus XP whenever an enemy hero is killed, while a team that is ahead in levels receives reduced XP for killing enemy heroes.\nThe amount of bonus takedown XP granted to the underdog team, as well as reduced takedown XP for the team that’s ahead, scale significantly up based on the level difference between teams.\nThe Underdog Bonus starts at a 1 level difference, and caps off at a 4 level gap.\nThe Underdog Bonus continues until team levels become even.\n\nHead here to check out additional details on the Underdog Bonus, as well as reasoning behind why we’re trying out this new system.\n\n\n              Mercenaries\n              General\n\n\nMercenary Camps now scale up to 30 minutes of elapsed game time.\nCaptured Mercenaries now scale up to 60 minutes of elapsed game time.\n\n\nGrave Golem\n\n\nCaptured Mercenary Grave Golems are now roughly equivalent in strength to a 30 Skull Grave Golem on the Haunted Mines.\nMercenary Grave Golems now seek out structures and ignore Heroes, Minions, and Mercenaries in their path.\nMercenary Grave Golems no longer only stomp Minions.\n\nIncreased the number of Heroic targets required for a Mercenary Grave Golem to issue a stomp from 1 to 2.\n\n\n\nKnights\n\n\nSorcerer\n\nNo longer shields other Knights\nDamage aura has been removed\nNow heals other Knights and surrounding minions.\n\n\n\nSiege Giants\n\n\nDefending Siege Giant attacks can no longer be dodged.\n\nSiege Giant Attack Damage has been reduced from 100 to 80 in order to compensate for this change.\n\n\n\n              Bug Fixes\n              \nA number of issues with Mercenary Camp and Minion A.I. have been resolved, and behaviors have been generally improved.\n\n\n              \nAddressed issues which made shrubs that have units within difficult to enter. It is now easier to attack units which are inside a shrub, as well.\n\n\n              \nFixed an issue that could cause a player to lose control of their hero if the Dragon Knight was killed while they were controlling it.Dragon Shire\n\n\n              \nThe Core’s Health bar no longer displays 0% when it has less than 100 Health remaining.\n\n\n            "},{"name":"2014-05-22 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14227686/heroes-technical-alpha-patch-notes-may-22-2014","content":"\n              Design & Gameplay\n              Snowballing\n\n\nAdditional efforts have been made to prevent snowballing for teams that are down by 3 or more levels during a game.\n\n\nGeneral\n\n\nThe team level cap has been increased from 25 to 30\n\n\n              Battlegrounds\n              General\n\n\nThe Grave Golem’s root ability now prioritizes MULEs\nKnight Mercenary Camp respawn time has been increased from 240 to 270 seconds\n\n\n              Bug Fixes\n              \nCombat sounds and effects are no longer audible, nor visible, through the Fog of War.\n\n\n              \nDragon Shire Mercenary Camp respawn timers are no longer drastically reduced when the Dragon Knight expires.\n\n\n              \nFixed an issue on Dragon Shire that could cause Brightwing to clip into the terrain after being punted by the Dragon Knight’s Savage Charge ability.\n\n\n              \nHeroes should no longer attempt to path through enemy Gates when given a long-distance move command toward objectives on the opposite side of a Battleground.\n\n\n              \nPings targeting the Dragon Knight no longer cause heroes to refer to the Dragon Knight as a Mercenary Camp.Dragon Shire\n\n\n            "}],"battlefieldofeternity":[{"name":"2016-09-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20243513/heroes-of-the-storm-patch-notes-september-13-2016","content":"\n              Design & Gameplay\n              Mounts\n\n\nMovement Speed reduced from 40 to 30%\n\n\nRegeneration Globes\n\n\nTime before Globes despawn reduced from 8 to 6 seconds\n\n\n              Battlegrounds\n              Mercenaries\n\n\nTiming Changes\n\nPreviously all Mercenary camps spawned at 120 seconds. The following adjustments have been made to spawn times:\n\n90 seconds: Sappers, Doubloon Pirates\n120 seconds: Siege Giants (unchanged), Impalers (unchanged)\n150 seconds: Knights, Fallen Shaman\n180 seconds: Grave Golem (unchanged)\n300 seconds: Headless Horseman (unchanged)\n\n\nCaptured Mercenaries will no longer grant Experience when killed.\n\n\n\n  Developer Comments: We started playtesting with staggered Mercenary\n  Camp spawn times, and quickly began to realize that it added more strategic\n  depth to the game, and coincided with some of our Battleground events. We have\n  been happy with the changes overall, and are listening to any feedback you may\n  have!\n\n\n              Bug Fixes\n              \nHeroes can no longer push captured Mercenaries by walking into them.\n\n\n            "},{"name":"2016-08-09 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20212896/heroes-of-the-storm-patch-notes-august-9-2016","content":"\n              Bug Fixes\n              \nBattlefield of Eternity: Enemy Heroes are no longer visible while inside the Vent located just below the Hell side’s center Gate.\n\n\n              \nCollision: Heroes can no longer push Neutral and Enemy Mercenaries by walking into them.\n\n\n            "},{"name":"2016-07-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20184555/heroes-of-the-storm-balance-update-july-27-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer be pushed by walking another Hero into them. \n\n\n              \nCollision: Heroes who are channeling an Ability can no longer be pushed when another Hero walks into them during the channel. \n\n\n            "},{"name":"2016-07-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20164442/heroes-of-the-storm-patch-notes-july-12-2016","content":"\n              Design & Gameplay\n              Core\n\n\nVictory determination is now much more precise in situations where both Cores are destroyed within fractions of a second. As a result, Victory will no longer be decided at random in cases where it appears that both Cores are destroyed at the same moment.\n\n\nRegeneration Globes\n\n\nHealth Regeneration\n\nPreviously: Restore 6.24% of maximum Health over 4 seconds\nNow: Restore 12% of maximum Health over 5 seconds\n\nMana Regeneration\n\nPreviously: Restore 32 Mana over 4 seconds.\nNow: Restore 8% of maximum Mana over 5 seconds\n\n\n\n\n  Developer Comments: Thank you for all your discussion and feedback on\n  our recent Health sustain post! We are still heavily evaluating a lot of it\n  but wanted to get the first round of changes in. Internally, we enjoyed the\n  increased importance on Regeneration Globes and have cleaned up the system a\n  bit. With a larger importance, denying enemies their Globes in lane has a much\n  larger impact.\n\n\nHealing Wells\n\n\nCooldown increased from 100 to 120 seconds\nHealth Regeneration\n\nPreviously: Restore 41% of maximum Health over 20 seconds.\nNow: Restore 40% of maximum Health over 20 seconds.\n\nMana Regeneration\n\nPreviously: Restore 20% of maximum Mana over 20 seconds.\nNow: Restore 30% of maximum Mana over 20 seconds.\n\n\n\n\n  Developer Comments: Much like the changes to Regeneration Globes, we\n  wanted to add a larger impact to the moment you click a Healing Well. Again,\n  we cleaned up the system a fair bit (hence the ~41% to 40% Health change) and\n  added a larger impact for heavy Mana users. The increased cooldown should make\n  the decision of when to tap the Healing Well slightly more interesting.\n\n\nMinions\n\n\nRanged, Melee, and Wizard Minions\n\nNow deal an additional 50% damage to Structures.\n\n\n\n\n  Developer Comments: Our goal with this change is to make escorting\n  Minions to Towns to be more impactful, such that they can really start to do\n  some damage if left unattended. Before this change, Minions were primarily XP\n  carriers that absorbed some Ammo shots from Towers. Now the armies of the\n  Nexus are a bit scarier when they march down a lane.\n\n\n\nCatapult Minions\n\nAttack range increased by 20%.\nSight range increased by 17%.\nWill now fixate on Structures. Catapults will not acquire a new target after fixating until the target is destroyed or the Catapult is killed.\n\n\n\n\n  Developer Comments: Catapults would often reach the Core, but have a\n  Minion wave spawn on them, distract them, and allow them to be killed off\n  before doing any significant damage. With increased range and fixation on a\n  Structure once they’ve started attacking, even one Catapult will more\n  consistently punch through a Core’s Shield and do actual damage.\n\n\n              Bug Fixes\n              \nBattlefield of Eternity: AI Heroes can now halt their attacks on Immortals at the center of the Battleground in order to gank an enemy Sgt. Hammer that is attacking inner-Towers and Keeps.\n\n\n            "},{"name":"2016-05-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20120032/heroes-of-the-storm-patch-notes-may-17-2016","content":"\n              Battlegrounds\n              Healing Well\n\n\n25% of a Healing Well’s maximum Health has been converted into a Shield. Shield Regeneration delay of 8 seconds.\n\n\n\n  Developer Comments: We’ve noticed some rather un-fun behavior in the\n  form of sniping Healing Wells over time using very long range Abilities. While\n  we’re okay with players doing this to a degree, we found it was too effective\n  given how little counterplay there was. To help solve this, turned a sizable\n  portion of Healing Well Health into a Shield. This means that if you offer\n  your Healing Well some respite from enemy attacks by chasing opponents away\n  every now and then, it will start to regenerate some of that Shield. Only\n  you can protect Healing Wells from those pesky Arcane Orbs!\n\n\n              Bug Fixes\n              \nFixed an issue in which attacking enemy Walls at certain angles would cause the Hero’s Basic Attack animation to play, but deal no damage.\n\n\n              \nImmortals on Battlefield of Eternity are now consistently flagged as Bosses.\n\n\n            "},{"name":"2016-04-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20102776/heroes-of-the-storm-balance-update-notes-april-27-2016","content":"\n              Bug Fixes\n              \nIssuing a Mount command while holding down the right mouse button to move will no longer interrupt Mount channeling.\n\n\n            "},{"name":"2016-04-19 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20099322/heroes-of-the-storm-patch-notes-april-19-2016","content":"\n              Bug Fixes\n              \nRe-issuing an attack order on a Structure in the Fog of War will no longer cause Basic Attack animations to repeat without applying damage.\n\n\n            "},{"name":"2016-03-01 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20049139/heroes-of-the-storm-patch-notes-march-1-2016","content":"\n              Bug Fixes\n              \nTowers will now properly fire Ammo provided by an allied M.U.L.E. immediately after 2 Ammo has been restored.\n\n\n            "},{"name":"2016-02-10 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20008204/heroes-of-the-storm-balance-update-notes-february-10-2016","content":"\n              Bug Fixes\n              \nDying will no longer cause the player’s Healing Well cooldown to reset.\n\n\n            "},{"name":"2016-02-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19995509/heroes-of-the-storm-patch-notes-february-2-2016","content":"\n              Design & Gameplay\n              Battleground Monsters\n\n\nBattleground-specific creatures are now universally defined as Monsters (ex: Neutral Garden Terrors, Sky Temple Guardians, etc.)\nSeveral Talents and Abilities have been changed to reflect this new categorization, and the following no longer affect Monsters:\n\nMercenary Lord\nJohanna's Knight Takes Pawn\nLunara's Cruel Bloom\nRexxar's Easy Prey and Bird of Prey\nThe Butcher's Chop Meat\n\nThe following now affect Monsters:\n\nAnub'arak's Beetle, Juiced\nAzmodan's Demonic Smite\n\nSeveral Talents that could previously trigger against both captured Mercenaries and Minions will now only affect Minions (ex: Seasoned Marksman, Black Soulstone, etc.)\n\n\n              Battlegrounds\n              Structures\n\n\nTowers, Forts, and Keeps now deal 50% bonus damage to Heroes\nCores will now display an “Invulnerable” message if attacked by an enemy when no allied Keeps have been destroyed.\nStructures can no longer be made Vulnerable\n\n\n\n  Developer Comments: The scaling changes we released in December made\n  it so Heroes could dive into Structures with impunity during the early game.\n  Increasing the damage that Structures deal to Heroes allows defending players\n  to feel a bit safer. We are exploring other fixes to help Structures feel more\n  meaningful throughout the game and will release them when they are ready.\n\n\n              Bug Fixes\n              \nDiagonally placed shrubs will now properly hide Heroes within them.\n\n\n              \nPlayers punted out of an enemy Hall of Storms will no longer be persistently stunned if an enemy unit blocked the path of the punt.\n\n\n            "},{"name":"2015-12-15 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19981657/heroes-of-the-storm-patch-notes-december-15-2015","content":"\n              Bug Fixes\n              \nDiagonally placed Shrubs will no longer sometimes fail to properly hide a Hero within.\n\n\n            "},{"name":"2015-11-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19960704/heroes-of-the-storm-patch-notes-november-17-2015","content":"\n              Design & Gameplay\n              Scaling Changes\n\n\nHealth and damage scaling for all Heroes, Battleground Events, Minions, and Mercenaries has been changed from flat, additive values to values that are multiplicative by percentage.\nA large portion of Heroes’ total scaling amounts, which were previously gained over the course of a game, have been added to their base values.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: Due to the way that our old level scaling system worked, early game level discrepancies created a larger difference in power level than we liked.  This often led to situations where a team could be up two or more levels early in a game, and use this advantage to create a larger lead.  We didn’t feel that games were fun for the winning or losing team in these types of scenarios.   As a result of these changes, all Heroes will have more power early, but gain less from each level.  Battleground Events, Minions, Mercenaries, and Structures have all been adjusted to compensate for this and should feel close to what they did previously.   The aim of these adjustments to the scaling system is to make level differences have a similar impact on your Hero’s statistics at all points in a game.  Now, each level offers about 4% Health and 4% damage, which mirrors what late game leads felt like in our previous version of the game.  It is important to note, that while being down a few levels will be less punishing than it was previously, Talent tier advantages can and will still have a noticeable impact on enemy engagements.\n\n\nRespawn Timers\n\n\nRespawn timers have been increased for levels 1 – 10.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: In order to reward players for getting early game\n  Takedowns, we’re also increasing the respawn time of dead Heroes at low\n  levels. Now, getting early game Takedowns (and the experience associated with\n  it) won’t give your team as much pure power as it did previously. Instead,\n  early kills will offer a “power play” moment, in which your team can destroy\n  enemy Structures, complete Battleground Events, or take more Mercenaries.\n  These meaningful strategic advantages will position a team closer to victory,\n  without giving them a large stat advantage and the ability to bully the\n  opposing enemy team.\n\n\nAttack Speed Slows\n\n\nAttack speed slows now apply only to Heroes and Summons.\n\n\n              Bug Fixes\n              \nFixed an issue that prevented Hero vision radiuses from displaying on Infernal Shrines and Battlefield of Eternity minimaps. \n\n\n            "},{"name":"2015-10-06 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19893628/heroes-of-the-storm-patch-notes-october-6-2015","content":"\n              Design & Gameplay\n              A.I. Talent Selection\n\n\nA.I. controlled Heroes will now select their Talents from a group of preset Talent builds.\n\n\n\n  Developer Comments: A.I. players will now choose from predetermined\n  Talent builds instead of randomly selecting Talents. This is especially\n  important for players who disconnect as the A.I. will now no longer randomly\n  choose Talents, but instead try to pick builds that are closer to what players\n  would expect. In addition, A.I. controlled Heroes in Versus A.I. games will\n  also have their own Talent builds to choose from.\n\n\nVehicles and Regeneration Globe Interaction\n\n\nRegeneration Globes will no longer heal Dragon Knights and Garden Terrors.\n\nInstead, Regeneration Globe effects will now be applied directly to the Hero inside the Dragon Knight or Garden Terror.\n\nPlayers within a Dragon Knight or Garden Terror can now also accumulate stacks for Talents such as Seasoned Marksman, Gathering Power, Regeneration Master, etc.\n\n\nSummoned Unit Attacks\n\n\nSummoned unit Basic Attacks will now miss if that Summon is Blinded or the target is Evading.\nSummoned unit Basic Attacks will no longer consume Block Talent stacks.\n\n\n              Battleground Updates\n              \nImmortal\n\nBasic Attack damage increased from 360 (+22 per minute) to 360 (+25 per minute) after 11 minutes have passed, and 360 (+30 per minute) after 16 minutes\n\n\n\n\n  Developer Comments: Matches on Battlefield could occasionally go quite\n  long as the Immortals weren’t scaling high enough into the late game. With\n  this slight damage increase they’ll be more of a threat as the game\n  progresses.\n\n\n            "},{"name":"2015-08-18 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19818499/heroes-of-the-storm-patch-notes-august-18-2015","content":"\n              Battleground Updates\n              \nWhen Immortals that are battling at the center of the Battleground swap locations for the first time, the Heaven Immortal will now always travel to right, and the Hell Immortal will always travel to the left.\n\n\n              Bug Fixes\n              \nBattlefield of Eternity Minions affected by Sylvanas’ Possession will now properly grant vision to the controlling team.\n\n\n              \nCaptured Bruiser Mercenary Camps on Battlefield of Eternity will now properly display their respawn timers when mousing over them on the minimap.\n\n\n              \nFixed a rare issue that could cause Mercenary Camps to permanently vanish on Battlefield of Eternity.\n\n\n              \nVisual effects from Basic Attacks and Hero Abilities against an Immortal are no longer visible through the fog of war.Battlefield of Eternity\n\n\n            "},{"name":"2015-06-30 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19803324/heroes-of-the-storm-patch-notes-june-30-2015","content":"\n              Battleground Updates\n              The conflict between the High Heavens and the Burning Hells has spilled into\nthe Nexus, breeding a new Battleground that is equal parts righteous and\nwicked. Angels, Demons, and now Heroes clash in ceaseless combat in their\nstruggle for dominance over the Battlefield of Eternity.\n\n\nBattlefield of Eternity is a two-lane Battleground featuring two massive Immortals that battle endlessly at its center, and teams must compete to defeat the opposing Immortal.\nOnce its foe has been toppled, the victorious Immortal will be restored to full Health, and proceed to seek out enemy Structures, attacking down the lane with the most remaining defenses.\nAn attacking Immortal will also gain a Shield, proportionate to the amount of Health it had remaining at the end of the battle.\n\nThe Immortal will perform ranged attacks, which each consume a portion of its Shield. Taking damage will also drain the Immortal’s Shield.\nOnce its Shield has been expended, the Immortal will only attack at melee range.\n\n\n\nNew Mercenaries\n\n\nFallen Shaman\n\nThese malformed demons never stray too far from a pack of Fallen Hounds, and will quickly resurrect any Hounds that are killed in combat. Those who value their souls would be wise to first destroy the Shaman before targeting its Hound companions.\n\nKhazra\n\nThe half human, half goat creatures that inhabit Battlefield of Eternity are tough, ranged attackers that won’t hesitate to rain spears on their foes. Defeat the Khazra at their camps to harness their destructive appetite before the enemy team.\n\n\n\nNew Battleground, More Often\n\n\nStarting today, the pool of Battlegrounds available in all modes, except Custom Games, will be temporarily limited to the following:\n\nBattlefield of Eternity\nSky Temple\nTomb of the Spider Queen\nCursed Hollow\n\nThis has been done to increase the frequency with which players encounter the new Battleground, Battlefield of Eternity.\nDuring this time, players can still select and play on any Battleground they wish using Custom Games.\nAll Battlegrounds, including Battlefield of Eternity, will once again be made available for play in all matchmaking game modes on Tuesday, July 7.\n\n\n            "}],"blackheartsbay":[{"name":"2016-09-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20243513/heroes-of-the-storm-patch-notes-september-13-2016","content":"\n              Design & Gameplay\n              Mounts\n\n\nMovement Speed reduced from 40 to 30%\n\n\nRegeneration Globes\n\n\nTime before Globes despawn reduced from 8 to 6 seconds\n\n\n              Battlegrounds\n              Mercenaries\n\n\nTiming Changes\n\nPreviously all Mercenary camps spawned at 120 seconds. The following adjustments have been made to spawn times:\n\n90 seconds: Sappers, Doubloon Pirates\n120 seconds: Siege Giants (unchanged), Impalers (unchanged)\n150 seconds: Knights, Fallen Shaman\n180 seconds: Grave Golem (unchanged)\n300 seconds: Headless Horseman (unchanged)\n\n\nCaptured Mercenaries will no longer grant Experience when killed.\n\n\n\n  Developer Comments: We started playtesting with staggered Mercenary\n  Camp spawn times, and quickly began to realize that it added more strategic\n  depth to the game, and coincided with some of our Battleground events. We have\n  been happy with the changes overall, and are listening to any feedback you may\n  have!\n\n\n              Bug Fixes\n              \nHeroes can no longer push captured Mercenaries by walking into them.\n\n\n            "},{"name":"2016-08-09 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20212896/heroes-of-the-storm-patch-notes-august-9-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer push Neutral and Enemy Mercenaries by walking into them.\n\n\n            "},{"name":"2016-07-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20184555/heroes-of-the-storm-balance-update-july-27-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer be pushed by walking another Hero into them. \n\n\n              \nCollision: Heroes who are channeling an Ability can no longer be pushed when another Hero walks into them during the channel. \n\n\n            "},{"name":"2016-07-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20164442/heroes-of-the-storm-patch-notes-july-12-2016","content":"\n              Design & Gameplay\n              Core\n\n\nVictory determination is now much more precise in situations where both Cores are destroyed within fractions of a second. As a result, Victory will no longer be decided at random in cases where it appears that both Cores are destroyed at the same moment.\n\n\nRegeneration Globes\n\n\nHealth Regeneration\n\nPreviously: Restore 6.24% of maximum Health over 4 seconds\nNow: Restore 12% of maximum Health over 5 seconds\n\nMana Regeneration\n\nPreviously: Restore 32 Mana over 4 seconds.\nNow: Restore 8% of maximum Mana over 5 seconds\n\n\n\n\n  Developer Comments: Thank you for all your discussion and feedback on\n  our recent Health sustain post! We are still heavily evaluating a lot of it\n  but wanted to get the first round of changes in. Internally, we enjoyed the\n  increased importance on Regeneration Globes and have cleaned up the system a\n  bit. With a larger importance, denying enemies their Globes in lane has a much\n  larger impact.\n\n\nHealing Wells\n\n\nCooldown increased from 100 to 120 seconds\nHealth Regeneration\n\nPreviously: Restore 41% of maximum Health over 20 seconds.\nNow: Restore 40% of maximum Health over 20 seconds.\n\nMana Regeneration\n\nPreviously: Restore 20% of maximum Mana over 20 seconds.\nNow: Restore 30% of maximum Mana over 20 seconds.\n\n\n\n\n  Developer Comments: Much like the changes to Regeneration Globes, we\n  wanted to add a larger impact to the moment you click a Healing Well. Again,\n  we cleaned up the system a fair bit (hence the ~41% to 40% Health change) and\n  added a larger impact for heavy Mana users. The increased cooldown should make\n  the decision of when to tap the Healing Well slightly more interesting.\n\n\nMinions\n\n\nRanged, Melee, and Wizard Minions\n\nNow deal an additional 50% damage to Structures.\n\n\n\n\n  Developer Comments: Our goal with this change is to make escorting\n  Minions to Towns to be more impactful, such that they can really start to do\n  some damage if left unattended. Before this change, Minions were primarily XP\n  carriers that absorbed some Ammo shots from Towers. Now the armies of the\n  Nexus are a bit scarier when they march down a lane.\n\n\n\nCatapult Minions\n\nAttack range increased by 20%.\nSight range increased by 17%.\nWill now fixate on Structures. Catapults will not acquire a new target after fixating until the target is destroyed or the Catapult is killed.\n\n\n\n\n  Developer Comments: Catapults would often reach the Core, but have a\n  Minion wave spawn on them, distract them, and allow them to be killed off\n  before doing any significant damage. With increased range and fixation on a\n  Structure once they’ve started attacking, even one Catapult will more\n  consistently punch through a Core’s Shield and do actual damage.\n\n\n            "},{"name":"2016-05-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20120032/heroes-of-the-storm-patch-notes-may-17-2016","content":"\n              Battlegrounds\n              Healing Well\n\n\n25% of a Healing Well’s maximum Health has been converted into a Shield. Shield Regeneration delay of 8 seconds.\n\n\n\n  Developer Comments: We’ve noticed some rather un-fun behavior in the\n  form of sniping Healing Wells over time using very long range Abilities. While\n  we’re okay with players doing this to a degree, we found it was too effective\n  given how little counterplay there was. To help solve this, turned a sizable\n  portion of Healing Well Health into a Shield. This means that if you offer\n  your Healing Well some respite from enemy attacks by chasing opponents away\n  every now and then, it will start to regenerate some of that Shield. Only\n  you can protect Healing Wells from those pesky Arcane Orbs!\n\n\n              Bug Fixes\n              \nFixed an issue in which attacking enemy Walls at certain angles would cause the Hero’s Basic Attack animation to play, but deal no damage.\n\n\n            "},{"name":"2016-04-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20102776/heroes-of-the-storm-balance-update-notes-april-27-2016","content":"\n              Bug Fixes\n              \nIssuing a Mount command while holding down the right mouse button to move will no longer interrupt Mount channeling.\n\n\n            "},{"name":"2016-04-19 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20099322/heroes-of-the-storm-patch-notes-april-19-2016","content":"\n              Bug Fixes\n              \nRe-issuing an attack order on a Structure in the Fog of War will no longer cause Basic Attack animations to repeat without applying damage.\n\n\n            "},{"name":"2016-03-01 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20049139/heroes-of-the-storm-patch-notes-march-1-2016","content":"\n              Bug Fixes\n              \nTowers will now properly fire Ammo provided by an allied M.U.L.E. immediately after 2 Ammo has been restored.\n\n\n            "},{"name":"2016-02-10 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20008204/heroes-of-the-storm-balance-update-notes-february-10-2016","content":"\n              Bug Fixes\n              \nDying will no longer cause the player’s Healing Well cooldown to reset.\n\n\n            "},{"name":"2016-02-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19995509/heroes-of-the-storm-patch-notes-february-2-2016","content":"\n              Design & Gameplay\n              Battleground Monsters\n\n\nBattleground-specific creatures are now universally defined as Monsters (ex: Neutral Garden Terrors, Sky Temple Guardians, etc.)\nSeveral Talents and Abilities have been changed to reflect this new categorization, and the following no longer affect Monsters:\n\nMercenary Lord\nJohanna's Knight Takes Pawn\nLunara's Cruel Bloom\nRexxar's Easy Prey and Bird of Prey\nThe Butcher's Chop Meat\n\nThe following now affect Monsters:\n\nAnub'arak's Beetle, Juiced\nAzmodan's Demonic Smite\n\nSeveral Talents that could previously trigger against both captured Mercenaries and Minions will now only affect Minions (ex: Seasoned Marksman, Black Soulstone, etc.)\n\n\n              Battlegrounds\n              Structures\n\n\nTowers, Forts, and Keeps now deal 50% bonus damage to Heroes\nCores will now display an “Invulnerable” message if attacked by an enemy when no allied Keeps have been destroyed.\nStructures can no longer be made Vulnerable\n\n\n\n  Developer Comments: The scaling changes we released in December made\n  it so Heroes could dive into Structures with impunity during the early game.\n  Increasing the damage that Structures deal to Heroes allows defending players\n  to feel a bit safer. We are exploring other fixes to help Structures feel more\n  meaningful throughout the game and will release them when they are ready.\n\n\n              Bug Fixes\n              \nDiagonally placed shrubs will now properly hide Heroes within them.\n\n\n              \nPlayers punted out of an enemy Hall of Storms will no longer be persistently stunned if an enemy unit blocked the path of the punt.\n\n\n            "},{"name":"2015-12-15 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19981657/heroes-of-the-storm-patch-notes-december-15-2015","content":"\n              Bug Fixes\n              \nDiagonally placed Shrubs will no longer sometimes fail to properly hide a Hero within.\n\n\n            "},{"name":"2015-11-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19960704/heroes-of-the-storm-patch-notes-november-17-2015","content":"\n              Design & Gameplay\n              Scaling Changes\n\n\nHealth and damage scaling for all Heroes, Battleground Events, Minions, and Mercenaries has been changed from flat, additive values to values that are multiplicative by percentage.\nA large portion of Heroes’ total scaling amounts, which were previously gained over the course of a game, have been added to their base values.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: Due to the way that our old level scaling system worked, early game level discrepancies created a larger difference in power level than we liked.  This often led to situations where a team could be up two or more levels early in a game, and use this advantage to create a larger lead.  We didn’t feel that games were fun for the winning or losing team in these types of scenarios.   As a result of these changes, all Heroes will have more power early, but gain less from each level.  Battleground Events, Minions, Mercenaries, and Structures have all been adjusted to compensate for this and should feel close to what they did previously.   The aim of these adjustments to the scaling system is to make level differences have a similar impact on your Hero’s statistics at all points in a game.  Now, each level offers about 4% Health and 4% damage, which mirrors what late game leads felt like in our previous version of the game.  It is important to note, that while being down a few levels will be less punishing than it was previously, Talent tier advantages can and will still have a noticeable impact on enemy engagements.\n\n\nRespawn Timers\n\n\nRespawn timers have been increased for levels 1 – 10.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: In order to reward players for getting early game\n  Takedowns, we’re also increasing the respawn time of dead Heroes at low\n  levels. Now, getting early game Takedowns (and the experience associated with\n  it) won’t give your team as much pure power as it did previously. Instead,\n  early kills will offer a “power play” moment, in which your team can destroy\n  enemy Structures, complete Battleground Events, or take more Mercenaries.\n  These meaningful strategic advantages will position a team closer to victory,\n  without giving them a large stat advantage and the ability to bully the\n  opposing enemy team.\n\n\nAttack Speed Slows\n\n\nAttack speed slows now apply only to Heroes and Summons.\n\n\n            "},{"name":"2015-10-06 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19893628/heroes-of-the-storm-patch-notes-october-6-2015","content":"\n              Design & Gameplay\n              A.I. Talent Selection\n\n\nA.I. controlled Heroes will now select their Talents from a group of preset Talent builds.\n\n\n\n  Developer Comments: A.I. players will now choose from predetermined\n  Talent builds instead of randomly selecting Talents. This is especially\n  important for players who disconnect as the A.I. will now no longer randomly\n  choose Talents, but instead try to pick builds that are closer to what players\n  would expect. In addition, A.I. controlled Heroes in Versus A.I. games will\n  also have their own Talent builds to choose from.\n\n\nVehicles and Regeneration Globe Interaction\n\n\nRegeneration Globes will no longer heal Dragon Knights and Garden Terrors.\n\nInstead, Regeneration Globe effects will now be applied directly to the Hero inside the Dragon Knight or Garden Terror.\n\nPlayers within a Dragon Knight or Garden Terror can now also accumulate stacks for Talents such as Seasoned Marksman, Gathering Power, Regeneration Master, etc.\n\n\nSummoned Unit Attacks\n\n\nSummoned unit Basic Attacks will now miss if that Summon is Blinded or the target is Evading.\nSummoned unit Basic Attacks will no longer consume Block Talent stacks.\n\n\n            "},{"name":"2015-08-18 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19818499/heroes-of-the-storm-patch-notes-august-18-2015","content":"\n              Bug Fixes\n              \nFixed an issue in which certain movement-based Abilities, such as Kerrigan’s Ravage or Chen’s Flying Kick, could not target the Doubloon Chests on Blackheart's Bay, or Plant Terror Overgrowths on Garden of Terror.\n\n\n            "},{"name":"2015-05-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19067455/heroes-closed-beta-patch-notes-may-12-2015","content":"\n              Bug Fixes\n              \nAlerts proclaiming that the Core is under attack will no longer play when an enemy Hero is within range of the Core before a Keep has been destroyed.\n\n\n              \nPlayers will no longer enter an infinite rejoin loop if both Cores are destroyed simultaneously, and victory will be assigned to one team at random.\n\nPlease note: Randomly assigned victory/defeat is intended as a temporary solution, intended to fix the infinite rejoin loop as soon as possible. A more robust solution for games that end in a draw will be implemented with a future patch.\n\n\n\n            "},{"name":"2015-03-24 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/18401781/heroes-closed-beta-patch-notes-march-24-2015","content":"\n              Design & Gameplay\n              General\n\n\nIn-game XP Changes\n\nThe in-game leveling curve has been adjusted slightly to slow down the first 10 team levels, though the amount of XP required to reach level 20 remains the same. \n\n\n\n              Battleground Updates\n              \nDoubloon Chest status bars are now segmented, and each segment represents when a Doubloon will spawn.\n\n\n              Battlegrounds\n              Mercenaries\n\n\nMercenary initial and scaling XP has been reworked.\nMercenary Camp tooltips now indicate which Camps can be Bribed.\n\n\nStructures\n\n\nGate, Tower, Town Hall, and Wall Health reduced by approximately 10%.\n\n\n              Bug Fixes\n              \nFixed a rare issue in which a Core with less than 1 Health could suddenly be destroyed without taking additional damage.\n\n\n            "},{"name":"2015-02-10 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/17906504/heroes-closed-beta-patch-notes-february-10-2015","content":"\n              Battlegrounds\n              General\n\n\nHuman teams can now begin Coop games on either side of the Battleground, rather than only on the left side.\nCollecting various Battleground items (Doubloons, Skulls, Seeds, Regeneration Globes) should now be more responsive.\n\n\nStructures\n\n\nCore\n\nThe Core is now invulnerable until both the Keep and Fort in a single lane are destroyed.\n\nThis is now consistent with the way in which Catapult Minions are spawned.\n\n\nWalls\n\nVision provided by Walls reduced by approximately 15%.\n\n\n\n              Bug Fixes\n              \nBattleground objective units such as Grave Golems, Garden Terrors, and Mercenaries will now become invulnerable while leashing. \n\n\n              \nFixed an issue that could cause Grave Golems to deviate from their intended attack paths (Hotfixed on January 22).Blackheart's Bay, Cursed Hollow, Haunted Mines\n\n\n              \nGrave Golems will now properly ignore Tassadar’s Force Wall.Blackheart's Bay, Cursed Hollow, Haunted Mines\n\n\n              \nGrave Golems, Mercenaries, and Minions will no longer completely ignore Structures affected by Zeratul’s Void Prison.\n\n\n              \nKerrigan’s Ultralisk can now properly walk through uncollected Doubloons on Blackheart's Bay.\n\n\n            "},{"name":"2015-01-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/17345414/heroes-closed-beta-patch-notes-january-13-2015","content":"\n              Battlegrounds\n              Structures\n\n\nCore\n\nDamage versus Heroes increased by 20%\nAbathur’s Symbiote and Tassadar’s Plasma Shield can once again be cast on the Core.\n\nTowers\n\nThe amount of time that towers are disabled while regenerating ammunition has been increased from 20 to 30 seconds.\n\nThis was done to align with a previous change, in which the rate of tower ammo regeneration was reduced to 1 per 15 seconds. As such, towers will now come back online with 2 ammunition.\n\n\n\n\nMercenaries\n\n\nGrave Golem\n\nRoot\n\nGrave Golems will no longer pause when casting Root.\nRoot will now be cast on ranged Minions.\nHeroic units will remain the preferred targets.\n\nStomp\n\nThe post-cast delay on Stomp has been removed.\nStomp will now be cast when there are at least 2 Heroic units around the Grave Golem, or at least 3 Minions.\nStomp will not be cast unless the Grave Golem is already stationary.\nStomp now deals increased damage versus Minions.\n\n\n\n\n              Bug Fixes\n              \nCatapult Minions no longer deal half their intended damage, and once again deal area of effect damage around their target.\n\n\n            "},{"name":"2014-12-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/16467431/heroes-technical-alpha-patch-notes-december-2-2014","content":"\n              Battlegrounds\n              General\n\n\nTown Halls no longer contain all of a town’s experience points. While Town Halls retain a majority of the experience, the surrounding towers protecting the town now yield experience as well.\n\n\n              Bug Fixes\n              \nHeroes can no longer be affected by enemy abilities while within the allied Hall of Storms.\n\n\n            "},{"name":"2014-10-07 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/16081848/heroes-technical-alpha-patch-notes-oct-7-2014","content":"\n              Battlegrounds\n              General\n\n\nMinimap icons for the underground Grave Golem on the Haunted Mines, and neutral Garden Terrors on the Garden of Terror, no longer blink when they are in combat\nMinion damage dealt to opposing Minions has been reduced, allowing for stronger pushes with Minions in unattended lanes\n\n\n              Mercenary Camps\n\n\nKnight Mercenary Camp\n\nThe Healer Mercenary no longer heals other Mercenaries or Minions, and now casts a damaging Arcane Bolt on enemies instead.\n\n\n\nStructures\n\n\nThe Core now regenerates Shields after it has not taken damage for 8 seconds, rather than 10 seconds.\nTowers, Forts, and Keeps now regenerate Ammunition once every 15 seconds, rather than once every 10 seconds.\n\n\n              Bug Fixes\n              \nAttacking a Mercenary Camp at the moment it spawns will no longer cause the defending Mercenaries’ Health to reset mid-fight.\n\n\n            "},{"name":"2014-09-10 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/15787795/heroes-technical-alpha-patch-notes-sept-10-2014","content":"\n              Battlegrounds\n              Core\n\n\nHealth Regeneration has been removed from the Core, but Shield regeneration is unchanged.\n\n\nSiege Giants\n\n\nHealth regeneration when Siege Giants are out of combat for 8 or more seconds has been removed.\n\n\n              Bug Fixes\n              \nCorrected an issue in which Towers could unintentionally see through certain Line of Sight blockers.\n\n\n              \nForts and Keeps will no longer expend ammo without firing when a player quickly moves in and out of range.\n\n\n              \nMercenary Camps that are captured simultaneously by one team with the Mercenary Lord Talent, and one without, no longer causes the Mercenaries from both Camps to gain the Mercenary Lord buff.\n\n\n              \nPings issued on Mercenary Camps no longer require the player to target an individual Mercenary in order to request assistance with capturing the Camp.\n\n\n            "},{"name":"2014-07-23 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14742016/heroes-technical-alpha-patch-notes-july-23-2014","content":"\n              Design & Gameplay\n              General\n\n\nThe amount of in-game experience required to reach levels 2-19 has been increased by approximately 6%.\n\n\nUnderdog Bonus\n\n\nThe amount of XP received from Hero takedowns is now more granular.\nThis will now have less impact during close games.\n\n\n              Battlegrounds\n              Core\n\n\nHealth now scales throughout the game.\nSplash damage radius increased from 1.5 to 2.\n\n\n              Bug Fixes\n              \nTreasure Chests on Blackheart's Bay no longer visibly persist through the Fog of War, nor on the minimap, after they are destroyed. \n\n\n            "},{"name":"2014-06-25 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14537490/heroes-technical-alpha-patch-notes-june-25-2014","content":"\n              Battleground Updates\n              \nTreasure Chest Health has been increased to account for changes to Hero Basic Attack Speeds.\nSkeleton Camp respawn time increased from 120 to 150 seconds\n\n\n              General\n              Experience and Snowballing\n\n\nExperience earned by killing Minions in-lane has been increased by 20%.\nBonus trickle experience granted to a team that is behind by 3 or more levels during a game has been removed.\nEarly implementation for the “Underdog Bonus” has been added.\n\nA team that is behind in levels – the “underdog” – now earns bonus XP whenever an enemy hero is killed, while a team that is ahead in levels receives reduced XP for killing enemy heroes.\nThe amount of bonus takedown XP granted to the underdog team, as well as reduced takedown XP for the team that’s ahead, scale significantly up based on the level difference between teams.\nThe Underdog Bonus starts at a 1 level difference, and caps off at a 4 level gap.\nThe Underdog Bonus continues until team levels become even.\n\nHead here to check out additional details on the Underdog Bonus, as well as reasoning behind why we’re trying out this new system.\n\n\n              Mercenaries\n              General\n\n\nMercenary Camps now scale up to 30 minutes of elapsed game time.\nCaptured Mercenaries now scale up to 60 minutes of elapsed game time.\n\n\nGrave Golem\n\n\nCaptured Mercenary Grave Golems are now roughly equivalent in strength to a 30 Skull Grave Golem on the Haunted Mines.\nMercenary Grave Golems now seek out structures and ignore Heroes, Minions, and Mercenaries in their path.\nMercenary Grave Golems no longer only stomp Minions.\n\nIncreased the number of Heroic targets required for a Mercenary Grave Golem to issue a stomp from 1 to 2.\n\n\n\nKnights\n\n\nSorcerer\n\nNo longer shields other Knights\nDamage aura has been removed\nNow heals other Knights and surrounding minions.\n\n\n\nSiege Giants\n\n\nDefending Siege Giant attacks can no longer be dodged.\n\nSiege Giant Attack Damage has been reduced from 100 to 80 in order to compensate for this change.\n\n\n\n              Bug Fixes\n              \nA number of issues with Mercenary Camp and Minion A.I. have been resolved, and behaviors have been generally improved.\n\n\n              \nAddressed issues which made shrubs that have units within difficult to enter. It is now easier to attack units which are inside a shrub, as well.\n\n\n              \nThe Core’s Health bar no longer displays 0% when it has less than 100 Health remaining.\n\n\n            "},{"name":"2014-05-22 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14227686/heroes-technical-alpha-patch-notes-may-22-2014","content":"\n              Design & Gameplay\n              Snowballing\n\n\nAdditional efforts have been made to prevent snowballing for teams that are down by 3 or more levels during a game.\n\n\nGeneral\n\n\nThe team level cap has been increased from 25 to 30\n\n\n              Battlegrounds\n              General\n\n\nThe Grave Golem’s root ability now prioritizes MULEs\nKnight Mercenary Camp respawn time has been increased from 240 to 270 seconds\n\n\n              Bug Fixes\n              \nCombat sounds and effects are no longer audible, nor visible, through the Fog of War.\n\n\n              \nHeroes should no longer attempt to path through enemy Gates when given a long-distance move command toward objectives on the opposite side of a Battleground.\n\n\n              \nThe northwest Knight Mercenary Camp on Blackheart's Bay now properly displays a banner which indicates difficulty and description text.\n\n\n            "}],"cursedhollow":[{"name":"2016-09-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20243513/heroes-of-the-storm-patch-notes-september-13-2016","content":"\n              Design & Gameplay\n              Mounts\n\n\nMovement Speed reduced from 40 to 30%\n\n\nRegeneration Globes\n\n\nTime before Globes despawn reduced from 8 to 6 seconds\n\n\n              Battlegrounds\n              Mercenaries\n\n\nTiming Changes\n\nPreviously all Mercenary camps spawned at 120 seconds. The following adjustments have been made to spawn times:\n\n90 seconds: Sappers, Doubloon Pirates\n120 seconds: Siege Giants (unchanged), Impalers (unchanged)\n150 seconds: Knights, Fallen Shaman\n180 seconds: Grave Golem (unchanged)\n300 seconds: Headless Horseman (unchanged)\n\n\nCaptured Mercenaries will no longer grant Experience when killed.\n\n\n\n  Developer Comments: We started playtesting with staggered Mercenary\n  Camp spawn times, and quickly began to realize that it added more strategic\n  depth to the game, and coincided with some of our Battleground events. We have\n  been happy with the changes overall, and are listening to any feedback you may\n  have!\n\n\n              Bug Fixes\n              \nHeroes can no longer push captured Mercenaries by walking into them.\n\n\n            "},{"name":"2016-08-09 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20212896/heroes-of-the-storm-patch-notes-august-9-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer push Neutral and Enemy Mercenaries by walking into them.\n\n\n            "},{"name":"2016-07-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20184555/heroes-of-the-storm-balance-update-july-27-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer be pushed by walking another Hero into them. \n\n\n              \nCollision: Heroes who are channeling an Ability can no longer be pushed when another Hero walks into them during the channel. \n\n\n            "},{"name":"2016-07-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20164442/heroes-of-the-storm-patch-notes-july-12-2016","content":"\n              Design & Gameplay\n              Core\n\n\nVictory determination is now much more precise in situations where both Cores are destroyed within fractions of a second. As a result, Victory will no longer be decided at random in cases where it appears that both Cores are destroyed at the same moment.\n\n\nRegeneration Globes\n\n\nHealth Regeneration\n\nPreviously: Restore 6.24% of maximum Health over 4 seconds\nNow: Restore 12% of maximum Health over 5 seconds\n\nMana Regeneration\n\nPreviously: Restore 32 Mana over 4 seconds.\nNow: Restore 8% of maximum Mana over 5 seconds\n\n\n\n\n  Developer Comments: Thank you for all your discussion and feedback on\n  our recent Health sustain post! We are still heavily evaluating a lot of it\n  but wanted to get the first round of changes in. Internally, we enjoyed the\n  increased importance on Regeneration Globes and have cleaned up the system a\n  bit. With a larger importance, denying enemies their Globes in lane has a much\n  larger impact.\n\n\nHealing Wells\n\n\nCooldown increased from 100 to 120 seconds\nHealth Regeneration\n\nPreviously: Restore 41% of maximum Health over 20 seconds.\nNow: Restore 40% of maximum Health over 20 seconds.\n\nMana Regeneration\n\nPreviously: Restore 20% of maximum Mana over 20 seconds.\nNow: Restore 30% of maximum Mana over 20 seconds.\n\n\n\n\n  Developer Comments: Much like the changes to Regeneration Globes, we\n  wanted to add a larger impact to the moment you click a Healing Well. Again,\n  we cleaned up the system a fair bit (hence the ~41% to 40% Health change) and\n  added a larger impact for heavy Mana users. The increased cooldown should make\n  the decision of when to tap the Healing Well slightly more interesting.\n\n\nMinions\n\n\nRanged, Melee, and Wizard Minions\n\nNow deal an additional 50% damage to Structures.\n\n\n\n\n  Developer Comments: Our goal with this change is to make escorting\n  Minions to Towns to be more impactful, such that they can really start to do\n  some damage if left unattended. Before this change, Minions were primarily XP\n  carriers that absorbed some Ammo shots from Towers. Now the armies of the\n  Nexus are a bit scarier when they march down a lane.\n\n\n\nCatapult Minions\n\nAttack range increased by 20%.\nSight range increased by 17%.\nWill now fixate on Structures. Catapults will not acquire a new target after fixating until the target is destroyed or the Catapult is killed.\n\n\n\n\n  Developer Comments: Catapults would often reach the Core, but have a\n  Minion wave spawn on them, distract them, and allow them to be killed off\n  before doing any significant damage. With increased range and fixation on a\n  Structure once they’ve started attacking, even one Catapult will more\n  consistently punch through a Core’s Shield and do actual damage.\n\n\n            "},{"name":"2016-05-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20120032/heroes-of-the-storm-patch-notes-may-17-2016","content":"\n              Battlegrounds\n              Healing Well\n\n\n25% of a Healing Well’s maximum Health has been converted into a Shield. Shield Regeneration delay of 8 seconds.\n\n\n\n  Developer Comments: We’ve noticed some rather un-fun behavior in the\n  form of sniping Healing Wells over time using very long range Abilities. While\n  we’re okay with players doing this to a degree, we found it was too effective\n  given how little counterplay there was. To help solve this, turned a sizable\n  portion of Healing Well Health into a Shield. This means that if you offer\n  your Healing Well some respite from enemy attacks by chasing opponents away\n  every now and then, it will start to regenerate some of that Shield. Only\n  you can protect Healing Wells from those pesky Arcane Orbs!\n\n\n              Bug Fixes\n              \nFixed an issue in which attacking enemy Walls at certain angles would cause the Hero’s Basic Attack animation to play, but deal no damage.\n\n\n            "},{"name":"2016-04-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20102776/heroes-of-the-storm-balance-update-notes-april-27-2016","content":"\n              Bug Fixes\n              \nIssuing a Mount command while holding down the right mouse button to move will no longer interrupt Mount channeling.\n\n\n            "},{"name":"2016-04-19 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20099322/heroes-of-the-storm-patch-notes-april-19-2016","content":"\n              Bug Fixes\n              \nRe-issuing an attack order on a Structure in the Fog of War will no longer cause Basic Attack animations to repeat without applying damage.\n\n\n            "},{"name":"2016-03-01 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20049139/heroes-of-the-storm-patch-notes-march-1-2016","content":"\n              Bug Fixes\n              \nTowers will now properly fire Ammo provided by an allied M.U.L.E. immediately after 2 Ammo has been restored.\n\n\n            "},{"name":"2016-02-10 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20008204/heroes-of-the-storm-balance-update-notes-february-10-2016","content":"\n              Bug Fixes\n              \nDying will no longer cause the player’s Healing Well cooldown to reset.\n\n\n            "},{"name":"2016-02-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19995509/heroes-of-the-storm-patch-notes-february-2-2016","content":"\n              Design & Gameplay\n              Battleground Monsters\n\n\nBattleground-specific creatures are now universally defined as Monsters (ex: Neutral Garden Terrors, Sky Temple Guardians, etc.)\nSeveral Talents and Abilities have been changed to reflect this new categorization, and the following no longer affect Monsters:\n\nMercenary Lord\nJohanna's Knight Takes Pawn\nLunara's Cruel Bloom\nRexxar's Easy Prey and Bird of Prey\nThe Butcher's Chop Meat\n\nThe following now affect Monsters:\n\nAnub'arak's Beetle, Juiced\nAzmodan's Demonic Smite\n\nSeveral Talents that could previously trigger against both captured Mercenaries and Minions will now only affect Minions (ex: Seasoned Marksman, Black Soulstone, etc.)\n\n\n              Battlegrounds\n              Structures\n\n\nTowers, Forts, and Keeps now deal 50% bonus damage to Heroes\nCores will now display an “Invulnerable” message if attacked by an enemy when no allied Keeps have been destroyed.\nStructures can no longer be made Vulnerable\n\n\n\n  Developer Comments: The scaling changes we released in December made\n  it so Heroes could dive into Structures with impunity during the early game.\n  Increasing the damage that Structures deal to Heroes allows defending players\n  to feel a bit safer. We are exploring other fixes to help Structures feel more\n  meaningful throughout the game and will release them when they are ready.\n\n\n              Bug Fixes\n              \nDiagonally placed shrubs will now properly hide Heroes within them.\n\n\n              \nPlayers punted out of an enemy Hall of Storms will no longer be persistently stunned if an enemy unit blocked the path of the punt.\n\n\n            "},{"name":"2015-12-15 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19981657/heroes-of-the-storm-patch-notes-december-15-2015","content":"\n              Bug Fixes\n              \nDiagonally placed Shrubs will no longer sometimes fail to properly hide a Hero within.\n\n\n            "},{"name":"2015-11-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19960704/heroes-of-the-storm-patch-notes-november-17-2015","content":"\n              Design & Gameplay\n              Scaling Changes\n\n\nHealth and damage scaling for all Heroes, Battleground Events, Minions, and Mercenaries has been changed from flat, additive values to values that are multiplicative by percentage.\nA large portion of Heroes’ total scaling amounts, which were previously gained over the course of a game, have been added to their base values.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: Due to the way that our old level scaling system worked, early game level discrepancies created a larger difference in power level than we liked.  This often led to situations where a team could be up two or more levels early in a game, and use this advantage to create a larger lead.  We didn’t feel that games were fun for the winning or losing team in these types of scenarios.   As a result of these changes, all Heroes will have more power early, but gain less from each level.  Battleground Events, Minions, Mercenaries, and Structures have all been adjusted to compensate for this and should feel close to what they did previously.   The aim of these adjustments to the scaling system is to make level differences have a similar impact on your Hero’s statistics at all points in a game.  Now, each level offers about 4% Health and 4% damage, which mirrors what late game leads felt like in our previous version of the game.  It is important to note, that while being down a few levels will be less punishing than it was previously, Talent tier advantages can and will still have a noticeable impact on enemy engagements.\n\n\nRespawn Timers\n\n\nRespawn timers have been increased for levels 1 – 10.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: In order to reward players for getting early game\n  Takedowns, we’re also increasing the respawn time of dead Heroes at low\n  levels. Now, getting early game Takedowns (and the experience associated with\n  it) won’t give your team as much pure power as it did previously. Instead,\n  early kills will offer a “power play” moment, in which your team can destroy\n  enemy Structures, complete Battleground Events, or take more Mercenaries.\n  These meaningful strategic advantages will position a team closer to victory,\n  without giving them a large stat advantage and the ability to bully the\n  opposing enemy team.\n\n\nAttack Speed Slows\n\n\nAttack speed slows now apply only to Heroes and Summons.\n\n\n            "},{"name":"2015-10-06 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19893628/heroes-of-the-storm-patch-notes-october-6-2015","content":"\n              Design & Gameplay\n              A.I. Talent Selection\n\n\nA.I. controlled Heroes will now select their Talents from a group of preset Talent builds.\n\n\n\n  Developer Comments: A.I. players will now choose from predetermined\n  Talent builds instead of randomly selecting Talents. This is especially\n  important for players who disconnect as the A.I. will now no longer randomly\n  choose Talents, but instead try to pick builds that are closer to what players\n  would expect. In addition, A.I. controlled Heroes in Versus A.I. games will\n  also have their own Talent builds to choose from.\n\n\nVehicles and Regeneration Globe Interaction\n\n\nRegeneration Globes will no longer heal Dragon Knights and Garden Terrors.\n\nInstead, Regeneration Globe effects will now be applied directly to the Hero inside the Dragon Knight or Garden Terror.\n\nPlayers within a Dragon Knight or Garden Terror can now also accumulate stacks for Talents such as Seasoned Marksman, Gathering Power, Regeneration Master, etc.\n\n\nSummoned Unit Attacks\n\n\nSummoned unit Basic Attacks will now miss if that Summon is Blinded or the target is Evading.\nSummoned unit Basic Attacks will no longer consume Block Talent stacks.\n\n\n            "},{"name":"2015-05-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19067455/heroes-closed-beta-patch-notes-may-12-2015","content":"\n              Bug Fixes\n              \nAlerts proclaiming that the Core is under attack will no longer play when an enemy Hero is within range of the Core before a Keep has been destroyed.\n\n\n              \nPlayers will no longer enter an infinite rejoin loop if both Cores are destroyed simultaneously, and victory will be assigned to one team at random.\n\nPlease note: Randomly assigned victory/defeat is intended as a temporary solution, intended to fix the infinite rejoin loop as soon as possible. A more robust solution for games that end in a draw will be implemented with a future patch.\n\n\n\n            "},{"name":"2015-03-24 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/18401781/heroes-closed-beta-patch-notes-march-24-2015","content":"\n              Design & Gameplay\n              General\n\n\nIn-game XP Changes\n\nThe in-game leveling curve has been adjusted slightly to slow down the first 10 team levels, though the amount of XP required to reach level 20 remains the same. \n\n\n\n              Battlegrounds\n              Mercenaries\n\n\nMercenary initial and scaling XP has been reworked.\nMercenary Camp tooltips now indicate which Camps can be Bribed.\n\n\nStructures\n\n\nGate, Tower, Town Hall, and Wall Health reduced by approximately 10%.\n\n\n              Bug Fixes\n              \nFixed a rare issue in which a Core with less than 1 Health could suddenly be destroyed without taking additional damage.\n\n\n            "},{"name":"2015-02-10 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/17906504/heroes-closed-beta-patch-notes-february-10-2015","content":"\n              Battlegrounds\n              General\n\n\nHuman teams can now begin Coop games on either side of the Battleground, rather than only on the left side.\nCollecting various Battleground items (Doubloons, Skulls, Seeds, Regeneration Globes) should now be more responsive.\n\n\nStructures\n\n\nCore\n\nThe Core is now invulnerable until both the Keep and Fort in a single lane are destroyed.\n\nThis is now consistent with the way in which Catapult Minions are spawned.\n\n\nWalls\n\nVision provided by Walls reduced by approximately 15%.\n\n\n\n              Bug Fixes\n              \nBattleground objective units such as Grave Golems, Garden Terrors, and Mercenaries will now become invulnerable while leashing. \n\n\n              \nFixed an issue that could cause Grave Golems to deviate from their intended attack paths (Hotfixed on January 22).Blackheart's Bay, Cursed Hollow, Haunted Mines\n\n\n              \nGrave Golems will now properly ignore Tassadar’s Force Wall.Blackheart's Bay, Cursed Hollow, Haunted Mines\n\n\n              \nGrave Golems, Mercenaries, and Minions will no longer completely ignore Structures affected by Zeratul’s Void Prison.\n\n\n            "},{"name":"2015-01-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/17345414/heroes-closed-beta-patch-notes-january-13-2015","content":"\n              Battlegrounds\n              Structures\n\n\nCore\n\nDamage versus Heroes increased by 20%\nAbathur’s Symbiote and Tassadar’s Plasma Shield can once again be cast on the Core.\n\nTowers\n\nThe amount of time that towers are disabled while regenerating ammunition has been increased from 20 to 30 seconds.\n\nThis was done to align with a previous change, in which the rate of tower ammo regeneration was reduced to 1 per 15 seconds. As such, towers will now come back online with 2 ammunition.\n\n\n\n\nMercenaries\n\n\nGrave Golem\n\nRoot\n\nGrave Golems will no longer pause when casting Root.\nRoot will now be cast on ranged Minions.\nHeroic units will remain the preferred targets.\n\nStomp\n\nThe post-cast delay on Stomp has been removed.\nStomp will now be cast when there are at least 2 Heroic units around the Grave Golem, or at least 3 Minions.\nStomp will not be cast unless the Grave Golem is already stationary.\nStomp now deals increased damage versus Minions.\n\n\n\n\n              Bug Fixes\n              \nCatapult Minions no longer deal half their intended damage, and once again deal area of effect damage around their target.\n\n\n              \nThe Burning Rage Talent no longer deals double damage to towers affected by the Raven Lord’s Curse on the Cursed Hollow Battleground.\n\n\n            "},{"name":"2014-12-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/16467431/heroes-technical-alpha-patch-notes-december-2-2014","content":"\n              Battleground Updates\n              \nTribute channeling time reduced from 7 to 6 seconds\n\n\n              Battlegrounds\n              General\n\n\nTown Halls no longer contain all of a town’s experience points. While Town Halls retain a majority of the experience, the surrounding towers protecting the town now yield experience as well.\n\n\n              Bug Fixes\n              \nHeroes can no longer be affected by enemy abilities while within the allied Hall of Storms.\n\n\n            "},{"name":"2014-10-07 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/16081848/heroes-technical-alpha-patch-notes-oct-7-2014","content":"\n              Battlegrounds\n              General\n\n\nMinimap icons for the underground Grave Golem on the Haunted Mines, and neutral Garden Terrors on the Garden of Terror, no longer blink when they are in combat\nMinion damage dealt to opposing Minions has been reduced, allowing for stronger pushes with Minions in unattended lanes\n\n\n              Mercenary Camps\n\n\nKnight Mercenary Camp\n\nThe Healer Mercenary no longer heals other Mercenaries or Minions, and now casts a damaging Arcane Bolt on enemies instead.\n\n\n\nStructures\n\n\nThe Core now regenerates Shields after it has not taken damage for 8 seconds, rather than 10 seconds.\nTowers, Forts, and Keeps now regenerate Ammunition once every 15 seconds, rather than once every 10 seconds.\n\n\n              Bug Fixes\n              \nAttacking a Mercenary Camp at the moment it spawns will no longer cause the defending Mercenaries’ Health to reset mid-fight.\n\n\n            "},{"name":"2014-09-10 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/15787795/heroes-technical-alpha-patch-notes-sept-10-2014","content":"\n              Battlegrounds\n              Core\n\n\nHealth Regeneration has been removed from the Core, but Shield regeneration is unchanged.\n\n\nSiege Giants\n\n\nHealth regeneration when Siege Giants are out of combat for 8 or more seconds has been removed.\n\n\n              Bug Fixes\n              \nCorrected an issue in which Towers could unintentionally see through certain Line of Sight blockers.\n\n\n              \nForts and Keeps will no longer expend ammo without firing when a player quickly moves in and out of range.\n\n\n              \nMercenary Camps that are captured simultaneously by one team with the Mercenary Lord Talent, and one without, no longer causes the Mercenaries from both Camps to gain the Mercenary Lord buff.\n\n\n              \nPings issued on Mercenary Camps no longer require the player to target an individual Mercenary in order to request assistance with capturing the Camp.\n\n\n            "},{"name":"2014-07-23 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14742016/heroes-technical-alpha-patch-notes-july-23-2014","content":"\n              Design & Gameplay\n              General\n\n\nThe amount of in-game experience required to reach levels 2-19 has been increased by approximately 6%.\n\n\nUnderdog Bonus\n\n\nThe amount of XP received from Hero takedowns is now more granular.\nThis will now have less impact during close games.\n\n\n              Battlegrounds\n              Core\n\n\nHealth now scales throughout the game.\nSplash damage radius increased from 1.5 to 2.\n\n\n            "},{"name":"2014-06-25 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14537490/heroes-technical-alpha-patch-notes-june-25-2014","content":"\n              General\n              Experience and Snowballing\n\n\nExperience earned by killing Minions in-lane has been increased by 20%.\nBonus trickle experience granted to a team that is behind by 3 or more levels during a game has been removed.\nEarly implementation for the “Underdog Bonus” has been added.\n\nA team that is behind in levels – the “underdog” – now earns bonus XP whenever an enemy hero is killed, while a team that is ahead in levels receives reduced XP for killing enemy heroes.\nThe amount of bonus takedown XP granted to the underdog team, as well as reduced takedown XP for the team that’s ahead, scale significantly up based on the level difference between teams.\nThe Underdog Bonus starts at a 1 level difference, and caps off at a 4 level gap.\nThe Underdog Bonus continues until team levels become even.\n\nHead here to check out additional details on the Underdog Bonus, as well as reasoning behind why we’re trying out this new system.\n\n\n              Mercenaries\n              General\n\n\nMercenary Camps now scale up to 30 minutes of elapsed game time.\nCaptured Mercenaries now scale up to 60 minutes of elapsed game time.\n\n\nGrave Golem\n\n\nCaptured Mercenary Grave Golems are now roughly equivalent in strength to a 30 Skull Grave Golem on the Haunted Mines.\nMercenary Grave Golems now seek out structures and ignore Heroes, Minions, and Mercenaries in their path.\nMercenary Grave Golems no longer only stomp Minions.\n\nIncreased the number of Heroic targets required for a Mercenary Grave Golem to issue a stomp from 1 to 2.\n\n\n\nKnights\n\n\nSorcerer\n\nNo longer shields other Knights\nDamage aura has been removed\nNow heals other Knights and surrounding minions.\n\n\n\nSiege Giants\n\n\nDefending Siege Giant attacks can no longer be dodged.\n\nSiege Giant Attack Damage has been reduced from 100 to 80 in order to compensate for this change.\n\n\n\n              Bug Fixes\n              \nA number of issues with Mercenary Camp and Minion A.I. have been resolved, and behaviors have been generally improved.\n\n\n              \nAddressed issues which made shrubs that have units within difficult to enter. It is now easier to attack units which are inside a shrub, as well.\n\n\n              \nThe Core’s Health bar no longer displays 0% when it has less than 100 Health remaining.\n\n\n            "},{"name":"2014-05-22 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14227686/heroes-technical-alpha-patch-notes-may-22-2014","content":"\n              Design & Gameplay\n              Snowballing\n\n\nAdditional efforts have been made to prevent snowballing for teams that are down by 3 or more levels during a game.\n\n\nGeneral\n\n\nThe team level cap has been increased from 25 to 30\n\n\n              Battleground Updates\n              \nThe Curse mechanic on this map was a major contributor to snowballing\nTo reduce the snowballing on this Battleground the Curse no longer reduces building health by 50% when the Curse is active\n\n\n              Battlegrounds\n              General\n\n\nThe Grave Golem’s root ability now prioritizes MULEs\nKnight Mercenary Camp respawn time has been increased from 240 to 270 seconds\n\n\n              Bug Fixes\n              \nCombat sounds and effects are no longer audible, nor visible, through the Fog of War.\n\n\n              \nHeroes should no longer attempt to path through enemy Gates when given a long-distance move command toward objectives on the opposite side of a Battleground.\n\n\n            "}],"hauntedmines":[{"name":"2016-09-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20243513/heroes-of-the-storm-patch-notes-september-13-2016","content":"\n              Design & Gameplay\n              Mounts\n\n\nMovement Speed reduced from 40 to 30%\n\n\nRegeneration Globes\n\n\nTime before Globes despawn reduced from 8 to 6 seconds\n\n\n              Battlegrounds\n              Mercenaries\n\n\nTiming Changes\n\nPreviously all Mercenary camps spawned at 120 seconds. The following adjustments have been made to spawn times:\n\n90 seconds: Sappers, Doubloon Pirates\n120 seconds: Siege Giants (unchanged), Impalers (unchanged)\n150 seconds: Knights, Fallen Shaman\n180 seconds: Grave Golem (unchanged)\n300 seconds: Headless Horseman (unchanged)\n\n\nCaptured Mercenaries will no longer grant Experience when killed.\n\n\n\n  Developer Comments: We started playtesting with staggered Mercenary\n  Camp spawn times, and quickly began to realize that it added more strategic\n  depth to the game, and coincided with some of our Battleground events. We have\n  been happy with the changes overall, and are listening to any feedback you may\n  have!\n\n\n              Bug Fixes\n              \nHeroes can no longer push captured Mercenaries by walking into them.\n\n\n            "},{"name":"2016-08-09 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20212896/heroes-of-the-storm-patch-notes-august-9-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer push Neutral and Enemy Mercenaries by walking into them.\n\n\n            "},{"name":"2016-07-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20184555/heroes-of-the-storm-balance-update-july-27-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer be pushed by walking another Hero into them. \n\n\n              \nCollision: Heroes who are channeling an Ability can no longer be pushed when another Hero walks into them during the channel. \n\n\n            "},{"name":"2016-07-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20164442/heroes-of-the-storm-patch-notes-july-12-2016","content":"\n              Design & Gameplay\n              Core\n\n\nVictory determination is now much more precise in situations where both Cores are destroyed within fractions of a second. As a result, Victory will no longer be decided at random in cases where it appears that both Cores are destroyed at the same moment.\n\n\nRegeneration Globes\n\n\nHealth Regeneration\n\nPreviously: Restore 6.24% of maximum Health over 4 seconds\nNow: Restore 12% of maximum Health over 5 seconds\n\nMana Regeneration\n\nPreviously: Restore 32 Mana over 4 seconds.\nNow: Restore 8% of maximum Mana over 5 seconds\n\n\n\n\n  Developer Comments: Thank you for all your discussion and feedback on\n  our recent Health sustain post! We are still heavily evaluating a lot of it\n  but wanted to get the first round of changes in. Internally, we enjoyed the\n  increased importance on Regeneration Globes and have cleaned up the system a\n  bit. With a larger importance, denying enemies their Globes in lane has a much\n  larger impact.\n\n\nHealing Wells\n\n\nCooldown increased from 100 to 120 seconds\nHealth Regeneration\n\nPreviously: Restore 41% of maximum Health over 20 seconds.\nNow: Restore 40% of maximum Health over 20 seconds.\n\nMana Regeneration\n\nPreviously: Restore 20% of maximum Mana over 20 seconds.\nNow: Restore 30% of maximum Mana over 20 seconds.\n\n\n\n\n  Developer Comments: Much like the changes to Regeneration Globes, we\n  wanted to add a larger impact to the moment you click a Healing Well. Again,\n  we cleaned up the system a fair bit (hence the ~41% to 40% Health change) and\n  added a larger impact for heavy Mana users. The increased cooldown should make\n  the decision of when to tap the Healing Well slightly more interesting.\n\n\nMinions\n\n\nRanged, Melee, and Wizard Minions\n\nNow deal an additional 50% damage to Structures.\n\n\n\n\n  Developer Comments: Our goal with this change is to make escorting\n  Minions to Towns to be more impactful, such that they can really start to do\n  some damage if left unattended. Before this change, Minions were primarily XP\n  carriers that absorbed some Ammo shots from Towers. Now the armies of the\n  Nexus are a bit scarier when they march down a lane.\n\n\n\nCatapult Minions\n\nAttack range increased by 20%.\nSight range increased by 17%.\nWill now fixate on Structures. Catapults will not acquire a new target after fixating until the target is destroyed or the Catapult is killed.\n\n\n\n\n  Developer Comments: Catapults would often reach the Core, but have a\n  Minion wave spawn on them, distract them, and allow them to be killed off\n  before doing any significant damage. With increased range and fixation on a\n  Structure once they’ve started attacking, even one Catapult will more\n  consistently punch through a Core’s Shield and do actual damage.\n\n\n            "},{"name":"2016-05-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20120032/heroes-of-the-storm-patch-notes-may-17-2016","content":"\n              Battlegrounds\n              Healing Well\n\n\n25% of a Healing Well’s maximum Health has been converted into a Shield. Shield Regeneration delay of 8 seconds.\n\n\n\n  Developer Comments: We’ve noticed some rather un-fun behavior in the\n  form of sniping Healing Wells over time using very long range Abilities. While\n  we’re okay with players doing this to a degree, we found it was too effective\n  given how little counterplay there was. To help solve this, turned a sizable\n  portion of Healing Well Health into a Shield. This means that if you offer\n  your Healing Well some respite from enemy attacks by chasing opponents away\n  every now and then, it will start to regenerate some of that Shield. Only\n  you can protect Healing Wells from those pesky Arcane Orbs!\n\n\n              Bug Fixes\n              \nFixed an issue in which attacking enemy Walls at certain angles would cause the Hero’s Basic Attack animation to play, but deal no damage.\n\n\n            "},{"name":"2016-04-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20102776/heroes-of-the-storm-balance-update-notes-april-27-2016","content":"\n              Bug Fixes\n              \nIssuing a Mount command while holding down the right mouse button to move will no longer interrupt Mount channeling.\n\n\n            "},{"name":"2016-04-19 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20099322/heroes-of-the-storm-patch-notes-april-19-2016","content":"\n              Bug Fixes\n              \nRe-issuing an attack order on a Structure in the Fog of War will no longer cause Basic Attack animations to repeat without applying damage.\n\n\n            "},{"name":"2016-03-01 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20049139/heroes-of-the-storm-patch-notes-march-1-2016","content":"\n              Bug Fixes\n              \nTowers will now properly fire Ammo provided by an allied M.U.L.E. immediately after 2 Ammo has been restored.\n\n\n            "},{"name":"2016-02-10 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20008204/heroes-of-the-storm-balance-update-notes-february-10-2016","content":"\n              Bug Fixes\n              \nDying will no longer cause the player’s Healing Well cooldown to reset.\n\n\n            "},{"name":"2016-02-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19995509/heroes-of-the-storm-patch-notes-february-2-2016","content":"\n              Design & Gameplay\n              Battleground Monsters\n\n\nBattleground-specific creatures are now universally defined as Monsters (ex: Neutral Garden Terrors, Sky Temple Guardians, etc.)\nSeveral Talents and Abilities have been changed to reflect this new categorization, and the following no longer affect Monsters:\n\nMercenary Lord\nJohanna's Knight Takes Pawn\nLunara's Cruel Bloom\nRexxar's Easy Prey and Bird of Prey\nThe Butcher's Chop Meat\n\nThe following now affect Monsters:\n\nAnub'arak's Beetle, Juiced\nAzmodan's Demonic Smite\n\nSeveral Talents that could previously trigger against both captured Mercenaries and Minions will now only affect Minions (ex: Seasoned Marksman, Black Soulstone, etc.)\n\n\n              Battlegrounds\n              Structures\n\n\nTowers, Forts, and Keeps now deal 50% bonus damage to Heroes\nCores will now display an “Invulnerable” message if attacked by an enemy when no allied Keeps have been destroyed.\nStructures can no longer be made Vulnerable\n\n\n\n  Developer Comments: The scaling changes we released in December made\n  it so Heroes could dive into Structures with impunity during the early game.\n  Increasing the damage that Structures deal to Heroes allows defending players\n  to feel a bit safer. We are exploring other fixes to help Structures feel more\n  meaningful throughout the game and will release them when they are ready.\n\n\n              Bug Fixes\n              \nDiagonally placed shrubs will now properly hide Heroes within them.\n\n\n              \nPlayers punted out of an enemy Hall of Storms will no longer be persistently stunned if an enemy unit blocked the path of the punt.\n\n\n            "},{"name":"2015-12-15 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19981657/heroes-of-the-storm-patch-notes-december-15-2015","content":"\n              Bug Fixes\n              \nDiagonally placed Shrubs will no longer sometimes fail to properly hide a Hero within.\n\n\n            "},{"name":"2015-11-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19960704/heroes-of-the-storm-patch-notes-november-17-2015","content":"\n              Design & Gameplay\n              Scaling Changes\n\n\nHealth and damage scaling for all Heroes, Battleground Events, Minions, and Mercenaries has been changed from flat, additive values to values that are multiplicative by percentage.\nA large portion of Heroes’ total scaling amounts, which were previously gained over the course of a game, have been added to their base values.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: Due to the way that our old level scaling system worked, early game level discrepancies created a larger difference in power level than we liked.  This often led to situations where a team could be up two or more levels early in a game, and use this advantage to create a larger lead.  We didn’t feel that games were fun for the winning or losing team in these types of scenarios.   As a result of these changes, all Heroes will have more power early, but gain less from each level.  Battleground Events, Minions, Mercenaries, and Structures have all been adjusted to compensate for this and should feel close to what they did previously.   The aim of these adjustments to the scaling system is to make level differences have a similar impact on your Hero’s statistics at all points in a game.  Now, each level offers about 4% Health and 4% damage, which mirrors what late game leads felt like in our previous version of the game.  It is important to note, that while being down a few levels will be less punishing than it was previously, Talent tier advantages can and will still have a noticeable impact on enemy engagements.\n\n\nRespawn Timers\n\n\nRespawn timers have been increased for levels 1 – 10.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: In order to reward players for getting early game\n  Takedowns, we’re also increasing the respawn time of dead Heroes at low\n  levels. Now, getting early game Takedowns (and the experience associated with\n  it) won’t give your team as much pure power as it did previously. Instead,\n  early kills will offer a “power play” moment, in which your team can destroy\n  enemy Structures, complete Battleground Events, or take more Mercenaries.\n  These meaningful strategic advantages will position a team closer to victory,\n  without giving them a large stat advantage and the ability to bully the\n  opposing enemy team.\n\n\nAttack Speed Slows\n\n\nAttack speed slows now apply only to Heroes and Summons.\n\n\n              Battleground Updates\n              \nThis Battleground has been removed from all matchmaking queues for the foreseeable future, but is still playable in Custom Games\n\n\n\n  Developer Comments: We’ll be adding Towers of Doom to the map pool in\n  an upcoming patch. This will expand the size of our map pool to 10 total\n  Battlegrounds. To prevent the number of maps we have available to players in\n  Quick Match and Hero League from being overbearing, we’ve decided to\n  temporarily rotate out Haunted Mines. We feel the number of maps we have\n  available are reaching a threshold that we may not be comfortable with.\n\n\n            "},{"name":"2015-10-06 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19893628/heroes-of-the-storm-patch-notes-october-6-2015","content":"\n              Design & Gameplay\n              A.I. Talent Selection\n\n\nA.I. controlled Heroes will now select their Talents from a group of preset Talent builds.\n\n\n\n  Developer Comments: A.I. players will now choose from predetermined\n  Talent builds instead of randomly selecting Talents. This is especially\n  important for players who disconnect as the A.I. will now no longer randomly\n  choose Talents, but instead try to pick builds that are closer to what players\n  would expect. In addition, A.I. controlled Heroes in Versus A.I. games will\n  also have their own Talent builds to choose from.\n\n\nVehicles and Regeneration Globe Interaction\n\n\nRegeneration Globes will no longer heal Dragon Knights and Garden Terrors.\n\nInstead, Regeneration Globe effects will now be applied directly to the Hero inside the Dragon Knight or Garden Terror.\n\nPlayers within a Dragon Knight or Garden Terror can now also accumulate stacks for Talents such as Seasoned Marksman, Gathering Power, Regeneration Master, etc.\n\n\nSummoned Unit Attacks\n\n\nSummoned unit Basic Attacks will now miss if that Summon is Blinded or the target is Evading.\nSummoned unit Basic Attacks will no longer consume Block Talent stacks.\n\n\n              Bug Fixes\n              \nFixed an issue that could allow skulls to spawn outside the playable area in the Haunted Mines.\n\n\n            "},{"name":"2015-06-30 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19803324/heroes-of-the-storm-patch-notes-june-30-2015","content":"\n              Battleground Updates\n              \nPlayers may now use queued movement commands (Shift + Right-click) to enter/exit the Mines, and continue moving on the level they are traveling to.\n\n\n            "},{"name":"2015-05-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19067455/heroes-closed-beta-patch-notes-may-12-2015","content":"\n              Bug Fixes\n              \nAlerts proclaiming that the Core is under attack will no longer play when an enemy Hero is within range of the Core before a Keep has been destroyed.\n\n\n              \nFixed an issue that could cause the neutral Grave Golem in the Haunted Mines to drop Skulls outside the playable area.\n\n\n              \nPlayers will no longer enter an infinite rejoin loop if both Cores are destroyed simultaneously, and victory will be assigned to one team at random.\n\nPlease note: Randomly assigned victory/defeat is intended as a temporary solution, intended to fix the infinite rejoin loop as soon as possible. A more robust solution for games that end in a draw will be implemented with a future patch.\n\n\n\n            "},{"name":"2015-03-24 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/18401781/heroes-closed-beta-patch-notes-march-24-2015","content":"\n              Design & Gameplay\n              General\n\n\nIn-game XP Changes\n\nThe in-game leveling curve has been adjusted slightly to slow down the first 10 team levels, though the amount of XP required to reach level 20 remains the same. \n\n\n\n              Battleground Updates\n              \nGrave Golem Health and damage will no longer scale after either of the following conditions have been met:\n\nThe Haunted Mines have been open for at least 4 minutes\n60 Skulls have been collected\nThis change has been made in order to prevent situations in which a team would leave a single skull in the Haunted Mines in order to gain more Golem power. \n\nThe power difference between Lane Golems has been reduced in situations where there is a large skull-count disparity.\nHigh skull-count Lane Golem Health has been slightly reduced.\nThe first round of Lane Golems have had their Health reduced.\n\n\n              Battlegrounds\n              Mercenaries\n\n\nMercenary initial and scaling XP has been reworked.\nMercenary Camp tooltips now indicate which Camps can be Bribed.\n\n\nStructures\n\n\nGate, Tower, Town Hall, and Wall Health reduced by approximately 10%.\n\n\n              Bug Fixes\n              \nFixed a rare issue in which a Core with less than 1 Health could suddenly be destroyed without taking additional damage.\n\n\n            "},{"name":"2015-02-10 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/17906504/heroes-closed-beta-patch-notes-february-10-2015","content":"\n              Battlegrounds\n              General\n\n\nHuman teams can now begin Coop games on either side of the Battleground, rather than only on the left side.\nCollecting various Battleground items (Doubloons, Skulls, Seeds, Regeneration Globes) should now be more responsive.\n\n\nStructures\n\n\nCore\n\nThe Core is now invulnerable until both the Keep and Fort in a single lane are destroyed.\n\nThis is now consistent with the way in which Catapult Minions are spawned.\n\n\nWalls\n\nVision provided by Walls reduced by approximately 15%.\n\n\n\n              Bug Fixes\n              \nBattleground objective units such as Grave Golems, Garden Terrors, and Mercenaries will now become invulnerable while leashing. \n\n\n              \nFixed a rare issue in which Skulls occasionally spawn outside of the playable area on Haunted Mines.\n\n\n              \nFixed an issue that could cause Grave Golems to deviate from their intended attack paths (Hotfixed on January 22).Blackheart's Bay, Cursed Hollow, Haunted Mines\n\n\n              \nGrave Golems will now properly ignore Tassadar’s Force Wall.Blackheart's Bay, Cursed Hollow, Haunted Mines\n\n\n              \nGrave Golems, Mercenaries, and Minions will no longer completely ignore Structures affected by Zeratul’s Void Prison.\n\n\n            "},{"name":"2015-01-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/17345414/heroes-closed-beta-patch-notes-january-13-2015","content":"\n              Battlegrounds\n              Structures\n\n\nCore\n\nDamage versus Heroes increased by 20%\nAbathur’s Symbiote and Tassadar’s Plasma Shield can once again be cast on the Core.\n\nTowers\n\nThe amount of time that towers are disabled while regenerating ammunition has been increased from 20 to 30 seconds.\n\nThis was done to align with a previous change, in which the rate of tower ammo regeneration was reduced to 1 per 15 seconds. As such, towers will now come back online with 2 ammunition.\n\n\n\n\nMercenaries\n\n\nGrave Golem\n\nRoot\n\nGrave Golems will no longer pause when casting Root.\nRoot will now be cast on ranged Minions.\nHeroic units will remain the preferred targets.\n\nStomp\n\nThe post-cast delay on Stomp has been removed.\nStomp will now be cast when there are at least 2 Heroic units around the Grave Golem, or at least 3 Minions.\nStomp will not be cast unless the Grave Golem is already stationary.\nStomp now deals increased damage versus Minions.\n\n\n\n\n              Bug Fixes\n              \nCatapult Minions no longer deal half their intended damage, and once again deal area of effect damage around their target.\n\n\n              \nFixed an issue in which summoned Grave Golems on the Haunted Mines dealt significantly more damage to Heroes than expected.\n\n\n              \nMuradin’s Haymaker will no longer knock enemies out of the playable area in the Haunted Mines.\n\n\n              \nSummoned Grave Golems on the Haunted Mines now properly ignore summoned units.\n\n\n            "},{"name":"2014-12-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/16467431/heroes-technical-alpha-patch-notes-december-2-2014","content":"\n              Battleground Updates\n              \nUnderground Minions\n\nStarting Health and Health scaling increased by 20%\n\nUnderground Grave Golem\n\nStarting Health and Health scaling increased by 20%\n\nGrave Golem (Summoned)\n\nDamage scaling decreased by 20%\nHealth scaling decreased by 20%\n\n\n\n              Battlegrounds\n              General\n\n\nTown Halls no longer contain all of a town’s experience points. While Town Halls retain a majority of the experience, the surrounding towers protecting the town now yield experience as well.\n\n\n              Bug Fixes\n              \nCorrected a minor area of unintentionally pathable terrain within the Haunted Mines.\n\n\n              \nHeroes can no longer be affected by enemy abilities while within the allied Hall of Storms.\n\n\n            "},{"name":"2014-10-07 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/16081848/heroes-technical-alpha-patch-notes-oct-7-2014","content":"\n              Battlegrounds\n              General\n\n\nMinimap icons for the underground Grave Golem on the Haunted Mines, and neutral Garden Terrors on the Garden of Terror, no longer blink when they are in combat\nMinion damage dealt to opposing Minions has been reduced, allowing for stronger pushes with Minions in unattended lanes\n\n\n              Mercenary Camps\n\n\nKnight Mercenary Camp\n\nThe Healer Mercenary no longer heals other Mercenaries or Minions, and now casts a damaging Arcane Bolt on enemies instead.\n\n\n\nStructures\n\n\nThe Core now regenerates Shields after it has not taken damage for 8 seconds, rather than 10 seconds.\nTowers, Forts, and Keeps now regenerate Ammunition once every 15 seconds, rather than once every 10 seconds.\n\n\n              Bug Fixes\n              \nAttacking a Mercenary Camp at the moment it spawns will no longer cause the defending Mercenaries’ Health to reset mid-fight.\n\n\n            "},{"name":"2014-09-10 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/15787795/heroes-technical-alpha-patch-notes-sept-10-2014","content":"\n              Battleground Updates\n              \nThis Battleground has received significant updates.\n\nThe underground mines have been reduced in size and received layout changes, which will allow the mines to be cleared more quickly.\nSkull collection has changed:\n\nThe underground mines now contain 35 Skeletons, each of which drop 2 Skulls upon death.\nThe Grave Golem in the underground mines now drops 30 skulls.\n\nMercenary Camp count reduced from 5 to 3.\n\nMerc Camps include two Siege Giant Camps and one Knight Camp.\nMercenaries captured by a team now only attack down the lane opposite from that team's Grave Golem.\n\nThe Haunted Mines Battleground page has been updated to reflect all of the layout changes included in today's patch.\n\n\n\n              Battlegrounds\n              Core\n\n\nHealth Regeneration has been removed from the Core, but Shield regeneration is unchanged.\n\n\nSiege Giants\n\n\nHealth regeneration when Siege Giants are out of combat for 8 or more seconds has been removed.\n\n\n              Bug Fixes\n              \nCorrected an issue in which Towers could unintentionally see through certain Line of Sight blockers.\n\n\n              \nForts and Keeps will no longer expend ammo without firing when a player quickly moves in and out of range.\n\n\n              \nMercenary Camps that are captured simultaneously by one team with the Mercenary Lord Talent, and one without, no longer causes the Mercenaries from both Camps to gain the Mercenary Lord buff.\n\n\n              \nMounted Heroes on the Haunted Mines Battleground will no longer automatically dismount and attack enemy minions when exiting the underground mines.\n\n\n              \nPings issued on Mercenary Camps no longer require the player to target an individual Mercenary in order to request assistance with capturing the Camp.\n\n\n            "},{"name":"2014-07-23 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14742016/heroes-technical-alpha-patch-notes-july-23-2014","content":"\n              Design & Gameplay\n              General\n\n\nThe amount of in-game experience required to reach levels 2-19 has been increased by approximately 6%.\n\n\nUnderdog Bonus\n\n\nThe amount of XP received from Hero takedowns is now more granular.\nThis will now have less impact during close games.\n\n\n              Battlegrounds\n              Core\n\n\nHealth now scales throughout the game.\nSplash damage radius increased from 1.5 to 2.\n\n\n            "},{"name":"2014-06-25 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14537490/heroes-technical-alpha-patch-notes-june-25-2014","content":"\n              General\n              Experience and Snowballing\n\n\nExperience earned by killing Minions in-lane has been increased by 20%.\nBonus trickle experience granted to a team that is behind by 3 or more levels during a game has been removed.\nEarly implementation for the “Underdog Bonus” has been added.\n\nA team that is behind in levels – the “underdog” – now earns bonus XP whenever an enemy hero is killed, while a team that is ahead in levels receives reduced XP for killing enemy heroes.\nThe amount of bonus takedown XP granted to the underdog team, as well as reduced takedown XP for the team that’s ahead, scale significantly up based on the level difference between teams.\nThe Underdog Bonus starts at a 1 level difference, and caps off at a 4 level gap.\nThe Underdog Bonus continues until team levels become even.\n\nHead here to check out additional details on the Underdog Bonus, as well as reasoning behind why we’re trying out this new system.\n\n\n              Mercenaries\n              General\n\n\nMercenary Camps now scale up to 30 minutes of elapsed game time.\nCaptured Mercenaries now scale up to 60 minutes of elapsed game time.\n\n\nGrave Golem\n\n\nCaptured Mercenary Grave Golems are now roughly equivalent in strength to a 30 Skull Grave Golem on the Haunted Mines.\nMercenary Grave Golems now seek out structures and ignore Heroes, Minions, and Mercenaries in their path.\nMercenary Grave Golems no longer only stomp Minions.\n\nIncreased the number of Heroic targets required for a Mercenary Grave Golem to issue a stomp from 1 to 2.\n\n\n\nKnights\n\n\nSorcerer\n\nNo longer shields other Knights\nDamage aura has been removed\nNow heals other Knights and surrounding minions.\n\n\n\nSiege Giants\n\n\nDefending Siege Giant attacks can no longer be dodged.\n\nSiege Giant Attack Damage has been reduced from 100 to 80 in order to compensate for this change.\n\n\n\n              Bug Fixes\n              \nA number of issues with Mercenary Camp and Minion A.I. have been resolved, and behaviors have been generally improved.\n\n\n              \nAddressed issues which made shrubs that have units within difficult to enter. It is now easier to attack units which are inside a shrub, as well.\n\n\n              \nThe Core’s Health bar no longer displays 0% when it has less than 100 Health remaining.\n\n\n            "},{"name":"2014-05-22 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/14227686/heroes-technical-alpha-patch-notes-may-22-2014","content":"\n              Design & Gameplay\n              Snowballing\n\n\nAdditional efforts have been made to prevent snowballing for teams that are down by 3 or more levels during a game.\n\n\nGeneral\n\n\nThe team level cap has been increased from 25 to 30\n\n\n              Battleground Updates\n              \nThere have been significant layout changes to the jungle area of this map, including mercenary camp locations\nTwo Watch Towers have also been added to the jungle\nSkeletons and the golem no long auto-acquire you; you have to engage them first now\n\n\n              Battlegrounds\n              General\n\n\nThe Grave Golem’s root ability now prioritizes MULEs\nKnight Mercenary Camp respawn time has been increased from 240 to 270 seconds\n\n\n              Bug Fixes\n              \nCombat sounds and effects are no longer audible, nor visible, through the Fog of War.\n\n\n              \nHeroes should no longer attempt to path through enemy Gates when given a long-distance move command toward objectives on the opposite side of a Battleground.\n\n\n            "},{"name":"2014-04-15 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/13789932/heroes-technical-alpha-patch-notes-april-15-2014","content":"\n              Battleground Updates\n              \nScaling Health for the underground Grave Golem increased from 625 to 750 per minute.\n\n\n            "}],"lostcavern":[{"name":"2016-09-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20243513/heroes-of-the-storm-patch-notes-september-13-2016","content":"\n              Design & Gameplay\n              Mounts\n\n\nMovement Speed reduced from 40 to 30%\n\n\nRegeneration Globes\n\n\nTime before Globes despawn reduced from 8 to 6 seconds\n\n\n              Battlegrounds\n              Mercenaries\n\n\nTiming Changes\n\nPreviously all Mercenary camps spawned at 120 seconds. The following adjustments have been made to spawn times:\n\n90 seconds: Sappers, Doubloon Pirates\n120 seconds: Siege Giants (unchanged), Impalers (unchanged)\n150 seconds: Knights, Fallen Shaman\n180 seconds: Grave Golem (unchanged)\n300 seconds: Headless Horseman (unchanged)\n\n\nCaptured Mercenaries will no longer grant Experience when killed.\n\n\n\n  Developer Comments: We started playtesting with staggered Mercenary\n  Camp spawn times, and quickly began to realize that it added more strategic\n  depth to the game, and coincided with some of our Battleground events. We have\n  been happy with the changes overall, and are listening to any feedback you may\n  have!\n\n\n              Bug Fixes\n              \nHeroes can no longer push captured Mercenaries by walking into them.\n\n\n            "},{"name":"2016-08-09 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20212896/heroes-of-the-storm-patch-notes-august-9-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer push Neutral and Enemy Mercenaries by walking into them.\n\n\n            "},{"name":"2016-07-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20184555/heroes-of-the-storm-balance-update-july-27-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer be pushed by walking another Hero into them. \n\n\n              \nCollision: Heroes who are channeling an Ability can no longer be pushed when another Hero walks into them during the channel. \n\n\n            "},{"name":"2016-07-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20164442/heroes-of-the-storm-patch-notes-july-12-2016","content":"\n              Design & Gameplay\n              Core\n\n\nVictory determination is now much more precise in situations where both Cores are destroyed within fractions of a second. As a result, Victory will no longer be decided at random in cases where it appears that both Cores are destroyed at the same moment.\n\n\nRegeneration Globes\n\n\nHealth Regeneration\n\nPreviously: Restore 6.24% of maximum Health over 4 seconds\nNow: Restore 12% of maximum Health over 5 seconds\n\nMana Regeneration\n\nPreviously: Restore 32 Mana over 4 seconds.\nNow: Restore 8% of maximum Mana over 5 seconds\n\n\n\n\n  Developer Comments: Thank you for all your discussion and feedback on\n  our recent Health sustain post! We are still heavily evaluating a lot of it\n  but wanted to get the first round of changes in. Internally, we enjoyed the\n  increased importance on Regeneration Globes and have cleaned up the system a\n  bit. With a larger importance, denying enemies their Globes in lane has a much\n  larger impact.\n\n\nHealing Wells\n\n\nCooldown increased from 100 to 120 seconds\nHealth Regeneration\n\nPreviously: Restore 41% of maximum Health over 20 seconds.\nNow: Restore 40% of maximum Health over 20 seconds.\n\nMana Regeneration\n\nPreviously: Restore 20% of maximum Mana over 20 seconds.\nNow: Restore 30% of maximum Mana over 20 seconds.\n\n\n\n\n  Developer Comments: Much like the changes to Regeneration Globes, we\n  wanted to add a larger impact to the moment you click a Healing Well. Again,\n  we cleaned up the system a fair bit (hence the ~41% to 40% Health change) and\n  added a larger impact for heavy Mana users. The increased cooldown should make\n  the decision of when to tap the Healing Well slightly more interesting.\n\n\nMinions\n\n\nRanged, Melee, and Wizard Minions\n\nNow deal an additional 50% damage to Structures.\n\n\n\n\n  Developer Comments: Our goal with this change is to make escorting\n  Minions to Towns to be more impactful, such that they can really start to do\n  some damage if left unattended. Before this change, Minions were primarily XP\n  carriers that absorbed some Ammo shots from Towers. Now the armies of the\n  Nexus are a bit scarier when they march down a lane.\n\n\n\nCatapult Minions\n\nAttack range increased by 20%.\nSight range increased by 17%.\nWill now fixate on Structures. Catapults will not acquire a new target after fixating until the target is destroyed or the Catapult is killed.\n\n\n\n\n  Developer Comments: Catapults would often reach the Core, but have a\n  Minion wave spawn on them, distract them, and allow them to be killed off\n  before doing any significant damage. With increased range and fixation on a\n  Structure once they’ve started attacking, even one Catapult will more\n  consistently punch through a Core’s Shield and do actual damage.\n\n\n            "},{"name":"2016-05-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20120032/heroes-of-the-storm-patch-notes-may-17-2016","content":"\n              Battlegrounds\n              Healing Well\n\n\n25% of a Healing Well’s maximum Health has been converted into a Shield. Shield Regeneration delay of 8 seconds.\n\n\n\n  Developer Comments: We’ve noticed some rather un-fun behavior in the\n  form of sniping Healing Wells over time using very long range Abilities. While\n  we’re okay with players doing this to a degree, we found it was too effective\n  given how little counterplay there was. To help solve this, turned a sizable\n  portion of Healing Well Health into a Shield. This means that if you offer\n  your Healing Well some respite from enemy attacks by chasing opponents away\n  every now and then, it will start to regenerate some of that Shield. Only\n  you can protect Healing Wells from those pesky Arcane Orbs!\n\n\n              Bug Fixes\n              \nFixed an issue in which attacking enemy Walls at certain angles would cause the Hero’s Basic Attack animation to play, but deal no damage.\n\n\n            "},{"name":"2016-04-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20102776/heroes-of-the-storm-balance-update-notes-april-27-2016","content":"\n              Bug Fixes\n              \nIssuing a Mount command while holding down the right mouse button to move will no longer interrupt Mount channeling.\n\n\n            "},{"name":"2016-04-19 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20099322/heroes-of-the-storm-patch-notes-april-19-2016","content":"\n              Bug Fixes\n              \nRe-issuing an attack order on a Structure in the Fog of War will no longer cause Basic Attack animations to repeat without applying damage.\n\n\n            "},{"name":"2016-03-29 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20063493/heroes-of-the-storm-patch-notes-march-29-2016","content":"\n              Battleground Updates\n              Lost Cavern, a new Battleground featuring just one lane —and a whole lot of team fighting— is now available for play exclusively in Custom Games!\n\n\nLost Cavern has no Mercenary Camps, and just one objective: Battle through the opposing Fort, Keep, and Core to claim victory.\nPlayers cannot use Hearthstone and will not heal at the allied Hall of Storms.\nCorridors on either side of the lane contain neutral Regeneration Globes, which will respawn regularly throughout the game.\nCheck out our recent blog to learn more about Lost Cavern. \n\n\n            "}],"skytemple":[{"name":"2016-09-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20243513/heroes-of-the-storm-patch-notes-september-13-2016","content":"\n              Design & Gameplay\n              Mounts\n\n\nMovement Speed reduced from 40 to 30%\n\n\nRegeneration Globes\n\n\nTime before Globes despawn reduced from 8 to 6 seconds\n\n\n              Battlegrounds\n              Mercenaries\n\n\nTiming Changes\n\nPreviously all Mercenary camps spawned at 120 seconds. The following adjustments have been made to spawn times:\n\n90 seconds: Sappers, Doubloon Pirates\n120 seconds: Siege Giants (unchanged), Impalers (unchanged)\n150 seconds: Knights, Fallen Shaman\n180 seconds: Grave Golem (unchanged)\n300 seconds: Headless Horseman (unchanged)\n\n\nCaptured Mercenaries will no longer grant Experience when killed.\n\n\n\n  Developer Comments: We started playtesting with staggered Mercenary\n  Camp spawn times, and quickly began to realize that it added more strategic\n  depth to the game, and coincided with some of our Battleground events. We have\n  been happy with the changes overall, and are listening to any feedback you may\n  have!\n\n\n              Bug Fixes\n              \nHeroes can no longer push captured Mercenaries by walking into them.\n\n\n            "},{"name":"2016-08-09 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20212896/heroes-of-the-storm-patch-notes-august-9-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer push Neutral and Enemy Mercenaries by walking into them.\n\n\n            "},{"name":"2016-07-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20184555/heroes-of-the-storm-balance-update-july-27-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer be pushed by walking another Hero into them. \n\n\n              \nCollision: Heroes who are channeling an Ability can no longer be pushed when another Hero walks into them during the channel. \n\n\n            "},{"name":"2016-07-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20164442/heroes-of-the-storm-patch-notes-july-12-2016","content":"\n              Design & Gameplay\n              Core\n\n\nVictory determination is now much more precise in situations where both Cores are destroyed within fractions of a second. As a result, Victory will no longer be decided at random in cases where it appears that both Cores are destroyed at the same moment.\n\n\nRegeneration Globes\n\n\nHealth Regeneration\n\nPreviously: Restore 6.24% of maximum Health over 4 seconds\nNow: Restore 12% of maximum Health over 5 seconds\n\nMana Regeneration\n\nPreviously: Restore 32 Mana over 4 seconds.\nNow: Restore 8% of maximum Mana over 5 seconds\n\n\n\n\n  Developer Comments: Thank you for all your discussion and feedback on\n  our recent Health sustain post! We are still heavily evaluating a lot of it\n  but wanted to get the first round of changes in. Internally, we enjoyed the\n  increased importance on Regeneration Globes and have cleaned up the system a\n  bit. With a larger importance, denying enemies their Globes in lane has a much\n  larger impact.\n\n\nHealing Wells\n\n\nCooldown increased from 100 to 120 seconds\nHealth Regeneration\n\nPreviously: Restore 41% of maximum Health over 20 seconds.\nNow: Restore 40% of maximum Health over 20 seconds.\n\nMana Regeneration\n\nPreviously: Restore 20% of maximum Mana over 20 seconds.\nNow: Restore 30% of maximum Mana over 20 seconds.\n\n\n\n\n  Developer Comments: Much like the changes to Regeneration Globes, we\n  wanted to add a larger impact to the moment you click a Healing Well. Again,\n  we cleaned up the system a fair bit (hence the ~41% to 40% Health change) and\n  added a larger impact for heavy Mana users. The increased cooldown should make\n  the decision of when to tap the Healing Well slightly more interesting.\n\n\nMinions\n\n\nRanged, Melee, and Wizard Minions\n\nNow deal an additional 50% damage to Structures.\n\n\n\n\n  Developer Comments: Our goal with this change is to make escorting\n  Minions to Towns to be more impactful, such that they can really start to do\n  some damage if left unattended. Before this change, Minions were primarily XP\n  carriers that absorbed some Ammo shots from Towers. Now the armies of the\n  Nexus are a bit scarier when they march down a lane.\n\n\n\nCatapult Minions\n\nAttack range increased by 20%.\nSight range increased by 17%.\nWill now fixate on Structures. Catapults will not acquire a new target after fixating until the target is destroyed or the Catapult is killed.\n\n\n\n\n  Developer Comments: Catapults would often reach the Core, but have a\n  Minion wave spawn on them, distract them, and allow them to be killed off\n  before doing any significant damage. With increased range and fixation on a\n  Structure once they’ve started attacking, even one Catapult will more\n  consistently punch through a Core’s Shield and do actual damage.\n\n\n            "},{"name":"2016-05-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20120032/heroes-of-the-storm-patch-notes-may-17-2016","content":"\n              Battlegrounds\n              Healing Well\n\n\n25% of a Healing Well’s maximum Health has been converted into a Shield. Shield Regeneration delay of 8 seconds.\n\n\n\n  Developer Comments: We’ve noticed some rather un-fun behavior in the\n  form of sniping Healing Wells over time using very long range Abilities. While\n  we’re okay with players doing this to a degree, we found it was too effective\n  given how little counterplay there was. To help solve this, turned a sizable\n  portion of Healing Well Health into a Shield. This means that if you offer\n  your Healing Well some respite from enemy attacks by chasing opponents away\n  every now and then, it will start to regenerate some of that Shield. Only\n  you can protect Healing Wells from those pesky Arcane Orbs!\n\n\n              Bug Fixes\n              \nFixed an issue in which attacking enemy Walls at certain angles would cause the Hero’s Basic Attack animation to play, but deal no damage.\n\n\n            "},{"name":"2016-04-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20102776/heroes-of-the-storm-balance-update-notes-april-27-2016","content":"\n              Bug Fixes\n              \nIssuing a Mount command while holding down the right mouse button to move will no longer interrupt Mount channeling.\n\n\n            "},{"name":"2016-04-19 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20099322/heroes-of-the-storm-patch-notes-april-19-2016","content":"\n              Bug Fixes\n              \nRe-issuing an attack order on a Structure in the Fog of War will no longer cause Basic Attack animations to repeat without applying damage.\n\n\n            "},{"name":"2016-03-01 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20049139/heroes-of-the-storm-patch-notes-march-1-2016","content":"\n              Bug Fixes\n              \nTowers will now properly fire Ammo provided by an allied M.U.L.E. immediately after 2 Ammo has been restored.\n\n\n            "},{"name":"2016-02-10 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20008204/heroes-of-the-storm-balance-update-notes-february-10-2016","content":"\n              Bug Fixes\n              \nDying will no longer cause the player’s Healing Well cooldown to reset.\n\n\n            "},{"name":"2016-02-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19995509/heroes-of-the-storm-patch-notes-february-2-2016","content":"\n              Design & Gameplay\n              Battleground Monsters\n\n\nBattleground-specific creatures are now universally defined as Monsters (ex: Neutral Garden Terrors, Sky Temple Guardians, etc.)\nSeveral Talents and Abilities have been changed to reflect this new categorization, and the following no longer affect Monsters:\n\nMercenary Lord\nJohanna's Knight Takes Pawn\nLunara's Cruel Bloom\nRexxar's Easy Prey and Bird of Prey\nThe Butcher's Chop Meat\n\nThe following now affect Monsters:\n\nAnub'arak's Beetle, Juiced\nAzmodan's Demonic Smite\n\nSeveral Talents that could previously trigger against both captured Mercenaries and Minions will now only affect Minions (ex: Seasoned Marksman, Black Soulstone, etc.)\n\n\n              Battlegrounds\n              Structures\n\n\nTowers, Forts, and Keeps now deal 50% bonus damage to Heroes\nCores will now display an “Invulnerable” message if attacked by an enemy when no allied Keeps have been destroyed.\nStructures can no longer be made Vulnerable\n\n\n\n  Developer Comments: The scaling changes we released in December made\n  it so Heroes could dive into Structures with impunity during the early game.\n  Increasing the damage that Structures deal to Heroes allows defending players\n  to feel a bit safer. We are exploring other fixes to help Structures feel more\n  meaningful throughout the game and will release them when they are ready.\n\n\n              Bug Fixes\n              \nDiagonally placed shrubs will now properly hide Heroes within them.\n\n\n              \nPlayers punted out of an enemy Hall of Storms will no longer be persistently stunned if an enemy unit blocked the path of the punt.\n\n\n            "},{"name":"2015-12-15 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19981657/heroes-of-the-storm-patch-notes-december-15-2015","content":"\n              Bug Fixes\n              \nDiagonally placed Shrubs will no longer sometimes fail to properly hide a Hero within.\n\n\n            "},{"name":"2015-11-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19960704/heroes-of-the-storm-patch-notes-november-17-2015","content":"\n              Design & Gameplay\n              Scaling Changes\n\n\nHealth and damage scaling for all Heroes, Battleground Events, Minions, and Mercenaries has been changed from flat, additive values to values that are multiplicative by percentage.\nA large portion of Heroes’ total scaling amounts, which were previously gained over the course of a game, have been added to their base values.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: Due to the way that our old level scaling system worked, early game level discrepancies created a larger difference in power level than we liked.  This often led to situations where a team could be up two or more levels early in a game, and use this advantage to create a larger lead.  We didn’t feel that games were fun for the winning or losing team in these types of scenarios.   As a result of these changes, all Heroes will have more power early, but gain less from each level.  Battleground Events, Minions, Mercenaries, and Structures have all been adjusted to compensate for this and should feel close to what they did previously.   The aim of these adjustments to the scaling system is to make level differences have a similar impact on your Hero’s statistics at all points in a game.  Now, each level offers about 4% Health and 4% damage, which mirrors what late game leads felt like in our previous version of the game.  It is important to note, that while being down a few levels will be less punishing than it was previously, Talent tier advantages can and will still have a noticeable impact on enemy engagements.\n\n\nRespawn Timers\n\n\nRespawn timers have been increased for levels 1 – 10.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: In order to reward players for getting early game\n  Takedowns, we’re also increasing the respawn time of dead Heroes at low\n  levels. Now, getting early game Takedowns (and the experience associated with\n  it) won’t give your team as much pure power as it did previously. Instead,\n  early kills will offer a “power play” moment, in which your team can destroy\n  enemy Structures, complete Battleground Events, or take more Mercenaries.\n  These meaningful strategic advantages will position a team closer to victory,\n  without giving them a large stat advantage and the ability to bully the\n  opposing enemy team.\n\n\nAttack Speed Slows\n\n\nAttack speed slows now apply only to Heroes and Summons.\n\n\n            "},{"name":"2015-10-06 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19893628/heroes-of-the-storm-patch-notes-october-6-2015","content":"\n              Design & Gameplay\n              A.I. Talent Selection\n\n\nA.I. controlled Heroes will now select their Talents from a group of preset Talent builds.\n\n\n\n  Developer Comments: A.I. players will now choose from predetermined\n  Talent builds instead of randomly selecting Talents. This is especially\n  important for players who disconnect as the A.I. will now no longer randomly\n  choose Talents, but instead try to pick builds that are closer to what players\n  would expect. In addition, A.I. controlled Heroes in Versus A.I. games will\n  also have their own Talent builds to choose from.\n\n\nVehicles and Regeneration Globe Interaction\n\n\nRegeneration Globes will no longer heal Dragon Knights and Garden Terrors.\n\nInstead, Regeneration Globe effects will now be applied directly to the Hero inside the Dragon Knight or Garden Terror.\n\nPlayers within a Dragon Knight or Garden Terror can now also accumulate stacks for Talents such as Seasoned Marksman, Gathering Power, Regeneration Master, etc.\n\n\nSummoned Unit Attacks\n\n\nSummoned unit Basic Attacks will now miss if that Summon is Blinded or the target is Evading.\nSummoned unit Basic Attacks will no longer consume Block Talent stacks.\n\n\n              Battleground Updates\n              \nEvents in which all three Temples activate simultaneously will no longer occur.\n\n\n\n  Developer Comments: While the three temple event could be fun, it\n  didn’t leave the defending team with many options. It almost always meant\n  whoever had the advantage at that point in time could secure the majority of\n  the temples and win the match with little for the other team to do.\n\n\nGeneral\n\n\nA.I. controlled Heroes can now travel long distances more effectively, and will travel to take part in objectives from anywhere on the Battleground.\nA.I. controlled Heroes will now wait near an objective until enough allies have arrived that they can commit to a team fight at that objective.\n\n\n            "},{"name":"2015-06-30 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19803324/heroes-of-the-storm-patch-notes-june-30-2015","content":"\n              Bug Fixes\n              \nTornadoes cast by the Boss on Sky Temple can no longer push trapped Heroes out of Zagara’s Devouring Maw.\n\n\n            "},{"name":"2015-05-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19067455/heroes-closed-beta-patch-notes-may-12-2015","content":"\n              Battleground Updates\n              \nHealing Fountains found near each team’s Fort in the center lane have been repositioned to prevent them from being attacking outside of tower range.\n\n\n              Bug Fixes\n              \nAlerts proclaiming that the Core is under attack will no longer play when an enemy Hero is within range of the Core before a Keep has been destroyed.\n\n\n              \nAllowing a Temple to return to neutral ownership while it is firing its final 5 volleys will no longer generate error messages.Sky Temple\n\n\n              \nPlayers will no longer enter an infinite rejoin loop if both Cores are destroyed simultaneously, and victory will be assigned to one team at random.\n\nPlease note: Randomly assigned victory/defeat is intended as a temporary solution, intended to fix the infinite rejoin loop as soon as possible. A more robust solution for games that end in a draw will be implemented with a future patch.\n\n\n\n            "},{"name":"2015-03-24 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/18401781/heroes-closed-beta-patch-notes-march-24-2015","content":"\n              Design & Gameplay\n              General\n\n\nIn-game XP Changes\n\nThe in-game leveling curve has been adjusted slightly to slow down the first 10 team levels, though the amount of XP required to reach level 20 remains the same. \n\n\n\n              Battleground Updates\n              \nTemple damage reduced by 10%\n\n\n              Battlegrounds\n              Mercenaries\n\n\nMercenary initial and scaling XP has been reworked.\nMercenary Camp tooltips now indicate which Camps can be Bribed.\n\n\nStructures\n\n\nGate, Tower, Town Hall, and Wall Health reduced by approximately 10%.\n\n\n              Bug Fixes\n              \nFixed a rare issue in which a Core with less than 1 Health could suddenly be destroyed without taking additional damage.\n\n\n              \nVisual effects for Stitches' Vile Gas are now visible on Sky Temple bridges.\n\n\n            "},{"name":"2015-02-10 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/17906504/heroes-closed-beta-patch-notes-february-10-2015","content":"\n              Battlegrounds\n              General\n\n\nHuman teams can now begin Coop games on either side of the Battleground, rather than only on the left side.\nCollecting various Battleground items (Doubloons, Skulls, Seeds, Regeneration Globes) should now be more responsive.\n\n\nStructures\n\n\nCore\n\nThe Core is now invulnerable until both the Keep and Fort in a single lane are destroyed.\n\nThis is now consistent with the way in which Catapult Minions are spawned.\n\n\nWalls\n\nVision provided by Walls reduced by approximately 15%.\n\n\n\n              Bug Fixes\n              \nBattleground objective units such as Grave Golems, Garden Terrors, and Mercenaries will now become invulnerable while leashing. \n\n\n              \nGrave Golems, Mercenaries, and Minions will no longer completely ignore Structures affected by Zeratul’s Void Prison.\n\n\n              \nSky Temple Map Mechanic stats are now properly recorded on the end-game score screen.\n\n\n            "},{"name":"2015-01-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/17345414/heroes-closed-beta-patch-notes-january-13-2015","content":"\n              Battleground Updates\n              Sky Temple, a brand new 3-lane Battleground, has been added to Heroes of the Storm and is now available for play in all game modes!\n\n\nTemples at the center of each lane will activate after 90 seconds, and can be captured to fire devastating beams of energy at enemy Structures.\n\nBeware! Once a Temple has been captured, its Guardians will rise and attempt to remove players by force. Defeat them to maintain control of an active Temple.\nA Temple will cease firing shortly after all players have left its grounds, and can then be recaptured by either team. Be ready to fend off enemy players who seek to wrest control of the Temples for their own benefit.\n\nOne, two, or three Temples will activate at a time, and Temple activation will occur periodically throughout a game.\nTemples will deactivate once their Ammunition is depleted.\n\n\n              Battlegrounds\n              Structures\n\n\nCore\n\nDamage versus Heroes increased by 20%\nAbathur’s Symbiote and Tassadar’s Plasma Shield can once again be cast on the Core.\n\nTowers\n\nThe amount of time that towers are disabled while regenerating ammunition has been increased from 20 to 30 seconds.\n\nThis was done to align with a previous change, in which the rate of tower ammo regeneration was reduced to 1 per 15 seconds. As such, towers will now come back online with 2 ammunition.\n\n\n\n\nMercenaries\n\n\nGrave Golem\n\nRoot\n\nGrave Golems will no longer pause when casting Root.\nRoot will now be cast on ranged Minions.\nHeroic units will remain the preferred targets.\n\nStomp\n\nThe post-cast delay on Stomp has been removed.\nStomp will now be cast when there are at least 2 Heroic units around the Grave Golem, or at least 3 Minions.\nStomp will not be cast unless the Grave Golem is already stationary.\nStomp now deals increased damage versus Minions.\n\n\n\n\n              Bug Fixes\n              \nCatapult Minions no longer deal half their intended damage, and once again deal area of effect damage around their target.\n\n\n            "}],"tombofthespiderqueen":[{"name":"2016-09-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20243513/heroes-of-the-storm-patch-notes-september-13-2016","content":"\n              Design & Gameplay\n              Mounts\n\n\nMovement Speed reduced from 40 to 30%\n\n\nRegeneration Globes\n\n\nTime before Globes despawn reduced from 8 to 6 seconds\n\n\n              Battlegrounds\n              Mercenaries\n\n\nTiming Changes\n\nPreviously all Mercenary camps spawned at 120 seconds. The following adjustments have been made to spawn times:\n\n90 seconds: Sappers, Doubloon Pirates\n120 seconds: Siege Giants (unchanged), Impalers (unchanged)\n150 seconds: Knights, Fallen Shaman\n180 seconds: Grave Golem (unchanged)\n300 seconds: Headless Horseman (unchanged)\n\n\nCaptured Mercenaries will no longer grant Experience when killed.\n\n\n\n  Developer Comments: We started playtesting with staggered Mercenary\n  Camp spawn times, and quickly began to realize that it added more strategic\n  depth to the game, and coincided with some of our Battleground events. We have\n  been happy with the changes overall, and are listening to any feedback you may\n  have!\n\n\n              Bug Fixes\n              \nTomb of the Spider Queen: Medivh will now properly fly over the Spider Queen’s Altars while in Raven form, rather than path around them.\n\n\n              \nHeroes can no longer push captured Mercenaries by walking into them.\n\n\n            "},{"name":"2016-08-09 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20212896/heroes-of-the-storm-patch-notes-august-9-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer push Neutral and Enemy Mercenaries by walking into them.\n\n\n            "},{"name":"2016-07-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20184555/heroes-of-the-storm-balance-update-july-27-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer be pushed by walking another Hero into them. \n\n\n              \nCollision: Heroes who are channeling an Ability can no longer be pushed when another Hero walks into them during the channel. \n\n\n            "},{"name":"2016-07-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20164442/heroes-of-the-storm-patch-notes-july-12-2016","content":"\n              Design & Gameplay\n              Core\n\n\nVictory determination is now much more precise in situations where both Cores are destroyed within fractions of a second. As a result, Victory will no longer be decided at random in cases where it appears that both Cores are destroyed at the same moment.\n\n\nRegeneration Globes\n\n\nHealth Regeneration\n\nPreviously: Restore 6.24% of maximum Health over 4 seconds\nNow: Restore 12% of maximum Health over 5 seconds\n\nMana Regeneration\n\nPreviously: Restore 32 Mana over 4 seconds.\nNow: Restore 8% of maximum Mana over 5 seconds\n\n\n\n\n  Developer Comments: Thank you for all your discussion and feedback on\n  our recent Health sustain post! We are still heavily evaluating a lot of it\n  but wanted to get the first round of changes in. Internally, we enjoyed the\n  increased importance on Regeneration Globes and have cleaned up the system a\n  bit. With a larger importance, denying enemies their Globes in lane has a much\n  larger impact.\n\n\nHealing Wells\n\n\nCooldown increased from 100 to 120 seconds\nHealth Regeneration\n\nPreviously: Restore 41% of maximum Health over 20 seconds.\nNow: Restore 40% of maximum Health over 20 seconds.\n\nMana Regeneration\n\nPreviously: Restore 20% of maximum Mana over 20 seconds.\nNow: Restore 30% of maximum Mana over 20 seconds.\n\n\n\n\n  Developer Comments: Much like the changes to Regeneration Globes, we\n  wanted to add a larger impact to the moment you click a Healing Well. Again,\n  we cleaned up the system a fair bit (hence the ~41% to 40% Health change) and\n  added a larger impact for heavy Mana users. The increased cooldown should make\n  the decision of when to tap the Healing Well slightly more interesting.\n\n\nMinions\n\n\nRanged, Melee, and Wizard Minions\n\nNow deal an additional 50% damage to Structures.\n\n\n\n\n  Developer Comments: Our goal with this change is to make escorting\n  Minions to Towns to be more impactful, such that they can really start to do\n  some damage if left unattended. Before this change, Minions were primarily XP\n  carriers that absorbed some Ammo shots from Towers. Now the armies of the\n  Nexus are a bit scarier when they march down a lane.\n\n\n\nCatapult Minions\n\nAttack range increased by 20%.\nSight range increased by 17%.\nWill now fixate on Structures. Catapults will not acquire a new target after fixating until the target is destroyed or the Catapult is killed.\n\n\n\n\n  Developer Comments: Catapults would often reach the Core, but have a\n  Minion wave spawn on them, distract them, and allow them to be killed off\n  before doing any significant damage. With increased range and fixation on a\n  Structure once they’ve started attacking, even one Catapult will more\n  consistently punch through a Core’s Shield and do actual damage.\n\n\n              Bug Fixes\n              \nTomb of the Spider Queen: The number of Spider Gems held by each team will now always display, even if zero Gems are currently being carried.\n\n\n              \nTomb of the Spider Queen: The Top-lane Keep on the left side of the Battleground can no longer attack enemies who are standing next to the Gate.\n\n\n            "},{"name":"2016-06-14 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20143449/heroes-of-the-storm-patch-notes-june-14-2016","content":"\n              Bug Fixes\n              \nTomb of the Spider Queen: Fixed an issue that caused Webweavers to spawn at the friendly Core if enemy minions were present.\n\n\n            "},{"name":"2016-05-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20120032/heroes-of-the-storm-patch-notes-may-17-2016","content":"\n              Battlegrounds\n              Healing Well\n\n\n25% of a Healing Well’s maximum Health has been converted into a Shield. Shield Regeneration delay of 8 seconds.\n\n\n\n  Developer Comments: We’ve noticed some rather un-fun behavior in the\n  form of sniping Healing Wells over time using very long range Abilities. While\n  we’re okay with players doing this to a degree, we found it was too effective\n  given how little counterplay there was. To help solve this, turned a sizable\n  portion of Healing Well Health into a Shield. This means that if you offer\n  your Healing Well some respite from enemy attacks by chasing opponents away\n  every now and then, it will start to regenerate some of that Shield. Only\n  you can protect Healing Wells from those pesky Arcane Orbs!\n\n\n              Bug Fixes\n              \nFixed an issue in which attacking enemy Walls at certain angles would cause the Hero’s Basic Attack animation to play, but deal no damage.\n\n\n            "},{"name":"2016-04-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20102776/heroes-of-the-storm-balance-update-notes-april-27-2016","content":"\n              Bug Fixes\n              \nIssuing a Mount command while holding down the right mouse button to move will no longer interrupt Mount channeling.\n\n\n            "},{"name":"2016-04-19 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20099322/heroes-of-the-storm-patch-notes-april-19-2016","content":"\n              Bug Fixes\n              \nRe-issuing an attack order on a Structure in the Fog of War will no longer cause Basic Attack animations to repeat without applying damage.\n\n\n              \nSide Gate Health is now consistent across Tomb of the Spider Queen.\n\n\n            "},{"name":"2016-03-29 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20063493/heroes-of-the-storm-patch-notes-march-29-2016","content":"\n              Bug Fixes\n              \nSuccessfully turning in enough Gems to summon Webweavers on Tomb of the Spider Queen will now properly interrupt other players who were also channeling at that time.\n\n\n            "},{"name":"2016-03-01 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20049139/heroes-of-the-storm-patch-notes-march-1-2016","content":"\n              Bug Fixes\n              \nTowers will now properly fire Ammo provided by an allied M.U.L.E. immediately after 2 Ammo has been restored.\n\n\n            "},{"name":"2016-02-10 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20008204/heroes-of-the-storm-balance-update-notes-february-10-2016","content":"\n              Bug Fixes\n              \nDying will no longer cause the player’s Healing Well cooldown to reset.\n\n\n            "},{"name":"2016-02-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19995509/heroes-of-the-storm-patch-notes-february-2-2016","content":"\n              Design & Gameplay\n              Battleground Monsters\n\n\nBattleground-specific creatures are now universally defined as Monsters (ex: Neutral Garden Terrors, Sky Temple Guardians, etc.)\nSeveral Talents and Abilities have been changed to reflect this new categorization, and the following no longer affect Monsters:\n\nMercenary Lord\nJohanna's Knight Takes Pawn\nLunara's Cruel Bloom\nRexxar's Easy Prey and Bird of Prey\nThe Butcher's Chop Meat\n\nThe following now affect Monsters:\n\nAnub'arak's Beetle, Juiced\nAzmodan's Demonic Smite\n\nSeveral Talents that could previously trigger against both captured Mercenaries and Minions will now only affect Minions (ex: Seasoned Marksman, Black Soulstone, etc.)\n\n\n              Battlegrounds\n              Structures\n\n\nTowers, Forts, and Keeps now deal 50% bonus damage to Heroes\nCores will now display an “Invulnerable” message if attacked by an enemy when no allied Keeps have been destroyed.\nStructures can no longer be made Vulnerable\n\n\n\n  Developer Comments: The scaling changes we released in December made\n  it so Heroes could dive into Structures with impunity during the early game.\n  Increasing the damage that Structures deal to Heroes allows defending players\n  to feel a bit safer. We are exploring other fixes to help Structures feel more\n  meaningful throughout the game and will release them when they are ready.\n\n\n              Bug Fixes\n              \nDiagonally placed shrubs will now properly hide Heroes within them.\n\n\n              \nPlayers punted out of an enemy Hall of Storms will no longer be persistently stunned if an enemy unit blocked the path of the punt.\n\n\n            "},{"name":"2015-12-15 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19981657/heroes-of-the-storm-patch-notes-december-15-2015","content":"\n              Bug Fixes\n              \nDiagonally placed Shrubs will no longer sometimes fail to properly hide a Hero within.\n\n\n            "},{"name":"2015-11-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19960704/heroes-of-the-storm-patch-notes-november-17-2015","content":"\n              Design & Gameplay\n              Scaling Changes\n\n\nHealth and damage scaling for all Heroes, Battleground Events, Minions, and Mercenaries has been changed from flat, additive values to values that are multiplicative by percentage.\nA large portion of Heroes’ total scaling amounts, which were previously gained over the course of a game, have been added to their base values.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: Due to the way that our old level scaling system worked, early game level discrepancies created a larger difference in power level than we liked.  This often led to situations where a team could be up two or more levels early in a game, and use this advantage to create a larger lead.  We didn’t feel that games were fun for the winning or losing team in these types of scenarios.   As a result of these changes, all Heroes will have more power early, but gain less from each level.  Battleground Events, Minions, Mercenaries, and Structures have all been adjusted to compensate for this and should feel close to what they did previously.   The aim of these adjustments to the scaling system is to make level differences have a similar impact on your Hero’s statistics at all points in a game.  Now, each level offers about 4% Health and 4% damage, which mirrors what late game leads felt like in our previous version of the game.  It is important to note, that while being down a few levels will be less punishing than it was previously, Talent tier advantages can and will still have a noticeable impact on enemy engagements.\n\n\nRespawn Timers\n\n\nRespawn timers have been increased for levels 1 – 10.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: In order to reward players for getting early game\n  Takedowns, we’re also increasing the respawn time of dead Heroes at low\n  levels. Now, getting early game Takedowns (and the experience associated with\n  it) won’t give your team as much pure power as it did previously. Instead,\n  early kills will offer a “power play” moment, in which your team can destroy\n  enemy Structures, complete Battleground Events, or take more Mercenaries.\n  These meaningful strategic advantages will position a team closer to victory,\n  without giving them a large stat advantage and the ability to bully the\n  opposing enemy team.\n\n\nAttack Speed Slows\n\n\nAttack speed slows now apply only to Heroes and Summons.\n\n\n            "},{"name":"2015-10-06 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19893628/heroes-of-the-storm-patch-notes-october-6-2015","content":"\n              Design & Gameplay\n              A.I. Talent Selection\n\n\nA.I. controlled Heroes will now select their Talents from a group of preset Talent builds.\n\n\n\n  Developer Comments: A.I. players will now choose from predetermined\n  Talent builds instead of randomly selecting Talents. This is especially\n  important for players who disconnect as the A.I. will now no longer randomly\n  choose Talents, but instead try to pick builds that are closer to what players\n  would expect. In addition, A.I. controlled Heroes in Versus A.I. games will\n  also have their own Talent builds to choose from.\n\n\nVehicles and Regeneration Globe Interaction\n\n\nRegeneration Globes will no longer heal Dragon Knights and Garden Terrors.\n\nInstead, Regeneration Globe effects will now be applied directly to the Hero inside the Dragon Knight or Garden Terror.\n\nPlayers within a Dragon Knight or Garden Terror can now also accumulate stacks for Talents such as Seasoned Marksman, Gathering Power, Regeneration Master, etc.\n\n\nSummoned Unit Attacks\n\n\nSummoned unit Basic Attacks will now miss if that Summon is Blinded or the target is Evading.\nSummoned unit Basic Attacks will no longer consume Block Talent stacks.\n\n\n            "},{"name":"2015-08-18 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19818499/heroes-of-the-storm-patch-notes-august-18-2015","content":"\n              Battleground Updates\n              \n  Developer Comments: A small number of Tomb games tend to run\n  significantly longer than intended, so we altered the scaling of the Spider\n  mechanic to prevent drawn out stalemates in the late game. Our hope is to see\n  shorter matches overall.\n\n\n\nIncreased the damage and Health scaling of Webweavers and their minions by 50% past the 15 minute mark.\n\n\n            "},{"name":"2015-06-30 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19803324/heroes-of-the-storm-patch-notes-june-30-2015","content":"\n              Bug Fixes\n              \nFixed an issue that could prevent Mercenary Camps from respawning appropriately after turning in enough Gems to summon Webweavers on Tomb of the Spider Queen.\n\n\n            "},{"name":"2015-05-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19067455/heroes-closed-beta-patch-notes-may-12-2015","content":"\n              Bug Fixes\n              \nAlerts proclaiming that the Core is under attack will no longer play when an enemy Hero is within range of the Core before a Keep has been destroyed.\n\n\n              \nPlayers will no longer enter an infinite rejoin loop if both Cores are destroyed simultaneously, and victory will be assigned to one team at random.\n\nPlease note: Randomly assigned victory/defeat is intended as a temporary solution, intended to fix the infinite rejoin loop as soon as possible. A more robust solution for games that end in a draw will be implemented with a future patch.\n\n\n\n            "},{"name":"2015-03-24 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/18401781/heroes-closed-beta-patch-notes-march-24-2015","content":"\n              Design & Gameplay\n              General\n\n\nIn-game XP Changes\n\nThe in-game leveling curve has been adjusted slightly to slow down the first 10 team levels, though the amount of XP required to reach level 20 remains the same. \n\n\n\n              Battleground Updates\n              Tomb of the Spider Queen, a brand new 3-lane Battleground, has been added to Heroes of the Storm and is now available for play in all game modes!\n\n\nSpider Minions and enemy Heroes will drop magical Gems of Power upon death.\n\nCollect these Gems and turn them in to the Spider Queen’s Altars, which can be found in-between lanes at the center of the Battleground.\n\nOnce either team has relinquished enough Gems to the Spider Queen, her Webweavers will descend and travel down each lane to siege the opposing team on three fronts.\n\nEach team can summon Webweavers by turning in 50 Gems. The number of required Gems will increase by 5 for each subsequent wave.\nBe sure to turn in Gems promptly! Gems collected by a player will be dropped upon death, but can be picked up by allied Heroes.\n\n\n\n              Battlegrounds\n              Mercenaries\n\n\nMercenary initial and scaling XP has been reworked.\nMercenary Camp tooltips now indicate which Camps can be Bribed.\n\n\nStructures\n\n\nGate, Tower, Town Hall, and Wall Health reduced by approximately 10%.\n\n\n              Bug Fixes\n              \nFixed a rare issue in which a Core with less than 1 Health could suddenly be destroyed without taking additional damage.\n\n\n            "}],"towersofdoom":[{"name":"2016-09-13 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20243513/heroes-of-the-storm-patch-notes-september-13-2016","content":"\n              Design & Gameplay\n              Mounts\n\n\nMovement Speed reduced from 40 to 30%\n\n\nRegeneration Globes\n\n\nTime before Globes despawn reduced from 8 to 6 seconds\n\n\n              Battleground Updates\n              \nHeadless Horseman\n\nAttack damage increased from 145 to 158\n\n\n\n              Battlegrounds\n              Mercenaries\n\n\nTiming Changes\n\nPreviously all Mercenary camps spawned at 120 seconds. The following adjustments have been made to spawn times:\n\n90 seconds: Sappers, Doubloon Pirates\n120 seconds: Siege Giants (unchanged), Impalers (unchanged)\n150 seconds: Knights, Fallen Shaman\n180 seconds: Grave Golem (unchanged)\n300 seconds: Headless Horseman (unchanged)\n\n\nCaptured Mercenaries will no longer grant Experience when killed.\n\n\n\n  Developer Comments: We started playtesting with staggered Mercenary\n  Camp spawn times, and quickly began to realize that it added more strategic\n  depth to the game, and coincided with some of our Battleground events. We have\n  been happy with the changes overall, and are listening to any feedback you may\n  have!\n\n\n              Bug Fixes\n              \nTowers of Doom: Sappers can sometimes stop attacking their targets and start following enemy Heroes.\n\n\n              \nHeroes can no longer push captured Mercenaries by walking into them.\n\n\n            "},{"name":"2016-08-09 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20212896/heroes-of-the-storm-patch-notes-august-9-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer push Neutral and Enemy Mercenaries by walking into them.\n\n\n              \nTowers of Doom: Fixed an issue in which some Summons, such as Arthas’ Ghouls, would not teleport with the Hero after using the Tunnel.\n\n\n            "},{"name":"2016-07-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20184555/heroes-of-the-storm-balance-update-july-27-2016","content":"\n              Bug Fixes\n              \nCollision: Heroes can no longer be pushed by walking another Hero into them. \n\n\n              \nCollision: Heroes who are channeling an Ability can no longer be pushed when another Hero walks into them during the channel. \n\n\n            "},{"name":"2016-07-12 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20164442/heroes-of-the-storm-patch-notes-july-12-2016","content":"\n              Design & Gameplay\n              Core\n\n\nVictory determination is now much more precise in situations where both Cores are destroyed within fractions of a second. As a result, Victory will no longer be decided at random in cases where it appears that both Cores are destroyed at the same moment.\n\n\nRegeneration Globes\n\n\nHealth Regeneration\n\nPreviously: Restore 6.24% of maximum Health over 4 seconds\nNow: Restore 12% of maximum Health over 5 seconds\n\nMana Regeneration\n\nPreviously: Restore 32 Mana over 4 seconds.\nNow: Restore 8% of maximum Mana over 5 seconds\n\n\n\n\n  Developer Comments: Thank you for all your discussion and feedback on\n  our recent Health sustain post! We are still heavily evaluating a lot of it\n  but wanted to get the first round of changes in. Internally, we enjoyed the\n  increased importance on Regeneration Globes and have cleaned up the system a\n  bit. With a larger importance, denying enemies their Globes in lane has a much\n  larger impact.\n\n\nHealing Wells\n\n\nCooldown increased from 100 to 120 seconds\nHealth Regeneration\n\nPreviously: Restore 41% of maximum Health over 20 seconds.\nNow: Restore 40% of maximum Health over 20 seconds.\n\nMana Regeneration\n\nPreviously: Restore 20% of maximum Mana over 20 seconds.\nNow: Restore 30% of maximum Mana over 20 seconds.\n\n\n\n\n  Developer Comments: Much like the changes to Regeneration Globes, we\n  wanted to add a larger impact to the moment you click a Healing Well. Again,\n  we cleaned up the system a fair bit (hence the ~41% to 40% Health change) and\n  added a larger impact for heavy Mana users. The increased cooldown should make\n  the decision of when to tap the Healing Well slightly more interesting.\n\n\nMinions\n\n\nRanged, Melee, and Wizard Minions\n\nNow deal an additional 50% damage to Structures.\n\n\n\n\n  Developer Comments: Our goal with this change is to make escorting\n  Minions to Towns to be more impactful, such that they can really start to do\n  some damage if left unattended. Before this change, Minions were primarily XP\n  carriers that absorbed some Ammo shots from Towers. Now the armies of the\n  Nexus are a bit scarier when they march down a lane.\n\n\n\nCatapult Minions\n\nAttack range increased by 20%.\nSight range increased by 17%.\nWill now fixate on Structures. Catapults will not acquire a new target after fixating until the target is destroyed or the Catapult is killed.\n\n\n\n\n  Developer Comments: Catapults would often reach the Core, but have a\n  Minion wave spawn on them, distract them, and allow them to be killed off\n  before doing any significant damage. With increased range and fixation on a\n  Structure once they’ve started attacking, even one Catapult will more\n  consistently punch through a Core’s Shield and do actual damage.\n\n\n            "},{"name":"2016-06-14 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20143449/heroes-of-the-storm-patch-notes-june-14-2016","content":"\n              Bug Fixes\n              \nTowers of Doom: Players should no longer encounter a significant FPS drop when the first round of Bell Towers fire.\n\n\n            "},{"name":"2016-05-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20120032/heroes-of-the-storm-patch-notes-may-17-2016","content":"\n              Battlegrounds\n              Healing Well\n\n\n25% of a Healing Well’s maximum Health has been converted into a Shield. Shield Regeneration delay of 8 seconds.\n\n\n\n  Developer Comments: We’ve noticed some rather un-fun behavior in the\n  form of sniping Healing Wells over time using very long range Abilities. While\n  we’re okay with players doing this to a degree, we found it was too effective\n  given how little counterplay there was. To help solve this, turned a sizable\n  portion of Healing Well Health into a Shield. This means that if you offer\n  your Healing Well some respite from enemy attacks by chasing opponents away\n  every now and then, it will start to regenerate some of that Shield. Only\n  you can protect Healing Wells from those pesky Arcane Orbs!\n\n\n              Bug Fixes\n              \nCores on Towers of Doom will no longer appear to lose their Invulnerability Shields after a Fort is destroyed.\n\n\n              \nCorrected the positioning of several houses near the southernmost Altar on Towers of Doom.\n\n\n              \nFixed an issue in which attacking enemy Walls at certain angles would cause the Hero’s Basic Attack animation to play, but deal no damage.\n\n\n            "},{"name":"2016-04-27 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20102776/heroes-of-the-storm-balance-update-notes-april-27-2016","content":"\n              Bug Fixes\n              \nIssuing a Mount command while holding down the right mouse button to move will no longer interrupt Mount channeling.\n\n\n            "},{"name":"2016-04-19 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20099322/heroes-of-the-storm-patch-notes-april-19-2016","content":"\n              Battleground Updates\n              \nEvents in which three Altars spawn at once will now only occur twice per game, during the first and fifth Altar events.\n\n\n\n  Developer Comments: We wanted to remove the triple Altar spawns when\n  they are more likely to be game ending events. We still feel that triple Altar\n  events offer interesting gameplay moments that ask teams to fight over 3\n  locations at the same time, but we don’t feel it’s a good experience when a\n  team's Core Health is low and they don’t think they can contest the Altars to\n  prevent a loss.\n\n\n              Bug Fixes\n              \nRe-issuing an attack order on a Structure in the Fog of War will no longer cause Basic Attack animations to repeat without applying damage.\n\n\n            "},{"name":"2016-03-29 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20063493/heroes-of-the-storm-patch-notes-march-29-2016","content":"\n              Bug Fixes\n              \nA.I. players on Towers of Doom will now better avoid enemy Core defenses.\n\n\n              \nExiting the Tunnel on Towers of Doom will no longer prevent Heroes from automatically attacking enemies near the Tunnel exit.\n\n\n            "},{"name":"2016-03-01 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/20049139/heroes-of-the-storm-patch-notes-march-1-2016","content":"\n              Bug Fixes\n              \nTowers will now properly fire Ammo provided by an allied M.U.L.E. immediately after 2 Ammo has been restored.\n\n\n            "},{"name":"2016-02-10 Balance Update ","url":"http://us.battle.net/heroes/en/blog/20008204/heroes-of-the-storm-balance-update-notes-february-10-2016","content":"\n              Bug Fixes\n              \nDying will no longer cause the player’s Healing Well cooldown to reset.\n\n\n            "},{"name":"2016-02-02 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19995509/heroes-of-the-storm-patch-notes-february-2-2016","content":"\n              Design & Gameplay\n              Battleground Monsters\n\n\nBattleground-specific creatures are now universally defined as Monsters (ex: Neutral Garden Terrors, Sky Temple Guardians, etc.)\nSeveral Talents and Abilities have been changed to reflect this new categorization, and the following no longer affect Monsters:\n\nMercenary Lord\nJohanna's Knight Takes Pawn\nLunara's Cruel Bloom\nRexxar's Easy Prey and Bird of Prey\nThe Butcher's Chop Meat\n\nThe following now affect Monsters:\n\nAnub'arak's Beetle, Juiced\nAzmodan's Demonic Smite\n\nSeveral Talents that could previously trigger against both captured Mercenaries and Minions will now only affect Minions (ex: Seasoned Marksman, Black Soulstone, etc.)\n\n\n              Battleground Updates\n              \nOwnership of nearby Bell Towers will no longer determine which lane Sapper Mercenaries will travel down. The two southern Sapper camps will now always travel down the bottom lane.\nText has been added to the Tunnels to help clarify their one-way use.\n\n\n              Battlegrounds\n              Structures\n\n\nTowers, Forts, and Keeps now deal 50% bonus damage to Heroes\nCores will now display an “Invulnerable” message if attacked by an enemy when no allied Keeps have been destroyed.\nStructures can no longer be made Vulnerable\n\n\n\n  Developer Comments: The scaling changes we released in December made\n  it so Heroes could dive into Structures with impunity during the early game.\n  Increasing the damage that Structures deal to Heroes allows defending players\n  to feel a bit safer. We are exploring other fixes to help Structures feel more\n  meaningful throughout the game and will release them when they are ready.\n\n\n              Bug Fixes\n              \nAI players on Towers of Doom will no longer path through the opposing team’s invulnerable defenses when traveling from the enemy’s side of the Battleground to an active Altar.\n\n\n              \nDiagonally placed shrubs will now properly hide Heroes within them.\n\n\n              \nMissiles will now travel at one consistent speed on Towers of Doom.\n\n\n              \nPinging the Tunnel Entrance on Towers of Doom in a French game client will now display the proper message in French. \n\n\n              \nPlayers punted out of an enemy Hall of Storms will no longer be persistently stunned if an enemy unit blocked the path of the punt.\n\n\n            "},{"name":"2015-12-15 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19981657/heroes-of-the-storm-patch-notes-december-15-2015","content":"\n              Bug Fixes\n              \nDiagonally placed Shrubs will no longer sometimes fail to properly hide a Hero within.\n\n\n            "},{"name":"2015-11-17 Patch Notes ","url":"http://us.battle.net/heroes/en/blog/19960704/heroes-of-the-storm-patch-notes-november-17-2015","content":"\n              Design & Gameplay\n              Scaling Changes\n\n\nHealth and damage scaling for all Heroes, Battleground Events, Minions, and Mercenaries has been changed from flat, additive values to values that are multiplicative by percentage.\nA large portion of Heroes’ total scaling amounts, which were previously gained over the course of a game, have been added to their base values.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: Due to the way that our old level scaling system worked, early game level discrepancies created a larger difference in power level than we liked.  This often led to situations where a team could be up two or more levels early in a game, and use this advantage to create a larger lead.  We didn’t feel that games were fun for the winning or losing team in these types of scenarios.   As a result of these changes, all Heroes will have more power early, but gain less from each level.  Battleground Events, Minions, Mercenaries, and Structures have all been adjusted to compensate for this and should feel close to what they did previously.   The aim of these adjustments to the scaling system is to make level differences have a similar impact on your Hero’s statistics at all points in a game.  Now, each level offers about 4% Health and 4% damage, which mirrors what late game leads felt like in our previous version of the game.  It is important to note, that while being down a few levels will be less punishing than it was previously, Talent tier advantages can and will still have a noticeable impact on enemy engagements.\n\n\nRespawn Timers\n\n\nRespawn timers have been increased for levels 1 – 10.\n\nPlease review our recent blog on scaling and respawn timer changes for more details.\n\n\n\n\n  Developer Comments: In order to reward players for getting early game\n  Takedowns, we’re also increasing the respawn time of dead Heroes at low\n  levels. Now, getting early game Takedowns (and the experience associated with\n  it) won’t give your team as much pure power as it did previously. Instead,\n  early kills will offer a “power play” moment, in which your team can destroy\n  enemy Structures, complete Battleground Events, or take more Mercenaries.\n  These meaningful strategic advantages will position a team closer to victory,\n  without giving them a large stat advantage and the ability to bully the\n  opposing enemy team.\n\n\nAttack Speed Slows\n\n\nAttack speed slows now apply only to Heroes and Summons.\n\n\n              Battleground Updates\n              The Grave Keeper and Raven Lord have risen over a dark and mysterious city,\neach seeking to add it to the territories under their control. Now, these\nRealm Lords call upon the aid of Heroes in their battle for dominance over the\nTowers of Doom.\n\n\nPlease note: Towers of Doom is not currently available in the live version of Heroes of the Storm, as PTR testing has not yet concluded. Click here for more information.\nEach Core on this Battleground is surrounded by an indestructible barrier, and cannot be razed by Heroes, Minions, or Mercenaries.\n\nInstead, Heroes must capture the Altars that periodically activate within the city. Upon doing so, each of the Bell Towers controlled by the capturing team will fire a payload that damages the opposing Core.\n\nBell Tower allegiance is fickle! A Bell Tower that has been destroyed will respawn after a short delay, aligning itself with the team that took it down.\n\nToppling a Bell Tower not only increases a team’s area of control over the Battleground, but also grants an additional payload in the volleys that fire on the enemy Core after capturing an Altar.\n\n\n\nTowers of Doom Available Now on PTR\n\n\nTowers of Doom is the only Battleground available for play in PTR matchmaking queues.\n\nBattleground pools on the PTR have been reduced so that more thorough Towers of Doom playtesting can be done, and any bugs discovered during this time can be fixed before the Battleground is officially released.\n\nPlease note: Towers of Doom will not be available in the live version of Heroes immediately on patch day, but will remain playable on the PTR until playtesting concludes on November 24. \n\n\n            "}]}