{"dragonshire":[{"details":"Top lane is the least important of the three lanes. This is because to get top keep you have to cross into \"the bridge of death\", a.k.a. bridge of throws, a.k.a. giant choke point no one should ever try to assault a keep through unless the entire enemy team is dead.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Any attacks that do % damage (Tychus D, Giant Killer) work against the Dragon Knight.","type":"Helper","patch":"Kael'thas","realVotes":11},{"details":"Global heroes can quickly jump from one shrine to the other, creating situational number advantages.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"havent tried yet, but Zagaras Nydus Ult shoult do pretty well here if no global hero is available","type":"Helper","patch":"Kael'thas","realVotes":-5}],"battlefieldofeternity":[{"details":"Drafting sustained damage is must on this map to win the Immortal race. High DPS heroes, such as Valla, Greymane or Zul'Jin are essential for your team. Heroes with bonus non-heroic damage, such as Artanis, Sylvanas and Lunara should talent appropriately  to  maximize damage to immortals.","type":"Helper","patch":"Kael'thas","realVotes":19},{"details":"The first Immortal, when changing positions, will always go towards the close (back side) location to the team that needs to damage them, meaning that at this point, racing it is the most effective strategy because you have to be very deep in enemy territory to defend it.","type":"Helper","patch":"Kael'thas","realVotes":9},{"details":"Low/medium MMR solo queue advice: \n\nWhen defending Immortals, it is important to keep in mind that the objective does not at all progress on its own. The race simply cannot be won without at least one hero damaging the enemy immortal. \n\nDefending your own Immortal indefinitely (especially early ones, when the death timers are still very low) therefore often only yields the result of a delayed but devastating loss of the race -- you might very well have a 100% shielded enemy Immortal coming towards your base, just a bit later than it could have been. Seek out opportunities to safely deal damage to the enemy immortal and consider trading DPS even when chances are that the enemy can DPS faster.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"When drafting, make sure that your team either has a faster race or the better team fighting. Not having either option makes it extremely difficult to win the Immortal.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"A won immortal will always go to the lane with more standing structures between it and the core.  Knowing this allows your team to gain favorable positioning in lanes for the push phase.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"This is by far THE WORST Ragnaros map in every league according to hotslogs winrates. You do not need to prioritize him here. He won't help you much in getting the objective and Immortal just shreds through his trait anyway.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Between each of the Immortal pads is a little L-shaped piece of terrain hidden by vents. Sgt. Hammer can hide in them and still siege the Immortal if she has a teammate spotting for her. Her contributions to team fights will be limited, however.","type":"Helper","patch":"Kael'thas","realVotes":1}],"cursedhollow":[{"details":"First Siege camps spawn at exactly 2 minutes, giving around 30-50 seconds before the first Tribute spawns. Capping it before then allows some uncontested push during Tribute fights.","type":"Helper","patch":"Kael'thas","realVotes":11},{"details":"When a Tribute spawns, keep an eye on your allies! The often can not arrive in time for the Tribute spawn  so try to poke the enemies and deny them the tribute rather than engaging alone until your team has arrived. Heroes with global presence (such as Falstad, Brightwing or Dehaka) should take the outer lanes for soaking since they can easily arrive in time at Tributes.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"To maximize your Sololaner's potential (such as Zagara, Xul, Murky, Gazlowe), try to  deny the tribute for the enemy by poking and prolonging the fight as much as possible so that your Sololaners can safely push their lane if they can not make it to the Tribute in time. Eventually, the enemy is forced to retreat, split up or losing structures, giving you a good opportunity to engage.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Tributes follow a pattern in their spawning behaviour. The spawns are separated into groups of three (tributes #1-#3, tributes #4-#6 and so on, regardless of who takes which tribute). Each tribute can spawn either top or bottom, and either left, middle or right. In every group of three, there will be exactly one tribute in a left spot, one in a middle spot, and one in a right spot. Additionally, in every group of three, there will be spawns in both top and bottom. This sometimes lets you deduce tribute spawn positions in advance. If for example tribute #1 spawns top left and tribute #2 spawns top middle, you know with certainty that tribute #3 will spawn bottom right.","type":"Helper","patch":"Kael'thas","realVotes":13},{"details":"It's okay to give up a tribute. Sometimes you can accomplish something worth more in the time it takes the enemy team to mobilize for a tribute.","type":"Helper","patch":"Kael'thas","realVotes":7}],"skytemple":[{"details":"The second Temple phase will always be in bot lane only. If you can secure their bot healing well before then, you will have an advantage going in.","type":"Helper","patch":"Kael'thas","realVotes":14},{"details":"Temples always spawn 2 minutes after the previous one was finished. Keep this in mind to take your bruiser camp after the first 2 temples at mid & top are finished. Capping these as the bot lane temple spawns will let them either do uncontested pushing, or attract the attention of an enemy hero.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"If you can choose which lane to push, lean towards bot lane. This is where the boss goes, which offers good chances to go for the enemy core in the late game.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"Damaging or killing the wall of the enemy helps you gain more value from the Temples. On the defensive side, Mule is very useful on this map to lower the value the enemy gets from Temples.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"The first temple spawns top and mid, so be sure not to have multiple heroes bot at the start of the game. Controlling vision when the temples spawn gives you a huge advantage.","type":"Helper","patch":"Kael'thas","realVotes":4}],"blackheartsbay":[{"details":"Tracer will break chests quickly.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"XP soak is important above all else here. You do not need to fight over every coin turn in - play for map advantage, note where your opponents are and try to deny them soak elsewhere on the map. Do this and you'll find yourself winning when it matters.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"Xul is god tier on this map due to his high sustain and ability to split soak the top two lanes. IF the enemy team has a Xul because it wasn't banned in Draft I suggest either taking Nazeebo/Ragnaros/Sylvanas to attempt to duo lane against him. If you haven't taken either of those heroes then a high gank comp hitting him mid rotate can also shut down this strategy.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"It is incredibly easy to finish globe quests and seasoned-marksman-like quests on this map if you dedicate 3-4 heroes to efficiently rotate top and mid lane (taking coin camps when possible - those yield additional globes). Consider giving up the first turn-in to finish quests that might snowball.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"The first turn-in targets the mid lane fort. It will target the towers, gate and fountain before the actual fort building. If those secondary buildings are undamaged when the barrage begins, the fort will be left standing, barely alive. If, however, you either completely destroy one of the towers or get both towers below ~50% (I'm not sure on the exact percentage), the cannon shots will kill the actual fort. This makes it worth dedicating some time and pushing power towards the wall towers early.","type":"Helper","patch":"Kael'thas","realVotes":10},{"details":"Having hero who can clear Mercenary Camps by themselves is very useful, such as getting the top camp right before grouping up for a turn in.","type":"Helper","patch":"Kael'thas","realVotes":0},{"details":"Nazeebo breaks chest quick and is god at siegeing in this map","type":"Helper","patch":"Kael'thas","realVotes":-1},{"details":"Have a hero with strong waveclear (Xul, Ragnaros, Artanis, Nazeebo) solo both top lanes and rotate as 4 to gank, get camps, and soak bot lane.","type":"Helper","patch":"Kael'thas","realVotes":2}],"hauntedmines":[{"details":"When you're collecting the last skulls, but it's inevitable that you're going to get the smaller golem (e.g. yours 30 vs 70), you can also just leave the  last skull uncollected and do objectives or stuff in that time.\nThe other team has to go and pickup the last skull in order for the golems to spawn","type":"Helper","patch":"Kael'thas","realVotes":13},{"details":"Siege camp spawns at 1:30, mines open 30s later. Capping them as the mines open will make sure they either push, or distract one of the enemy heroes, giving you an advantage in the mines.","type":"Helper","patch":"Kael'thas","realVotes":9},{"details":"Split up inside the mines. If you enter the mines just to follow an ally, you may aswell not be there. It sucks when you have 4 people in the mines, your enemies have 2, and they get most of the small skull camps. The only time where you should not split in the mines is when both teams have 5 people in, and your team will win the fight if it happens. In this case go in as a team and alternate killing camps and hunting down the enemy team. Once you get them, take down the golem camp.","type":"Helper","patch":"Kael'thas","realVotes":-1},{"details":"Prioritize specialists on this map. The bosses have a large health pool but one AA assassin (valla, falstead, tychus) can easily stop the boss push if undefended (especially in late game). In addition their siege damage is surprisingly low for an objective boss (even at 70+ skulls). Consider taking a specialist to maximize its push","type":"Helper","patch":"Kael'thas","realVotes":4}],"gardenofterror":[{"details":"Never leave an enemy terror uncontested. A second night terror can backdoor two keeps if nobody pays attention.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Decently played Lost Vikings can be devastating on this map. A Viking controlling the terror means your team can effectively fight with 4 heroes and a Garden Terror, and still have two heroes left to soak or take camps. The amount of mercenaries also makes the Vikings' talent Mercenary Lord quite powerful, since they can use it on up to three different camps pushing.","type":"Helper","patch":"Kael'thas","realVotes":9},{"details":"When controlling the terror, if there are enemies attacking you, it is usually better to run away. if you run away from the enemy team you might not destroy a fort, but it will buy a lot of time for your team to do stuff elsewhere or get picks on the enemies.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Remember that high mobility heroes/heroes that can move through units can steal seeds very easily; especially from the big camps.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"When the shamblers spawn, your team wants to control access to the SMALL camps. Basically to get ahead, you want to go for 3 out of 4 of the small camps. To stay even, get 2 of 4. The large golems can usually be traded, since when a team if focusing on one, the other can just go after the other one. \n\nSo it's in the small camps that you get ahead in seeds.","type":"Helper","patch":"Kael'thas","realVotes":5}],"tombofthespiderqueen":[{"details":"Heroes with minion quests (Azmodan, The Butcher, Auto-Attack Heroes) and wave clear work well here.\n\nSince it is a small map, gank comps can be very effective.","type":"Helper","patch":"Kael'thas","realVotes":16},{"details":"Prioritize Heroes with wave clear during draft. Good wave clear can delay a loss (which yields more opportunities to try and win) for a long time on this map, because all that any objective does is spawn large waves of pushing minions.","type":"Helper","patch":"Kael'thas","realVotes":10},{"details":"Rotate often.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Vision of the turn-in can deny the enemy heroes free drop offs. Have your tank checking them often, or a (Scouting Drone) placed to make opponent's life hard.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"If you are playing from behind, but have midlane advantage, use a patrol strategy. Make your tank check both sides, and if you have a support with scout, patrol with him to deep place scouts to know when to make a move up or down. Pick a mobile wave clearer to go up and down, safely, and let him keep farming the gems. As time progress the other team will have to be agressive to deny a free drop off. Use this to position yourself better than they think you will. Turn their \"active actions\" into \"reactive actions\".","type":"Helper","patch":"Kael'thas","realVotes":1}],"infernalshrines":[{"details":"You can bait a Punisher to jump under your fort by standing just behind the gate as long as it hasn't jumped already, allowing you to safely kill it and making your opponents' job harder. Never fight the Punisher outside of your own structures.","type":"Helper","patch":"Kael'thas","realVotes":20},{"details":"Heroes that benefit from takedowns against monsters can really shine on this map. Popular examples are valla (vault / death dealer), kerrigan (Q talents on 1 and 4), stitches (last bite). Standard plays would be to vault forward, kill a monster, vault again, get a kill and retreat immediately.","type":"Helper","patch":"Kael'thas","realVotes":9},{"details":"Ban Kerrigan","type":"Helper","patch":"Kael'thas","realVotes":-6},{"details":"When having a strong Pusher on your team (such as Zagara, Xul or Murky) and your team successfully summoned a Punisher, let your Pusher take on another lane to safely push and soak while the others escort the Punisher. This way, two lanes can pe pushed at the same time  without worrying about an unfavorable teamfight (Punisher is a good hero substitute).","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Draft area damage or quick waveclear for the shrine fights. Certain heroes, such as Gul'dan or Kael'thas can even steal the Punisher if you are pushed out of the shrine by poking in with their spells.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Sylvanas can be an excellent addition to this map when pushing with the objective. She can disable structures, giving more sustain especially to early weak punishers.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Let your tank bait the punisher behind the gates. Be careful not to stand close to him and take useless damage/CC.","type":"Helper","patch":"Kael'thas","realVotes":4}],"towersofdoom":[{"details":"Getting all of the enemy towers low then killing them all in a fast rotate is a very cheeky strategy but most high skilled players will notice this and let the tower fall so that they can just recapture this. (Malf only hero with MULE as of 1-24-17)","type":"Helper","patch":"Kael'thas","realVotes":-5},{"details":"When you have the opportunity to take both camps in bot lane, it is more rewarding (even if riskier) to take your side first, then the enemy side and then push with both.","type":"Helper","patch":"Kael'thas","realVotes":-5},{"details":"It might feel like killing forts (bell towers actually) is less rewarding on this map than elsewhere, since they can be captured back, which nullifies the XP advantage as well as the map control. However, bell towers are crucial for the momentum you have during objective phase, and they also are a surefire way to keep the enemy team busy.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"If you really dislike this map just pick Nova like I do. This way you can lose the game and nobody will blame you for trolling/afk.","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Prioritize heroes with long range poke to stall out shrines. Chromie is excellent at this, as are most mages.","type":"Helper","patch":"Kael'thas","realVotes":10},{"details":"Being aggressive is very important on this map. If you can destroy and enemy fort before they take yours, you can press that advantage for the majority of the game, and counter any push they might make with one of your own.","type":"Helper","patch":"Kael'thas","realVotes":2}],"lostcaverns":[{"details":"Push mid.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Counter-picking is criticaly important on this map.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Getting the first completed turn in is vital on this map. Since you get an opportunity to push out each lane, the enemies spiders will spawn farther away if they happen to get the next turn in, diminishing their worth.","type":"Helper","patch":"Kael'thas","realVotes":-1},{"details":"Constant easy access to Globe talents and almost always being in the presence of lane minions makes this an ideal stacking talent map. Talents like Regeneration Master, Seasoned Marksman, and similar are often worth it.","type":"Helper","patch":"Kael'thas","realVotes":4}],"braxisholdout":[{"details":"Designating a solo laner is one of the most important components of drafting for Braxis Holdout. Solo laners typically need some sort of self-sustain, moderate damage, and decent waveclear. Some of the best candidates for this role are Chen, Thrall, Alarak, Rexxar, Dehaka, Ragnaros, and Gul'Dan.","type":"Helper","patch":"Kael'thas","realVotes":12},{"details":"Competing for the waypoint can often be a test of endurance rather than skill. Often, the first team to drain the other team of their mana can both waypoints. Because of this, mana-less heroes (Chen, Zarya, Auriel, Sonya) are very valuable on this map. Don't waste your mana on abilities which won't have followup!","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Low-medium MMR tip: in many situations during objective phase on this map, actually standing on the point is crucial. Trying to first win a 3v3 brawl and then capture the spot can be worse than fighting with someone standing ON the actual spot and not get any kills (or even lose a hero), if that makes a significant difference for the objective counters.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"Ragnaros is very strong in this mode, as his ult fire wave, can either zone enemies and kill minions when pushing. Or demolish waves of zergs when defending (especially at lvl 20 with 2waves) Not only that, but his basic skills are also strong wave clear.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"Be sure to have a hero with solid wave clear. You are going to want to clear these waves quickly. Ragnaros excells here for this reason, as does Xul.","type":"Helper","patch":"Kael'thas","realVotes":0}],"warheadjunction":[{"details":"The center of the nuke does a lot more damage! Whenever possible, use the nuke so you hit with the center on a fort or keep. Early on it is safer and yields more damage if you hit the entire wall and the well though.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"If you are 100% sure that you can doing to die with a nuke : USE THE NUKE ! Waste it so the enemy team does not get it.","type":"Helper","patch":"Kael'thas","realVotes":10},{"details":"If you have a good pushing team, a high-mobility Hero with good camp clear can be a big deal on this map. For example, Anub'arak can easily clear all the camps on the map, pick up nukes, deploy them from dangerous locations, and then retreat to continue clearing camps.","type":"Helper","patch":"Kael'thas","realVotes":-2},{"details":"Most people only hit the first row of walls and towers or only the keep.\nIf you aim well enough you can hit both and have a more destructive nuke.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"If you use quickcast on all abilities, you can disable quickcast on nukes via hotkeys -> map specific abilities -> nuke.  This makes it easier to aim nukes.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"Nukes do 50% more dmg after 18 minutes so hold on to your nukes on the 17th minute!","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"If you play Auriel on this map remember to give the crown to a hero that is nuking right before the nuke hits for instant max energy.","type":"Helper","patch":"Kael'thas","realVotes":2}]}