{
  "tombofthespiderqueen": [
    {
      "details": "When going to get the boss, you should have someone turn in the remainder of the gems for objective whilst attacking the boss. If you are attacking the boss before the objective gets turned in, he wont phase out. This will result in a massive top push, and more for your foes to defend against.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 12
    },
    {
      "details": "Push -> Gank, map is tiny.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 12
    },
    {
      "details": "Zagara Creep Vision OP",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 12
    },
    {
      "details": "Control of the eggs/shrines is key.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 14
    },
    {
      "details": "don't be scared of the webweavers they are actually pretty damn weak! you can take them down with one or two heroes easily so split up when defending to get all 3 down.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 24
    },
    {
      "details": "You can’t “sneak” gems the same way you can coins, rather you “farm” them in lanes, so having good lane control is more important than jungling. Along these lines, with all the lanes close together, it’s a good map for ganking. I like to put a tri-lane mid, with someone with CC bot. Diablo is good in this position because he will get pushed in, but he doesn’t use his CCs to clear, so he’s ready when you gank for him. The reason you favor bot over top in this fashion is because fatties are bot, and make for an easy pick-up after the gank. -- CarlTheLlama",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 36
    },
    {
      "details": "If you play Gazzlowe you can solo boss at level 10.  ROBO-GOBLIN OP.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 15
    },
    {
      "details": "Much like Blackhearts, hoarding gems can lead to more efficiency with them late game, with some key differences. (1) Webweavers divide their push across all lanes, which can get you all of the enemy team’s taps on (potentially) a single turn in, and that’s a big deal for giving you mid and late game power. (2) Gems are far more loseable than coins, if you die with them more than half the time you don’t get any back, since kills don’t return gems like they do coins. (3) There are two turn in points, making it generally easier to turn in so that you don’t have to lose gems. (4) Unlike cannonballs, webweavers scale with game time, so while saving gems for a late game turn in does technically give you more efficiency, percentage wise it’s not as rewarding as hoarding on Blackhearts (assuming you push down forts yourself so that cannons push the keeps). -- CarlTheLlama",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 21
    },
    {
      "details": "Take Azmodan > Bribe > Go bottom Lane. Spam (w) skill, globes here and there to control the lanes and just win by pushing hard. Remember to always get the bribe off on bottom siege Mercs, whenever it is up (Merc buff at lvl 7 Optional).",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 23
    },
    {
      "details": "Think of the webweavers as getting three merc camps at once, one in each lane.  They can do all right on their own, but become infinitely better when given support or used to split the enemy's attention.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 29
    },
    {
      "details": "I have 100% winrate on this map as nova. 3k mmr. just saying. :)",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 12
    },
    {
      "details": "Get your team to deposit gems at the top turn-in, then take the boss before/while the webweavers are descending.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 144
    },
    {
      "details": "Webweavers slowly time out, like a Garden Terror’s W, so if you see one at low health on the opposite side of the map, it’s not worth your time to go finish it off. -- CarlTheLlama",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 67
    },
    {
      "details": "The best way I’ve seen so far to capitalize on webweavers is to get close to a turn in (maybe be 5 gems short) then wait until you get a kill to get the last turn in, and then get a merc camp before weavers spawn to overwhelm a lane. -- CarlTheLlama",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 58
    },
    {
      "details": "Murky in his current form rocks at this map. Push top lane constantly then get the boss for a single lane win.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 24
    },
    {
      "details": "Remember the hardcamps when spiders get active. Hit them before they disappear and get them. If enemy is going for hardcamp at this time the hard camp does not disappear from the map, revealing their position.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 28
    },
    {
      "details": "Two tips in one: 1) Try to assimilate 1 of the two turn in points for your team. Patrol it whatever. 2) view your talent report screen often & note whos got gems & how many. \n\nWhat all this can tell you is 1) certain players might avoid collecting gems, or otherwise be far less aggressive with it. 2) Some players sneak their turn ins, while others demand bodyguards. 3) there are often cues that coincide with turn ins. Hero placement, or a bruiser camp launch for a distraction. \n\nIf you can predict the time, place, & formation of the opponents turn ins, than a close game becomes a not that.  Of course, none of that works if one team is rolling the other.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 4
    },
    {
      "details": "Try to mitigate the push of your lane, before the first wave of web weavers. Early on, only attack minions when they have pushed past the halfway mark of your lane. This allows you a safe distance to collect gems, and requires the enemy heroes to expose themselves to pick up theirs. A two man gank squad can capitalize on this overextension, will force a drop of whatever gems are picked up, and can also rotate between the two shrines preventing any turn ins. At first turn in any spare heroes should capture bottom siege giants and push bottom lane. Maintain one hero to other lanes during first  web weaver push to get xp and collect gems, avoiding any fights that are not favorable.  Three champs push bot lane with web weavers and siege giants for first fort of the game.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 92
    },
    {
      "details": "Keep in mind the webweavers spawn as far as the enemy minions are, or at the next town if there's no minion wave. So if yours are spawning, clear your lane as fast as possible for a better push.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 45
    }
  ],
  "dragonshire": [
    {
      "details": "Abathur and Falstad can both be used to quickly capture undefended shrines on the opposite end of the map. Zagara's Nydus Network can also be used in this manner.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 15
    },
    {
      "details": "Sgt. Hammer is a great pick, for it can deny the enemy capture the shrine!",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 16
    },
    {
      "details": "When capping the shrines, always have two groups of people to cap (i would recommend two per group) and then zone the enemy team from the shrines. Always keep someone mid to cap the DK. Once the person has become the dragon, every one should b-line towards the dragon push and help him. DK pushes are most effective when pushing w/ him. However, dont try to solo anything without help, as the dragon knight is a glass cannon unlike the golems or the terror.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 18
    },
    {
      "details": "Zagara's portal ult can really come in handy to quick cap the shrines while the enemy is busy.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 8
    },
    {
      "details": "Do not kick away Sgt. Hammer as the DK, she will thank you for getting her out of a bad situation.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 16
    },
    {
      "details": "Don't stay behind dragon knight on the enemies' side, as he could kick you to their tower.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 15
    },
    {
      "details": "The Dragon Knight, while being a pusher, lacks the Garden Terror's plant but has the kick. Thus, when playing as the DK, targeting players with a few basic attacks and/or a kick, is quite viable. Also, make sure to use your kicks a) on tanky and/or slow units that you don't want to be in the fight, and b) on units just about to die. Do not overestimate its damage though - that is a mistake a lot of people make, only kick low health targets when they are around 150 health sort of low (can't stretch enough how important this is). If you're not sure, basic attack them instead! The kick can also be used to great efficiency when some sneaky assassin tries to get a pick behind you as you are pushing, as they'll end up around your towers and in serious trouble (exception: stealthies).",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 1
    },
    {
      "details": "NEVER use the DK kick to try to last hit an opponent.  -Tadius",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 89
    },
    {
      "details": "You can use a timely cleanse to avoid a dragon knight kick!",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 40
    },
    {
      "details": "If you are the dragon knight, don't suicide into the enemy team to get a few whacks at a fort.  Your team needs to support you.  Likewise, remember to support your friendly neighborhood dragon knight so it can start doing ridiculous structural damage.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 167
    },
    {
      "details": "Always try to have someone roaming between the towers and the Dragon Knight when the towers are up, so you can either: disable someone from capturing the Knight for long enough to contest a tower and capture it; or keep a tower on your side so someone can capture the Knight.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 11
    },
    {
      "details": "Stuns can be used to cancel the dragon Knights kick. If you see him winding up to punt one of your team hit him with a stun.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 75
    },
    {
      "details": "The Dragon Knight's kick can be used to split the enemy team; kicking an enemy character back into/beyond your own team can set them up for an easy gank.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 11
    },
    {
      "details": "If there is a choice, the Dragon Knight should be captured by either The Lost Vikings, a Warrior hero, or hero with an easy escape (Zeratul or Tassadar). Supports should not take DK if there is an option (Tassadar being the exemption). -Tadius",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 62
    },
    {
      "details": "Please dont kick away low opponents with the DK. Its a skill that should be used to kick away FULL healed opponents (tanks at best) to zone them out. If you use it on low HP enemies you'll just save them!!\nAlso when being the DK please clear the creep first with ur Q instead of walking into 5 enemies a full creep wave and 3 towers without any support and then type in chat \"I PUSH\"...",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 138
    },
    {
      "details": "In the early game, having three heroes on the bottom lane makes it easier to contest the bottom-lane mercenary camps, which are both greater in number and easier to take than the ones between the middle and top lanes.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 28
    },
    {
      "details": "If you are low on health or mana when your team takes the Dragon Knight, it may be best to go into a lane that your Dragon Knight isn't. This creates a nasty predicament that the enemy has to answer to. Do they go for the Dragon Knight and force it down, but allow you to soak more XP and get farther ahead, or do they spread out to remove stragglers but risk the Dragon Knight destroying forts? Going with the Dragon Knight can make it very easy to think you are more powerful or safer than you are, and give them another target to converge on once the Dragon Knight has been defeated.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 50
    },
    {
      "details": "If you get an early weak dragon the best uses for it are. \n1) easy minion clear. \n2) moonwell sniping. The passive walls go down with 2 or 3 hits from a weak dragon & the moonwells aren't much tougher.  An early dragon might not get 1 full tower but the same dragon could get 2 fort moonwells. Thats a big get. It decreases the oppositions sustain in the center.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 14
    },
    {
      "details": "If you have Murky or a Diablo with 100 souls they are the best users of the DK. Even if they die they ll be back a few seconds later.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 50
    },
    {
      "details": "Dragon Knight explodes does a little amount of dmg to structures as well as pushes enemies to different place.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 12
    },
    {
      "details": "At the 20:00 ish mark, the DK damage is so strong that you can either choose to help wiping your enemy with basic attacks (you know the normal big axe attack) rather than just focusing on a fort, or diving directly to the core. It may even help you secure a team wipe.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 13
    },
    {
      "details": "From approximately level 1 to 10, its not as important to get the dragon knight right away. the dragon knight is relatively weak, and gets stronger the further the game progresses. a useful strategy is to hold at least one shrine, to prevent the enemy team capturing the dragon knight. and in the meantime look for 1. Lane Xp, 2. Hero kills, 3. Mercenary camps.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 104
    },
    {
      "details": "Fort attacks slow the dragon knight's attack speed. Unless your dragon knight has low duration left, it can be worth it to push minions in to tank fort attacks so that you can attack it at full speed.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 55
    },
    {
      "details": "Diablo can hide behind his walls, then overpower the DK into the fort courtyard, placing the DK trapped alone & in range of 4 cannons. Support this gank & make sure the hero dies too.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 9
    },
    {
      "details": "IN this map, teleporters are the best (Dehaka, BW, Falstad). Use them to unbalance a fight over a shrine",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 5
    },
    {
      "details": "Punt dolls toward your base cannons whenever possible.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 10
    },
    {
      "details": "Fight",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 7
    },
    {
      "details": "Dragon Knight CAN be thrown with a Haymaker ult, or any knockbacks for that matter. Use these to push a DK away from your forts and keeps or to throw him into a Hero that can stun him. Dragon Knights that can't deal siege damage are rendered useless for a good few clutch seconds.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 20
    },
    {
      "details": "Can't capture both shrines? Just try to capture one avoid Dragon Knight being taken, then pushes the same lane as 3-4.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 21
    }
  ],
  "cursedhollow": [
    {
      "details": "If YOU aren't getting the boss as you run past, you can bet your pretty little core the enemy team will.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 3
    },
    {
      "details": "If the tribute spawns, and you know the enemy team are not nearby (none missing) and your team don't need you for a teamfight don't be afraid to ninja the tribute with a mobile character such as Falstad.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 24
    },
    {
      "details": "In contrary to what people seem to believe, when you get a curse GO FOR BOSS. It's so great on this map because you will have an easy and uncontested boss since your opponents have to defend (if they don't, you'll see it and can react accordingly - even if you retreat its no waste, because they didnt defend!) and then they have to defend that boss and you can just go ahead and take the other boss. Optimally you take some of the creep waves while doing your rotations. This is much better and much saver than just go ahead an push.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 35
    },
    {
      "details": "Push enemy fortifications during the curse; this allows you to quickly take down structures and soak extremely weak enemy minions. It puts a lot of pressure on the cursed team.\n\nIf possible, make sure there aren't any enemy mercenaries obstructing your lanes during the curse; if there are enemy mercenaries in one lane, and you can get to it easily, that is the lane you should push after killing the mercenaries, because it will give you a large minion wave.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 12
    },
    {
      "details": "Setting off mercenary camps immediately prior to tribute fights creates a lot of lane pressure while the team fight for the tribute is going on; taking a boss when you are at 2/3 tributes is especially powerful, because the boss will push a lane while you are fighting for the tribute, putting the enemy team into a very bad situation.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 38
    },
    {
      "details": "Something I like to do on my favorite heroes: Raynor and Illidan is to soak bot lane, contribute to the tribute (eh?) then push mid with allies. If at all possible I try to gank a hero unaware then go back to soaking, when all of the enemies are dead I do boss with allies. Try to look for opportunities by taking mercs then split push and single off assassins, supports and specialists to maximize your push to keeps and the core.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 11
    },
    {
      "details": "Boss specific rules: \n1) rule of '3'. Enemy dead for 20+ seconds = 1. Up a talent = 1. Up a level = 1. You must add up to 3 before you even consider a boss. \n\n2) Never ever take a boss when you don't have map control vision around it. If you dont have minions over half the map, then you wont see the gank coming on the close boss. You need 80% of the two lanes around the far boss, & if you cant see the enemies on the mimimap, then its a safe bet that they are really really close. \n\n3) If you are ahead in levels. & have map control over 80% of the map. WTF do you need a boss for? It will do nothing except give the losing team a chance to win.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 6
    },
    {
      "details": "I like to go bottom as my two favorite heroes: Raynor and Thrall, because I can get huge xp contribution done there. I try not to worry about the first tribute, but if my allies need me, I will help. You best start caring till 2/2 when the heat starts to rise.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 12
    },
    {
      "details": "This map is the most \"tactical\" map in the pool. (Tactical does not = strategic) \nGood decisions will have good but subtle impacts, & the losing team usually just blundered one more time than the other team. Meta is often pretty stupid on this map. \n\nBasically, it comes down to mercing. Boss included.  The rules stand regardless of the tribute & curse situation. Rule 1) dont abandon a lane to merc. Ever.\nRule 2) if you ever lose a structure to minions, literally facepalm getting strong contact between your wrist bones & the bridge of your nose. Repeat for every time this has ever happened to your team. (Curse time exempt) \nRule 3) if you cant solo merc, mercing is not in your jurisdiction. So you may support, but may not initiate including pings. \nRule 4) If all structures are not safe, dont merc.  \nRule 5) when you get a merc camp. Follow it. If you see unsupported mercs. Support them. \nRule 6) if it takes more than 3 heros to merc, dont merc. \nRule 7) ( in comments)",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 19
    },
    {
      "details": "When you get a curse, don't go for a boss unless it's late game.  You could be doing other productive things, like soaking the die-crazy-fast minions and tower diving hapless enemies.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 89
    },
    {
      "details": "If you have just reached 2/3 tributes, make sure to take boss if it's a good opportunity. The 3rd one will spawn right after taking boss, and the enemy have to choose between the 3rd tribute and the boss. Then, after taking the 3rd one, curse is up, meaning keeps/towers can't attack the boss.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 37
    },
    {
      "details": "This is Sylvanas's worst map because her trait is redundant with the curses. While she is an excellent split-pusher, frequently you're better off using someone who is better at straight up pushing.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 38
    },
    {
      "details": "Cursed minions can be healed; area of effect healing effects, like Uther's Holy Radiance, can make your minions more capable of fighting.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 40
    },
    {
      "details": "The location of some Tributes can be predicted.  There are 6 possible locations, 3 on the top half (left, middle and right) and 3 on the bottom half (left, middle and right).   Every three tributes will occur in each of the three columns (left, middle and right).  No 3 consecutive tributes can all be on the bottom half or the top half.  So, for example, if the 1st tribute is bottom middle, and the 2nd is bottom left, the 3rd must be top right.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 142
    },
    {
      "details": "Sgt. Hammer should generally occupy the middle lane.  If Hammer is in the bottom lane when a tribute appears at the top of the map means she will likely be late to the fight.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 71
    },
    {
      "details": "Never hard contest the very first tribute of the game. The majority of the enemy team will likely go to the tribute, so that gives you at least 30 seconds to get some exp and possibly siege damage.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 7
    },
    {
      "details": "If you have no chance of contesting a tribute, grab as many mercenary camps as possible during that time; this is especially important if the enemy team is going to curse your team, because the mercenaries can fight off enemy minion waves.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 23
    },
    {
      "details": "This is a big map so global presence is very helpful. Heroes like Brightwing, Falstad, ETC, or Illidan gives you a huge team advantage. Also keep an eye out if your team has these heroes, they might teleport instantly to your location.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 54
    },
    {
      "details": "Always remember that the first tribute isn't worth it. There is no sense in going second to the fight and losing it, if it spawns near your enemy just push their lanes.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 111
    }
  ],
  "skytemple": [
    {
      "details": "raynor",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 10
    },
    {
      "details": "rayor",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 12
    },
    {
      "details": "Exactly",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 10
    },
    {
      "details": "This is my highest win rate map. Only reason I can think of is that people get so confused as to what to do, so as long as your not terrible and pay attention, you should do alright.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 8
    },
    {
      "details": "http://www.teamliquid.net/forum/heroes/481334-heroes-map-guide-sky-temple",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 14
    },
    {
      "details": "abathur is op on this map",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 12
    },
    {
      "details": "When the first to temples spawn at middle and top, its clever to cordinate with your team. Splitting up and getting both shrines isnt as important in the early stages of the game. therefore focus on one of the two shrines, and let your (solo bottom player) if you have one that is - soak the lane xp in bottom lane. But if you see an opportunity to get both or noticing a weak or injured enemy shrine contest, then go for it!",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 40
    },
    {
      "details": "Put heroes with high mobility like falstad or Brightwing on the bottom lane, it allows them to soak up bottoms exp for longer and still get to the first temples.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 93
    },
    {
      "details": "In a situation where you get outplayed on the first 2 shrines, and your enemy takes the most power of it, try to coordinate with your team and push a keep. This way you won't be that much behind on buildings.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 7
    },
    {
      "details": "I could write a post-doc thesis on this map. To keep it short, the key to this map is... Minions. \nI guess thats true of every map in a way, but basically this map is very tilty because the objectives pull you out of lanes, but the temples don't really do much more damage than a strong push. So there are 2 equal ways to die. \nOn top of that, there are tons of choke points & ambush points. Vision becomes critical & the vision minions provide in particular really starts to matter. Many players will walk right over a minion wave & give away their state & condition. Now you know whos coming to your temple & when they will get there. Which direction, everything. You can kinda ignore the minions & boil it dow to '1Rule'. \"The first team to lose a keep will probably lose.\"  This is because you get a catapult after you score a keep, & that catapult will gradually give you map control. Once you lose map control here, you cant even safely make it out to a temple.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 16
    },
    {
      "details": "If you go to contest a temple that has enemies in it make sure you are, at least, one more person than them. This means 5v5 is not a good idea (unless your team is *way* better at teamfights). This also means you should know how many enemies are on a temple (by counting faces on minimap, an sthealthed ally scouting, Tyrandes owl, or whatever). If you aren't (at least) one more than them you'll become food. If your teammates are becoming food in such a fashion: forget the temple. Temples are a nice advantage, but it doesn't matter if you lose 1 or 2 temples in the game, push hard with mercs in other lane to compensate the temple lost.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 10
    },
    {
      "details": "After the very first two temples, wait a bit then get your top mercs, then head bot for the bottom shrine spawn. The mercs add a lot of lane pressure while you are fighting for the shrine. Win/win.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 79
    },
    {
      "details": "The first temple guardian is the toughest (duh), the second and the third wave are easily soloable by most heroes. Unless there are stealthers around looking for a quick kill, consider letting someone capable of soloing the temple (like a specialist!) fight off the last two of the three waves while you join your teammates for an old fashioned gankfest. Never leave Nova or your only tank or healer behind to fend for themselves!",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 21
    },
    {
      "details": "The first two temples are always the same.  The first set is the top two temples, then the second is just the bottom temple.  After that it becomes a little more randomized but still follows some patterns.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 145
    },
    {
      "details": "Setting off mercenaries in lanes far away from the temples generates split-push type situations, and setting off the boss prior to the temples activating creates a powerful split push which makes it difficult for the enemy team to successfully contest the temples.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 21
    },
    {
      "details": "Killing the enemies that spawn on the shrines doesn't make the shrine lasers fire any quicker and is not required to obtain the full objective. All killing the enemies does is stop them from damaging you while the shrine is active. For this reason, it's really not worth it to burn any useful cooldowns that you might need to fight the enemy team if they try to contest.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 42
    },
    {
      "details": "Keep in mind that as soon as the temple starts its charge animation for the last five shots, you don't need to stand in the circle anymore.  You can leave and all five shots will still fire no matter what.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 106
    },
    {
      "details": "After a templed fires its last shot, the next set of temples will be available for capture in 2 minutes. Plan your teamfights and merc camp captures accordingly.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 106
    },
    {
      "details": "The boss is a trap. Let it be your trap, not the other teams. \nIts right in the middle of the map, everyone who's still in the game can see it. Its surrounded by high traffic & ambush points. You cant sneak it, you can only take it when the opposition is already beaten back (meaning you can probably get better results pushing a keep in that moment) The only thing its good for is baiting an idiot. Another thing, its easier to defend (claimed or free) than it is to claim. I cant remember even 1 single game when this boss early marched to core & victory, but every week a i see a team with a lead get ganked & lose on the spot. THIS BOSS IS FOR CHUMPS. & those who already won anyway.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 15
    }
  ],
  "blackheartsbay": [
    {
      "details": "Prefer to have at least 1 hero with good survivability to get the coins like johanna or diablo.Ambushers liek zeratul and nova are pretty common in this map and having a squishy hero with more than 10 coins can be very dangerous unless he has good peeling from his team",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 1
    },
    {
      "details": "\"\"\"\"Don't hoard coins if you're a squishy hero, one misplay and the tides of the match can change. \"\"\"\"\nFALSE\n\nYou don't want your squishy damage dealer of your team (Valla?!) to cover your ass while the whole enemy team is gang banging her, while the fat Stitches/Diablo?!?! (who can zone and tank the damage) is turning the coins, right?",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 20
    },
    {
      "details": "With an organised team, aim to collect coins on one or two separate characters. The less people taking time channelling coins the better when the enemy comes to interrupt.  Learn the spots the coins appear, and have them stand there when camps are captured or chests attacked.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 37
    },
    {
      "details": "remember turning in coins is not the only way to effectively win the game. You can win by pushing lanes too with siege camps, and mercenaries on the bottom or pushing with mercenaries and boss on top. Just make sure you look at the coin count for both team because turning in is better or defending is better than pushing with boss or camps.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 30
    },
    {
      "details": "You can focus on other objectives to keep the cost of turning in coins for later game down. Allowing for a extremely cheap and quick finisher of an enemies base while retreating.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 15
    },
    {
      "details": "When your teammate is ready to turn in coins, make sure to cover their flanks for them--even if you don't have any coins! Place yourself just far enough out so that your line of sight / circle of vision can provide some extra vision for them, if they can see twice (or thrice if you have two heroes assisting ) as far on the flanks survival rates significantly will increase and everyone will be happy.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 13
    },
    {
      "details": "All mercenary camps drop 2 coins upon death. Kill the buccaneers and then the sieges next to them!",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 13
    },
    {
      "details": "You can win this map without collecting coins and just focusing on stole them from the enemies",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 10
    },
    {
      "details": "If you know or strongly suspect that the enemy team are waiting in ambush for your team to turn in coins, and your team perhaps is one man down, have to many coins to loose or at a disadvantage (lower lvl, bad comp for fights), go soak XP in lanes instead of loosing a mismatched fight and lots of coins. After a little while the enemy will have no choice but to go back to lanes, or they will loose too much XP. Then you can safely turn in coins at a later point in time.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 3
    },
    {
      "details": "if the towers in mid lane are with \nhalf health, the keep will fall with the first pay.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 12
    },
    {
      "details": "The Boss camp above the top is very isolated from the rest of the map, so if you are unable to fight the enemy directly, and know they are turning in doubloons, capture it if possible in order to create some counter-pressure.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 87
    },
    {
      "details": "When the chests first appear, let the enemy go towards one, set up for a lockdown, and kill (also earning you the coins). -Shardonn",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 28
    },
    {
      "details": "You can win without really pushing into your enemy's territory if you prioritize coins and the turning in thereof.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 186
    },
    {
      "details": "Don't hoard coins if you're a squishy hero, one misplay and the tides of the match can change.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 68
    },
    {
      "details": "Don't be glued to lanes. They are still important, but getting a couple of pirate shots at your enemies will get your team more EXP.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 64
    },
    {
      "details": "Zeratul's void prison will help to deflect cannon balls from structures. The cannon hits the structures in the same pattern: middle fort, top, then bottom. Wait for the structure to get marked as a target then void prison.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 85
    },
    {
      "details": "Don't carry coins as Murky...",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 345
    },
    {
      "details": "Always let the tanks carry most of the coins, because they can take lots of punishment at the pirate.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 20
    },
    {
      "details": "In very broad terms, this map will provoke teams to play in one of two potentially successful strategies. Both can work.  \nBlackhart strat 1) \"omni presence.\" Basically 5 highly mobile dolls are selected that can all solo a bruiser camp by 10. They go forth & collect coins while avoiding teamfights.  Blackhart strat 2) \"camp & ambush\". A fairly standard, but sometimes specialized comp of dolls will linger over the area in mid from vision tower to lower chest spawn. The object will be to secure the turn in point full time & get coins from team battles, ganks, & chest spawns. \n\nFor strat 1) a) you dont need a standard comp. Not having a healer or tank can work. B) you dont ever \"need\" to turn in. You can win by merc pushing keeps & core. Maybe with a few bosses occasionally. \nFor Blackheart strat 2) you dont need vision talents & traits. You can deduce what you cant already see. \nNote: rarely are games as black & white as i describe above. Most teams will do some of both.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 16
    },
    {
      "details": "Each small tower takes two cannon shots.  Each cannon shot does just over half the tower's hp.  If you see a tower at 3/4+, try to get it at least to half before a turn in so you can get an extra shot on a fort or keep instead.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 66
    },
    {
      "details": "The very first chests appear on the map at 0m50s. They have enough coins to start the bombardment.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 146
    },
    {
      "details": "Protect players carrying large amounts of coins - ideally they will be very mobile heroes or heroes with a great escape. When you want to hand in coins make sure you bring teammates to cover you, and similarly if the enemy is trying to hand in it is a great opportunity to teamfight as they stand to lose coins you can immediately turn in if you win the brawl.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 103
    },
    {
      "details": "Chili cheese chode",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 14
    },
    {
      "details": "vision is very important on this map. farsight, scouting drone, zagara's creep are all good ways of getting vision",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 26
    },
    {
      "details": "Build more pylons.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 21
    },
    {
      "details": "When your team is protecting someone who is turning in coins, don't simply stand next to him. Try to position yourselves at a distance, between him and the most likely position of enemy heroes. This way, they cannot get close to him for interrupting without taking a lot of damage.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 106
    },
    {
      "details": "Attacking a chest always does 1 dmg per attack/ability. High attack rate heroes/abilities or channeled abilities are best for destroying them quick, such as Azmodan's All Shall Burn. Keep this in mind before you blow all of your single attack cooldowns, which you could have used to protect yourself from ambush.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 28
    },
    {
      "details": "Tracer can take a chest in no time",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 11
    },
    {
      "details": "-Avoid teamfights when enemies have talents advantage. \n-Avoid teamfights when you got more coins on your team. Try to do objectives or push lanes instead of gambling your coins and losses teamfights.\nIt's not necessary to teamfights on this map which is more about turning in coins and win, so don't find yourself a trouble when you have talents and coins advantage!",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 16
    },
    {
      "details": "Take vision (if possible), get chest first, and proceed to soak and survive till the teamfight boils",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 10
    }
  ],
  "hauntedmines": [
    {
      "details": "The golem in the mines provides as many skulls as all the little skeletons combined do. It is optional to kill the golem then leave the mines to push as the actual golems will be equal strength.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 12
    },
    {
      "details": "Plan carefully when to capture your siege giant camp. The good timing is when the first golem leaves enemy front gate or when it is near the entrance to the mines. The siege giants do a lot of work while defending the golem but they need to be protected behind your wall to do the best job.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 91
    },
    {
      "details": "If you have substantially less skulls than your opponent, ALL DEFEND. Burn the golem down as fast as you can, and then figure out what to do next.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 45
    },
    {
      "details": "Most important things here:\n- Go for a 1/4 split, where 4 go to the golem lane and 1 defends the oppoents' golem lane.\n   -> Tassadar is especially great for this 1-man-lane (remember he will most likely be 1v4 if your opponent is also doing it correctly), because of his ability to shield buildings and his great wave clearing (W).\n- In the mines the middle packs on the left side give the most skulls. You should always aim to go the first.\n- Despite some believe the Siege Giant Camp is MUCH MORE important than the middle one! It heavily helps defend the golem, whereas the bruiser camp really only pushes the wrong lane (normally you want to take down  the golem lane as soon as possible and want to win through that and the bruiser camp always goes to the other lane). You must time it so that the Siege Giants stand outside the base just coming from the jungle, being able to attack the golem that is attacking your wall with their range without being attacked by creeps or the golem skill",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 27
    },
    {
      "details": "Haunted Mines is a scary map.  If you scare easy consider not playing this one.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 22
    },
    {
      "details": "Sylvanas is amazing on this map.  She should always be pushing with your golem if possible to disable turrets/forts.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 80
    },
    {
      "details": "Consider healing up before going into the mines - it's much easier to win unexpected teamfights when your team is full health.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 28
    },
    {
      "details": "This map can be won even if you  collect no skulls only if you have made a specialist to squish towers in the golem's path. It's worth if the specialist dont even go to the mines and remains depleting towers",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 11
    },
    {
      "details": "If your drafting and the other team gets sylvanas a counter to her insane lane clear is rexxar.  His lane clear at level seven is actually faster and less mana intensive with the prey talents build, and he is great if you can get him in Mines early and clear the two biggest skull clamps before bailing and grabbing camps topside",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 5
    },
    {
      "details": "If you fail to get the most skulls. Dont fail to get the most mercs.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 10
    },
    {
      "details": "Consider taking Demolitionist or Mule, even if it's not in your usual build.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 39
    },
    {
      "details": "Always gor for the two middle groups on the left they have by far most skulls ( around 30) best effort/reward ratio",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 133
    },
    {
      "details": "The optimal time to capture your Siege Giants for the first golem is after the golems walk past the mines entrance. This ensures your Siege Giants will be behind your gate DPSing the golem and will not get hit by the golem AOEs.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 27
    },
    {
      "details": "Don't die while the \"Mines Countdown\" is going - this means you will be very late to the mines",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 66
    },
    {
      "details": "Typically the lane split for Haunted Mines if \"4 with golem, 1 non-golem\". You can see what lane your golem will spawn in by the icon on the mini map and the big pile of glowing bones. Your non-golem lane should be held by someone with good wave clear and hopefully a good escape (like Valla). The solo laner MUST NOT DIE. If they're pushing into the towers, fine. Do what you can but DON'T DIE. If you die, you aren't soaking the XP which is devastating. If the golem lane is going real well and the non-golem lane isn't send someone down to help out the solo, then have them come back when things are under control again. You can't win both lanes, but as long as you're pushing the golem lane and soaking the non-golem lane, you're doing fine.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 54
    },
    {
      "details": "Mines open 2:00 mins after the last golem on the map was destroyed. 45 Seconds prior to mines opening return to base and refresh health/mana if you haven't been watching your damage and spell use. Save your well tap for potential quick returns if you need to get out. - Tadius",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 67
    },
    {
      "details": "If you have substantially more skulls than your opponent, PUSH - all 5 of you. Forget defending, just push. Your fort will defend itself and your opponent will be forced to full defend - if they don't, they lose.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 56
    },
    {
      "details": "It's okay to get 50/50 on skulls. It's not okay to keep running into the golem in the mines over and over and dying. If the opponent has 5 men in mines and you have 40+ skulls, GTFO and go back to laning/pushing/capping minions.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 134
    },
    {
      "details": "The reason the 4-1 split is often used on this map (the common lane split for Haunted Mines is \"4 with golem, 1 non-golem\". You can see what lane your golem will spawn in by the icon on the mini map and the big pile of glowing bones.) is because of the towers. The lane with 4 persons (where your golem will spawn) should try to kill at least 1 of the towers before the mines open. This can usually be done but only if all 4 players work together and attack the same tower. It's even OK if 1 or 2 people die while doing this.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 25
    },
    {
      "details": "On the first mines open, try to tap the well when the countdown is around 10 sec to go. Whoever is freshest and in the mines first has a big advantage.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 23
    },
    {
      "details": "Tassadar is a great defender on this map. His Reinforce Structures talent (+100% shield on buildings), low Q cooldown, and relatively fast wave clear ensures minimum damage from the golem and waves.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 48
    },
    {
      "details": "What happens in Durotar chat, stays in Durotar chat.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 5
    },
    {
      "details": "Try not to spread out in the mines. Its much easier to win the inevitable team fight that happens and then gather free skulls than it is to lose three people and try to scavenge. So many games are lost to players spreading, then all dying as the enemy team packs around.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 16
    }
  ],
  "gardenofterror": [
    {
      "details": "Butcher's Meat stacks heal the Terror.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 19
    },
    {
      "details": "When you are the plant, you want your pot to linger as long as possible. \nTry making defensible spots for it. Stick it in corners & stand over it for as long as is safe. Dont spam & run around unless there is something ligit to run from. 1 plant can eat a whole wall if nurtured.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 5
    },
    {
      "details": "The moon wells on the top and bottom lanes can be easily sniped by Azmodan. Just throw a globe or summon a demon warrior to gain vision, then use All Shall Burn to melt them down.\n\nThey can be sniped by other ranged heroes, but will need a way to gain vision (either a scouting drone or with Nova or Zeratul as a spotter). The moon well next to the shamblers will be in range for most ranged heroes. However, the moon well on the side next to the bruiser camp will be slightly out of range for almost all.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 6
    },
    {
      "details": "I am so sleepy.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 10
    },
    {
      "details": "Zeratul is a fantastic Garden Terror driver.  Stealth in the middle on top of dragon, take it, when it dies, blink and if you need it use first aid.  It's worked every time for me.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 14
    },
    {
      "details": "If you are a massive plant and start running between lanes with enemy heroes chasing you, try to take route through narrow corners, where you can put your Q right behind you, so they would have to get CCed (lower movement and no AA), wait till your Q vanishes or take different route that will take longer time. Anyway, you gain advantage over them.-. IzZzack",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 24
    },
    {
      "details": "When playing as the terror, always use the plant (W) when it's off cooldown. If a fort is not defended, place the W between the gate and the fort, so that it catches the most buildings. If there are enemy heroes to kill the plant off, consider placing the W in the lane, just in range of the gate and two towers, so that they have to leave their base to defend.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 61
    },
    {
      "details": "If you get a terror just after nightfall, it can be used to damage forward bases (W) and assist your team in gathering seeds by poly-morphing (Q) enemies or even tanking a bit. This can make a big difference if the other team is over-aggressive/harassing instead of taking down the other shambler. If it's early/game, you could get a plant (W) down in each camp (2 in one of'em) and the kill-drops from both shamblers. Plants in each lane will also push your minions to their doorstep.\n\nAgainst a conservative team, you can still get 2 plants down to take out forts in two lanes and a quick shambler kill. In either case, the other team will be gathering seeds at night, so your 'Terror' and its plants are less likely to be attacked.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 1
    },
    {
      "details": "Please don't chase enemy heroes when you've killed one side of the garden - remember that even if you've gathered your first 100,  you will need them again - don't leave seeds around for other enemy team mates to collect.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 3
    },
    {
      "details": "The pace of this map is pretty quick, but stay cool & smooth. In your down time, get ONE merc camp & push with it till its spent. That should kill your time & get way more value than spamming unsupported camps. In fact spamming unsupported camps can kill you on this map. You dont get crap for exp while doing it, but your opponents will get tons for killing it on the other end.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 6
    },
    {
      "details": "Enemy team chasing you? Go inside a bush, leave a polymorph plant. They won't see it coming. Oh, I'm sorry you're a 20 minute garden terror? Only 1 hero is chasing me? Go whack them you'll do 1000 dmg per whack otherwise, run.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 8
    },
    {
      "details": "Please use the Garden Terror to push forts and not to collect more seeds (kind of beats the whole purpose of collecting them the first time around,) Due to the pressure you bring to the opponents base you'll (most likely) force a team fight and the seeds will still be there when you're done. If for some reason your team won't / can't follow you, simple swap between lanes to keep your opponents busy and still take down a good chunk for their defenses and get the lanes pushed. It seems obvious but too many players take the terror and either run for random ganks or collect more seeds.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 31
    },
    {
      "details": "While the night is on and you're trying to gather the seeds, consider not to split up unless you really know what you are doing and your team does as well. Normally it is better to rotate with all 5 man to one of the bosses, so you split the seeds with the opponents team that does the other boss. If you are with 1,2,3 man and run to a boss and see the entire enemy team attacking it consider to rotate to the other side and NOT run into them because you feel thats what you have to do. If you do it your 1,2,3 man squad will get killed and then most likely the rest of the team wasn't able to claim \"your\" boss in time after the opponents finished theirs and rotate to the other one.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 35
    },
    {
      "details": "If your team can't help you push one lane as terror just run between lanes, placing flower behind the current gate. It won't be as effective, but will give some decent gamage.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 80
    },
    {
      "details": "Please don't run past 3 waves of opponent creep while running from your base to the opponents. Use the W to clear the lane - this will help the rest of the team to help you as they don't have to clear the creeps anymore. Also there is no reason not to do it, because your Cooldown will be up by the time you reach the enemy base. Additionally if a lane of yours is being pushed very hard by a big creepwave and/or mercs and you just took the plant, consider not to carelessly run straight to the opponents base, but use a path which goes over that lane, so you can clear it within a second with your W and then rotate to the opponents base.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 57
    },
    {
      "details": "This will be the best advice of your life: Use Lunara. She kills the enemy Terror VERY effortlessly. Solo even! Unfortunately the enemy terror will plant some pots but don't worry, the terror will be gone quickly. Leave the pots. Your objective is to kill the Terror. The sooner the better. Leave the pots for your teammates to kill.  I often find myself defending the Terror by myself but thats ok because that lets my teammates do other things.  When it sprints just activate your W ability and watch it get slowed. It can't get away. If it attacks you step back and kite it, that is what you want. Troll the bastard. Troll him hard.  The only thing to watch out for is getting polymorphed but thats easy to dodge. Also if it manages to hit you it will chunk your health away pretty good so avoid his melee range. Also, once the Terror dies you have an opportunity to kill the squishy thing inside.  If it's alone(often times they are) you can chase and kill the hero. xD",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 6
    },
    {
      "details": "If you are the garden terror, when you use the W plant, consider using the Q curse around the plant to protect it from melee characters",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 14
    },
    {
      "details": "Even after the plant nerf it is still better to hit players instead of buildings, if you are near buildings in teamfights, ofcourse put down the plant",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 54
    },
    {
      "details": "Get KEEPs. If you are choosing between the close fort & the far keep. Go for the keep. You get catapult spawns if you kill a keep & that makes the game so very much easier. Its worth the extra effort.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 12
    },
    {
      "details": "If an enemy terror plants a flower within range of you, KILL IT.  The amount of damage it puts out is insane if left unchecked.  And once it's dead, the towers will help you out once more.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 206
    },
    {
      "details": "This really goes for any map. But if you choose to ignore objectives so you can soak xp. Don't. That small amount of minion xp will mean nothing if you ignore your team when they need you and the enemy takes down an entire lane with the Garden Terror/Dragon Knight/Punisher/Cannons etc.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 21
    },
    {
      "details": "The plant isn't only useful to push with. It does a lot of damage to heroes too, and the transform thingy is great for CC, so it can be very useful in teamfights.",
      "type": "Helper",
      "patch": "Sylvanas",
      "__v": 44
    }
  ],
  "battlefieldofeternity": [
    {
      "details": "An Immortal's remaining Health becomes it's Shield once you've defeated the Enemy Immortal.  This Shield is then used as a sort of 'mana pool' for your Immortal to cast spells, such as the large AoE spell, and the smaller, ranged spells.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 19
    },
    {
      "details": "the first immortals always are positioned the same, after half health of one of them is drained:\nthe enemy one will be on your side, and yours on the enemy side. keep that in mind. this is also the reason, why you should be agressive at the first immportal. because once you got the enemy one half health, it will be very hard for them to def you from their immortal.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 4
    },
    {
      "details": "Don't be too chase an enemy hero. There is tons of fog of war on this map, meaning enemy heroes may just be hiding around the corner. Try and keep visibility up while moving towards objectives. Also, stay with a buddy that can help you survive or quickly take down enemy heroes.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 14
    },
    {
      "details": "always help your eternal",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 22
    },
    {
      "details": "After about the 2:00 mark, the Immortals will spawn. Make sure to attack and defend during this time. Defend you're Immortal whilst attacking the enemy's Immortal. However, odds are that the entire enemy team will be attacking yours, so just try to get to theirs earlier and try to out-damage your enemies.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 14
    },
    {
      "details": "Initiate the enemy Immortal if most of opposing team is dead. Assign some heroes to defend your immortal if the situation calls. In a small two lane map like this, you want to soak early and wait for the big brawl at mid. If you can stage (bait) the other team to your assassins, then let your tank(s) ambush at their immortal for the kill. Play aggressive with your immortal. Don't get greedy as a tank because you are very important in that time to soak dmg for the angel/devil. Teamwork is overatted!",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 12
    },
    {
      "details": "Attacking Eternals have two bars - a shield and their Health bar.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 30
    },
    {
      "details": "If you play as ranged hero with Cho'gall, you can try to destroy enemy healing fountain even before game begins",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 12
    },
    {
      "details": "If your Team manages to get the Immortal, get 2 or 3 of your team fighting on the other lane and the rest following your Immortal. So you can push 2 lanes at once.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 13
    },
    {
      "details": "Since Battlefield of Eternity is 2 lane map heroes that weak at weave clearing or good at roaming tend to have an advantage(like nova for example) in this map since the exp can be soaked easier than a 3 lane map.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 0
    },
    {
      "details": "zaebok kataem",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 32
    },
    {
      "details": "I have found Johanna great at disrupting the enemys teams damage against your immortal, she is able to take so much damage your team has a really good chance of getting the immortal.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 36
    },
    {
      "details": "When there is a melee character within range of the Enemy Immortal, that Immortal will attack once within melee range, and then twice at range.  Range characters should 'dance'  and move into the circle to maintain DPS.  Be careful of the enemy team attempting to take advantage of your team grouped up and CC'ing you and your team on top of the Immortal, however.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 11
    },
    {
      "details": "Pushing specialists can be very strong on this  map. 2 of any Zagara, Sylv', Azmo' combos can easily \"out run\" the immortals to core & force a team that does no like to split to have to. \nTyrande is extremely powerful on this map when attacking the enemy immortal due to the hunters mark debuff. Exploit it.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 14
    },
    {
      "details": "While the immortals are battling each other, they will only use their auxiliary attacks if there is an opposing hero in range. Even if your immortal isn't in your team's line of sight, you can see if it is launching its stuns and blasts, which tells you at a glance if any enemies are near it.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 78
    },
    {
      "details": "playing deffensive when the etharnal fight begins is a big advantage, teams tend to play aggrassive, and will go and try to damage  your immortal use it to your advantage, fighting around your immortal  will deal damage and stuns to the other team, giving you and your a team a big advantage, after a hero or 2 dies consider going on the offensive and dmg the oppisite team immortal.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 58
    },
    {
      "details": "Since players have a very quick re-spawn time for the first Immortals, it is often better to rush the opposing Immortal to 50% before engaging the other team.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 41
    },
    {
      "details": "Greymane left unchecked will destroy an Immortals HP, if you can zone for him it'll probably be as fast if not faster than trying to fend off a whole team whilst attacking as 5.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 4
    },
    {
      "details": "The Immortals will become immune and switch sides once one of the immortals has reached 50% health. If you had a spell that hits multiple times like Jaina's Blizzard, be mindful of the switch to avoid wasting.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 25
    },
    {
      "details": "Globally, the Map is about finding a balance between defending your Eternal and taking down the enemy's. Of course, sometimes you won't need to protect your Eternal when let's say the enemy team is on a respawn cooldown, but that's situation-dependent.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 49
    },
    {
      "details": "Waiting for the Immortal announcement to hearth and get health is not an appropriate time to do so.(There is only 10-15 seconds of warning before the Immortal comes up). This is ok at  Garden Terror map(because you get much more time to hearth) but not ok on this map. Arriving late and with no resources(Hp and mana) can mean certain doom. Plan to arrive at the objective early and with full health. Hopefully your team has done the same. Being punctual can earn yourself a win.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 8
    },
    {
      "details": "The attacking Eternal will be attacking your/your  enemy's strongest lane.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 244
    },
    {
      "details": "Remember to also soak experience at least during first immortal fight. One level have far higher value then first immortal. (This does not mean You should not fight for objective, just do not overcommit)",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 122
    },
    {
      "details": "When the immortal is defeated, the remaining percent of health on your immortal is the amount of percent in shields extra they will have over and above their health points. While the shield is up they attack from range. Once you've attacked the immortal's shield down, it will then go into melee range till it's killed.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 5
    },
    {
      "details": "If you see the \"Eternal's preparing\" countdown, this would be the perfect time to go drink from a healing fountain.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 113
    },
    {
      "details": "The Immortal's attacks on each other are just for show. You can't leave an Immortal at 1% health and let him finish the other off; You need to do it yourself.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 30
    },
    {
      "details": "For ranged damage users, if you have a hard time avoiding the immortal's ranged stun, it helps to move into melee range to avoid it. However, be aware of the  melee stun that it does and that clumping close gives your enemies opportunities to set you up.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 22
    },
    {
      "details": "The immortals usually dish out 2-3 ranged stuns (which are scattered around them in aoes of 5-6) before using their melee stun (which is dealt in a wide area around them).\n\nA warning to ranged attackers, since many don't try to avoid the stun while others run in the wrong direction and get ganked. During this phase, you should always be near your team.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 23
    },
    {
      "details": "Please keep in mind that if you are the team's dps hero make best use of him/her by focusing the Immortal rather then doing other things. As the primary damage dealer you can do the most good by kiting your Immortal down rather than running around aimlessly. Don't leave your Malfurion(or someone similar) to kite the Immortal down by himself, it's useless. Misusing your hero's abilities will lead to a loss. On that note, choose a hero that can kill the Immortal quickly to steal yourself a win. Those that use their hero accordingly should win more often. P.S. If you are using Lt. Morales, don't play like an assassin. Again, misusing your hero will lead to a loss.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 6
    },
    {
      "details": "Artanis is a must pick for me on this map. Amateur opponent lets you help burst down the immortal insanely quick for a tank position. His other level 1's are only slightly better but not on this map!",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 6
    },
    {
      "details": "There is a common mistake that people does often in low ranks: defend first. Even if you wipe the enemy team at the very first immortal the respawn time is pretty short and this doens't give you a true advantage for your team. Instead is more important to benear the immortals as the cooldown is close to zero and try to attack first and fast as possible. Then keep the strategy balanced between defending and attacking the immortal.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 19
    },
    {
      "details": "The attacking Eternal's Shield is equal to his remaining Health.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 92
    },
    {
      "details": "Sgt. Hammer outranges the Immortal's abilities, allowing her to pound into them without fearing any sort of stuns or damage from them at her maximum range. With her high sustain DPS she should be the number one target for any team looking to disrupt the enemy when they are attacking their immortal",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 39
    }
  ],
  "infernalshrines": [
    {
      "details": "As Dehaka, you can bait the Punisher into jumping to a bad location then Burrowing to avoid damage. If you can bait the Punisher into cannon range...",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 4
    },
    {
      "details": "a Hero with massive AoE damage such as Jaina or Kael'Thas  should head to the shrines every time, guardians are weak and can be easily cleared with such a hero.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 35
    },
    {
      "details": "To get the guardian to count, is it last hit, first hit, most damage, or what?",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 18
    },
    {
      "details": "so far I think the shrines first start for objectives are mostly the mid or bot for me. It is best to have johanna,  leoric, artanis, and when you click the click the shrine you see a what punisher by what color it is . When getting the shrine in the early game try to the well if low on health or have time because the enemy will respawn fast",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 13
    },
    {
      "details": "Arcane Punisher is capable of getting a 1v5 penta because of his arcane sentries. Be sure to move a lot more than normal.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 18
    },
    {
      "details": "The moon wells on the bottom lane are exposed and can easily be sniped by ranged characters.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 35
    },
    {
      "details": "Both teams are granted vision of the area right around a shrine in the countdown to its activation. If you're early to a shrine, stay to the peripherals (there's lots of vents to hide in) rather than waiting right by the shrine.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 13
    },
    {
      "details": "Pay close attention to the location and timing of the infernal guardians' abilities. You'll miss out on kills or get got if you don't.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 51
    },
    {
      "details": "If you lose the immortal. \n1) scatter. Dont stay as a unit. I know this is counterintuitive, hear me out. \n2) very briefly go to lanes. Just to clear any snowballs & sip a little soak. \n3) reassemble behind the sieged fort. \n\nDoing it like this gets you 1) a pretty safe exit. Niether the punisher nor the opposing team are going to lock on to a scattering team. They will trudge toward a fort. You lost, so its natural that you will lose at least a wall. Minimize your exp loss so you dont get snowballed. Finially reassemble. The whole thing should take under 15 secs easy. Now you are set up to bait the punisher with your head clear & wounds licked.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 13
    },
    {
      "details": "Johanna, Leoric, Sylv, are three of the best characters who can clear objectives like a piece of cake.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 44
    },
    {
      "details": "The Punisher always leaps toward the nearest enemy hero in range. Use this to lure it behind walls and make it easier to take out.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 48
    },
    {
      "details": "The order of the shrines is random but they don't repeat. For example, if the first one is top, then the next one will either be mid or bot.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 45
    }
  ],
  "towersofdoom": [
    {
      "details": "A",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 10
    },
    {
      "details": "Make sure to go for mobile heroes like Dehaka, Falstad and Brightwing to be able to capture a point and quickly join teammates at another objective! Possibly the best pick on this map, however, is Stitches. Since some objectives are close to the towers, Stitches can hook a player for an easy kill.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 3
    },
    {
      "details": "Doesn't exist here.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 12
    },
    {
      "details": "If you killed the majority of or wiped the other team, think about talking additional forts before capping an altar. You can get easy additional damage on their core this way. But make sure not to be too greedy, dont risk losing a cap only to get an additional 1-2 dmg.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 17
    },
    {
      "details": "Reassure yourself its safe to use the tunnel to the central area. Check minimap to do so.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 16
    },
    {
      "details": "Use the tunnel with causion, if u recently came back from the dead and immediately went to the tunnel and teleported, the enemy team can calculate your arrival and kill you in a mather of seconds and you'll be back in the grave",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 27
    },
    {
      "details": "Boss on this map has quite low hp, but hits really hard. If you are low after winning a teamfight, think twice about doing it.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 38
    },
    {
      "details": "Altars are the most important thing in this map, don't split push unless you can take control of the whole battlefield.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 25
    },
    {
      "details": "Abathur's mines around the tunnel, once it opens, can easily get someone low as soon as they spawn. Use it to your advantage - most people will overconfidently refuse to hearthe right after, so be ready to gank middle anytime!",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 1
    },
    {
      "details": "If your team is dominant on the map, always look to control all 6 keeps (Yours and your opponent) This will put HUGE pressure on enemy team due to constant bombardment to your enemy core when all six keep is controlled.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 20
    },
    {
      "details": "Since this map relies on channeling to actually win stealth heroes can be great to distrupt them",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 0
    },
    {
      "details": "Since so many people don't seem to know this (including me for the longest time) if you capture a siege camp in a lane with the enemy keep already taken, the siege minions will run towards the enemies wall and take 1 shot per minion still alive at the enemy core.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 12
    },
    {
      "details": "In a situation where you're behind or your team fight potential is weaker than theirs and three altars spawn, it's usually better to commit to just the bottom altar instead of contesting for two. You're not going to win these fights and so you should use this time getting the enemy bot camp and/or the bot keep depending on how far into the game you're in.\n\nThis can be extended as a general tip. Commit 4 people to one altar (preferably on their side) forcing given that the enemy team has commited 4 people to one altar. Another altar can be contested by the fifth members. It's usually better to have a flexible hero there who isn't your main frontline/damage/support so that your teamfight isn't impacted too much.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 11
    },
    {
      "details": "Heroes with good poking or zone control capabilities (like hammer, malfurion, jaina, kael) can be very effective to ensure an altar.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 15
    },
    {
      "details": "focusing on bot mercs and grouping to push relatively early can give u a great advantage on this map, it leaves the other team playing catchup while u focus other lanes",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 14
    },
    {
      "details": "Although this may seem like a push map, it is probably the ultimate team fight/gank/poke map.\n\nTaking the enemy's keeps are important, but if you can't win a team fight to secure the objectives, then you will never win the game. Alternatively, getting a well timed gank before the objectives can result in you being able to secure all of them and deny them from the enemy and allow a boss. So team fighting cannot be underestimated on this map.\n\nSecond, mobility and poke can be huge here. Towards the end of the game, when 3 objectives spawn, being able to secure the far objective while denying the enemy the ability to capture the other 2 can win games. Heroes with long range like Tyrande or taking ranged talents on your heroes, like Jaina's Icelance talent on 1 can be useful here. Zag's ability to drop roaches can also safely delay a capture, while heroes like Falstad or BW can use their mobility to earn exp or capture farther objectives and join the fight when it truly begins.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 18
    },
    {
      "details": "If you take one keep, rotate and try to pressure another, this way you will maintain momentum",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 43
    },
    {
      "details": "The bottom two siege camps will only damage core if both the bottom lane fort and middle lane fort is down. Another way of saying this is that the bottom two siege camps will always go to a fort if there is on in the middle or bottom lane. This means you should push the forts first before getting the camps if you have enemy heroes dead. Note that this also means that the top lane is therefore easiest to get the camp to damage core, so should be prioritised if you only have time ot push one lane.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 72
    },
    {
      "details": "Don't solo boss, you'll die.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 36
    },
    {
      "details": "Any damage beyond towers isn't permanent. Don't sacrifice your life for a keep especially before objectives. Also don't speed too much health and mana on taking keeps down.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 30
    },
    {
      "details": "If everyone on the enemy team is dead and you have good pushing power, it'd be better to attempt to destroy all 3 keeps rather than going for the boss. If your team does not have good pushing power, get the boss.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 24
    },
    {
      "details": "Do remember that early on, it's not so important to get all the altars, a xp advantage is more needed to win on this map. You can afford to lose some hp on the core if you can get a greater level advantage!",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 66
    },
    {
      "details": "[Should Abathur sabotage the Waygate?] When the Tunnels open about halfway through the match, if you are Abathur, double-check that your enemies are actually using theirs.\nIf yes, rig the Exit to blow with Toxic Nests; \nif no, the mere possibility of Nests has deterred them, and you can use the Nests elsewhere for map vision or cutting off escapes.",
      "type": "Helper",
      "patch": "Kael'thas",
      "__v": 7
    }
  ]
}