{"dragonshire":[{"details":"Top lane is the least important of the three lanes. This is because to get top keep you have to cross into \"the bridge of death\", a.k.a. bridge of throws, a.k.a. giant choke point no one should ever try to assault a keep through unless the entire enemy team is dead.","type":"Helper","patch":"Kael'thas","realVotes":27},{"details":"Any attacks that do % damage (Tychus D, Giant Killer) work against the Dragon Knight.","type":"Helper","patch":"Kael'thas","realVotes":47},{"details":"Global heroes can quickly jump from one shrine to the other, creating situational number advantages.","type":"Helper","patch":"Kael'thas","realVotes":37},{"details":"havent tried yet, but Zagaras Nydus Ult shoult do pretty well here if no global hero is available","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Prioritize heroes with self-sufficiency. This is not a map where you can just group up, form a deathball and roll over the enemy team, counting on your allies to support you. Every hero must be capable of operating solo or in a two-person group. If your hero can't do that, DON'T PLAY THEM ON THIS MAP.","type":"Helper","patch":"Kael'thas","realVotes":16},{"details":"When piloting the DK, don't charge into the enemy team hoping to kill a structure when you're outnumbered. You are just gonna waste the DK and possibly get yourself killed.","type":"Helper","patch":"Kael'thas","realVotes":16},{"details":"Manage the HP on your DK! The ideal situation would be the DK times out when u r just about out of HP. If you time out with a lot of HP, it means you probably weren't aggressive enough. If you let the DK die way before its timer expires, then you were too aggressive.","type":"Helper","patch":"Kael'thas","realVotes":10},{"details":"Take the drake bot or top lane. The 4 teammates need to go push on the opposite lane. The ennemy team will defend the drake, leaving the opposite lane free. Way more efficient than just go with the drake and have a crappy fight to take a fort.","type":"Helper","patch":"Kael'thas","realVotes":0}],"battlefieldofeternity":[{"details":"Drafting sustained damage is must on this map to win the Immortal race. High DPS heroes, such as Valla, Greymane or Zul'Jin are essential for your team. Heroes with bonus non-heroic damage, such as Artanis, Sylvanas and Lunara should talent appropriately  to  maximize damage to immortals.","type":"Helper","patch":"Kael'thas","realVotes":60},{"details":"The first Immortal, when changing positions, will always go towards the close (back side) location to the team that needs to damage them, meaning that at this point, racing it is the most effective strategy because you have to be very deep in enemy territory to defend it.","type":"Helper","patch":"Kael'thas","realVotes":16},{"details":"Low/medium MMR solo queue advice: \n\nWhen defending Immortals, it is important to keep in mind that the objective does not at all progress on its own. The race simply cannot be won without at least one hero damaging the enemy immortal. \n\nDefending your own Immortal indefinitely (especially early ones, when the death timers are still very low) therefore often only yields the result of a delayed but devastating loss of the race -- you might very well have a 100% shielded enemy Immortal coming towards your base, just a bit later than it could have been. Seek out opportunities to safely deal damage to the enemy immortal and consider trading DPS even when chances are that the enemy can DPS faster.","type":"Helper","patch":"Kael'thas","realVotes":17},{"details":"When drafting, make sure that your team either has a faster race or the better team fighting. Not having either option makes it extremely difficult to win the Immortal.","type":"Helper","patch":"Kael'thas","realVotes":11},{"details":"A won immortal will always go to the lane with more standing structures between it and the core.  Knowing this allows your team to gain favorable positioning in lanes for the push phase.","type":"Helper","patch":"Kael'thas","realVotes":19},{"details":"This is by far THE WORST Ragnaros map in every league according to hotslogs winrates. You do not need to prioritize him here. He won't help you much in getting the objective and Immortal just shreds through his trait anyway.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Between each of the Immortal pads is a little L-shaped piece of terrain hidden by vents. Sgt. Hammer can hide in them and still siege the Immortal if she has a teammate spotting for her. Her contributions to team fights will be limited, however.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"This is true for most maps, but notice when any form of cc is cast by bosses. You can sometimes land a stun on or displace an enemy so that they cannot avoid it. For example, if you are playing Uther and fighting under a friendly immortal and a stun circle appears under an enemy hero you can immediately stun them so that they cannot escape the impending boss stun. There are many ways to do this and good players will seize these opportunities to stun chain an enemy.","type":"Helper","patch":"Kael'thas","realVotes":9},{"details":"Do the hard (shaman) camp shortly before race for immortal starts. This will create an unfavorable situiation for your enemy. Normally you cant afford having a shaman pushing for ever so you need to send someone down to deal with it creating 5v4 on the immortal arena.","type":"Helper","patch":"Kael'thas","realVotes":3}],"cursedhollow":[{"details":"First Siege camps spawn at exactly 2 minutes, giving around 30-50 seconds before the first Tribute spawns. Capping it before then allows some uncontested push during Tribute fights.","type":"Helper","patch":"Kael'thas","realVotes":33},{"details":"When a Tribute spawns, keep an eye on your allies! The often can not arrive in time for the Tribute spawn  so try to poke the enemies and deny them the tribute rather than engaging alone until your team has arrived. Heroes with global presence (such as Falstad, Brightwing or Dehaka) should take the outer lanes for soaking since they can easily arrive in time at Tributes.","type":"Helper","patch":"Kael'thas","realVotes":13},{"details":"To maximize your Sololaner's potential (such as Zagara, Xul, Murky, Gazlowe), try to  deny the tribute for the enemy by poking and prolonging the fight as much as possible so that your Sololaners can safely push their lane if they can not make it to the Tribute in time. Eventually, the enemy is forced to retreat, split up or losing structures, giving you a good opportunity to engage.","type":"Helper","patch":"Kael'thas","realVotes":11},{"details":"Tributes follow a pattern in their spawning behaviour. The spawns are separated into groups of three (tributes #1-#3, tributes #4-#6 and so on, regardless of who takes which tribute). Each tribute can spawn either top or bottom, and either left, middle or right. In every group of three, there will be exactly one tribute in a left spot, one in a middle spot, and one in a right spot. Additionally, in every group of three, there will be spawns in both top and bottom. This sometimes lets you deduce tribute spawn positions in advance. If for example tribute #1 spawns top left and tribute #2 spawns top middle, you know with certainty that tribute #3 will spawn bottom right.","type":"Helper","patch":"Kael'thas","realVotes":31},{"details":"It's okay to give up a tribute. Sometimes you can accomplish something worth more in the time it takes the enemy team to mobilize for a tribute.","type":"Helper","patch":"Kael'thas","realVotes":26},{"details":"Communication is essential on this map because it's So Freaking BIG. Wherever you need to be, you need to be there NOW, not in 30 seconds. So ask for directions if you're not sure where to go. In the same vein, facilitate communication with pings if one of your teammates isn't responding properly.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Heroes especially good at clearing lanes are good for both offense and defense on this map, either for offense or defense. If you get the Curse first, your solo pushing will be especially damaging. But even if you don't, your damage control will be good enough to at least mitigate the damage well. In either scenario, it's very advantageous to have exceptional wave-clear on at least one hero.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Vikings are amazing on this map, this map is to big to be at all places at the same time, the vikings put the enemy team on a very high pressure, either they lose 3 minionwave exp when they wanna fight as full team for the tribute (depend on game length this are between 1,200-2,000 exp fall back, if the enemy didnt draft at least 2 globals against the vikings you will get a free first curse or a lvl 10 vs lvl 7 situation that you can snowball for the rest of the game. Beware that the vikings can join the teamfight with Try again in 2 seconds, so past 10 you will lose lane exp and have to fight 5v5.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"Remember to get the first Siege Camp! Time it properly so that it will push while heroes contest the tribute.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"If you suspect or scout the enemy team is taking boss but your team is in no position to contest (e.g. down a member or talent tier), take the other boss quick! Otherwise, they will either contest / punish your team taking boss while their own pushes on the other side of map, or take the other boss while you guys are busy defending. Corollary: if your team successfully takes boss, go to the other one. If they show to defend then take the other boss. If they try to trade bosses then punish while letting your own push.","type":"Helper","patch":"Kael'thas","realVotes":2}],"skytemple":[{"details":"The second Temple phase will always be in bot lane only. If you can secure their bot healing well before then, you will have an advantage going in.","type":"Helper","patch":"Kael'thas","realVotes":41},{"details":"Temples always spawn 2 minutes after the previous one was finished. Keep this in mind to take your bruiser camp after the first 2 temples at mid & top are finished. Capping these as the bot lane temple spawns will let them either do uncontested pushing, or attract the attention of an enemy hero.","type":"Helper","patch":"Kael'thas","realVotes":21},{"details":"If you can choose which lane to push, lean towards bot lane. This is where the boss goes, which offers good chances to go for the enemy core in the late game.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"Damaging or killing the wall of the enemy helps you gain more value from the Temples. On the defensive side, Mule is very useful on this map to lower the value the enemy gets from Temples.","type":"Helper","patch":"Kael'thas","realVotes":12},{"details":"The first temple spawns top and mid, so be sure not to have multiple heroes bot at the start of the game. Controlling vision when the temples spawn gives you a huge advantage.","type":"Helper","patch":"Kael'thas","realVotes":9},{"details":"I bims der Marcel","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"This map is the home turf for heroes particularly adept at objective control. Gazlowe, Probius, and Murky are a few examples.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"As of August 2017, there are only two characters in the game who have the Calldown: MULE Talent: Abathur and Lt. Morales. This is the best map to use that Talent on, since the Temples typically leave buildings half-destroyed. (Capt. Blackheart's cannonballs do too, but far less frequently.)","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"The second Temple phase is by far the most important. Whoever wins that one decisively will get to Level 10 first, which should lead to a free Boss.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"Bot lane is the most critical lane. The boss pushes in this lane as do two Siege camps. The second temple phase will also hit this lane provided the game hasn't spiraled out of reach by then. If you can choose which lane to push always choose bot. Killing the wall or even the well early is very powerful.","type":"Helper","patch":"Kael'thas","realVotes":1}],"blackheartsbay":[{"details":"Tracer will break chests quickly.","type":"Helper","patch":"Kael'thas","realVotes":12},{"details":"XP soak is important above all else here. You do not need to fight over every coin turn in - play for map advantage, note where your opponents are and try to deny them soak elsewhere on the map. Do this and you'll find yourself winning when it matters.","type":"Helper","patch":"Kael'thas","realVotes":23},{"details":"Xul is god tier on this map due to his high sustain and ability to split soak the top two lanes. IF the enemy team has a Xul because it wasn't banned in Draft I suggest either taking Nazeebo/Ragnaros/Sylvanas to attempt to duo lane against him. If you haven't taken either of those heroes then a high gank comp hitting him mid rotate can also shut down this strategy.","type":"Helper","patch":"Kael'thas","realVotes":12},{"details":"It is incredibly easy to finish globe quests and seasoned-marksman-like quests on this map if you dedicate 3-4 heroes to efficiently rotate top and mid lane (taking coin camps when possible - those yield additional globes). Consider giving up the first turn-in to finish quests that might snowball.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"The first turn-in targets the mid lane fort. It will target the towers, gate and fountain before the actual fort building. If those secondary buildings are undamaged when the barrage begins, the fort will be left standing, barely alive. If, however, you either completely destroy one of the towers or get both towers below ~50% (I'm not sure on the exact percentage), the cannon shots will kill the actual fort. This makes it worth dedicating some time and pushing power towards the wall towers early.","type":"Helper","patch":"Kael'thas","realVotes":26},{"details":"Having hero who can clear Mercenary Camps by themselves is very useful, such as getting the top camp right before grouping up for a turn in.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Nazeebo breaks chest quick and is god at siegeing in this map","type":"Helper","patch":"Kael'thas","realVotes":-9},{"details":"Have a hero with strong waveclear (Xul, Ragnaros, Artanis, Nazeebo) solo both top lanes and rotate as 4 to gank, get camps, and soak bot lane.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Lucio's auto-attack does four quick succession weak hits. This makes him one of the fastest heroes for breaking chests.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"Tierlist for this map:\n\nTier S ( this heros have advantages through their kit, that makes them not only good, they can carry the game by themselves):\nAbathur  ( Mule repair many buildings that wont be killed by the pirate, Mines on rotation points interrupt enemy rotations, Monstrotity force the enemy team for one more rotation and the symbiote can soak as well as shield buildings that are under the fire of the pirate, all of his skills re powerfull and get even more value as the game goes on, this makes him Tier S)\nThe lost Vikings ( you just got one hero to soak 3 lanes and can capture camps at all times, even if u miss a few exp on the lane, when the vikings have to get behind the wall, the enemy cant push, will have trouble on rotating, and if they push a lane they re in danger to get ganked, the vikings can do every camp pretty fast too)\nIllidan ( Zagara, Xul, and other heros that could double lane dont like to get hunted, cause probably they will die).","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"Johanna can be a good pick here, for the same reasons she's good on Tomb of the Spider Queen: between her high HP and Iron Skin, she's basically custom-designed for carrying things around that the oppnents want to take from her. She has less utility on this map, however, because collecting Doubloons is not reliant on waveclear.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Chest hit points are not the same as heroes. Each attack or skill is worth 1 damage tick so don't drop long cool down skills with high damage  trying to burn down the chests. Allow fast auto attacking heroes to burn them down if possible","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"The boss is usually not worth attempting on this map. It's far away from the turn-in site and due to its pathing takes a lot of damage when trying to attack forts and keeps. The position of the boss, including the nearby fog, makes it easy for opposing teams to steal.","type":"Helper","patch":"Kael'thas","realVotes":0},{"details":"Jaina is good here, soaking the top 2 lines and poking heroes.","type":"Helper","patch":"Kael'thas","realVotes":0}],"hauntedmines":[{"details":"When you're collecting the last skulls, but it's inevitable that you're going to get the smaller golem (e.g. yours 30 vs 70), you can also just leave the  last skull uncollected and do objectives or stuff in that time.\nThe other team has to go and pickup the last skull in order for the golems to spawn","type":"Helper","patch":"Kael'thas","realVotes":38},{"details":"Siege camp spawns at 1:30, mines open 30s later. Capping them as the mines open will make sure they either push, or distract one of the enemy heroes, giving you an advantage in the mines.","type":"Helper","patch":"Kael'thas","realVotes":28},{"details":"Split up inside the mines. If you enter the mines just to follow an ally, you may aswell not be there. It sucks when you have 4 people in the mines, your enemies have 2, and they get most of the small skull camps. The only time where you should not split in the mines is when both teams have 5 people in, and your team will win the fight if it happens. In this case go in as a team and alternate killing camps and hunting down the enemy team. Once you get them, take down the golem camp.","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Prioritize specialists on this map. The bosses have a large health pool but one AA assassin (valla, falstead, tychus) can easily stop the boss push if undefended (especially in late game). In addition their siege damage is surprisingly low for an objective boss (even at 70+ skulls). Consider taking a specialist to maximize its push","type":"Helper","patch":"Kael'thas","realVotes":9},{"details":"A number of Heroes have Talents that require you to collect the heart-shaped Regeneration Globes. This is NOT a good map for those Talents. It's only two lanes, minimizing the amount of rotating you can do, AND you spend a long time in the mines themselves where the only available globes are the purple ones dropped by the big minion.","type":"Helper","patch":"Kael'thas","realVotes":17},{"details":"Stukov is OP in this map. Wait for the people to spawn in the entrance of the mine while casting the silence. Along with Jaina or KT, or may some stun of Mur, its game over.","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"It is not worth it, especially so in the early game, to expend a lot of resource just to get a few extra skulls. The difference that a few skulls make is barely noticeable. Camps and soak are way more important especially early game, as long as you don't give up something ridiculous like 0-100 golem. Getting a 55-45 skull count is not worth it if you lose the neutral sappers and exp soak in the lanes.","type":"Helper","patch":"Kael'thas","realVotes":12},{"details":"On this map you are almost obligated to emphasize solo-laning and wave-clear, since this makes it easy to spread out in the mines and take the smaller camps.","type":"Helper","patch":"Kael'thas","realVotes":1}],"gardenofterror":[{"details":"Never leave an enemy terror uncontested. A second night terror can backdoor two keeps if nobody pays attention.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Decently played Lost Vikings can be devastating on this map. A Viking controlling the terror means your team can effectively fight with 4 heroes and a Garden Terror, and still have two heroes left to soak or take camps. The amount of mercenaries also makes the Vikings' talent Mercenary Lord quite powerful, since they can use it on up to three different camps pushing.","type":"Helper","patch":"Kael'thas","realVotes":18},{"details":"When controlling the terror, if there are enemies attacking you, it is usually better to run away. if you run away from the enemy team you might not destroy a fort, but it will buy a lot of time for your team to do stuff elsewhere or get picks on the enemies.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Remember that high mobility heroes/heroes that can move through units can steal seeds very easily; especially from the big camps.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"When the shamblers spawn, your team wants to control access to the SMALL camps. Basically to get ahead, you want to go for 3 out of 4 of the small camps. To stay even, get 2 of 4. The large golems can usually be traded, since when a team if focusing on one, the other can just go after the other one. \n\nSo it's in the small camps that you get ahead in seeds.","type":"Helper","patch":"Kael'thas","realVotes":16},{"details":"Decide ahead of time who's going to take the Terror. It's not always an implied consensus who will, which can lead to a discussion when you really don't have the time to make one. While, generally, either a Support or a Warrior takes it (the Terror basically takes the place of both), sometimes a Specialist could, too. Really, the Terror is best at sieging and crowd control, so it's probably a good idea to have someone who already does those things take it. Either way, be clear ahead of time, because everyone's had that moment when everyone thinks the other person would get it, and so it ends with no one getting it.","type":"Helper","patch":"Kael'thas","realVotes":13},{"details":"If there is a Cho'Gall on your team and Cho decides to take the Terror, Gall can still use his his basic skills and Heroic from within.","type":"Helper","patch":"Kael'thas","realVotes":27}],"tombofthespiderqueen":[{"details":"Heroes with minion quests (Azmodan, The Butcher, Auto-Attack Heroes) and wave clear work well here.\n\nSince it is a small map, gank comps can be very effective.","type":"Helper","patch":"Kael'thas","realVotes":32},{"details":"Prioritize Heroes with wave clear during draft. Good wave clear can delay a loss (which yields more opportunities to try and win) for a long time on this map, because all that any objective does is spawn large waves of pushing minions.","type":"Helper","patch":"Kael'thas","realVotes":19},{"details":"Rotate often.","type":"Helper","patch":"Kael'thas","realVotes":14},{"details":"Vision of the turn-in can deny the enemy heroes free drop offs. Have your tank checking them often, or a (Scouting Drone) placed to make opponent's life hard.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"If you are playing from behind, but have midlane advantage, use a patrol strategy. Make your tank check both sides, and if you have a support with scout, patrol with him to deep place scouts to know when to make a move up or down. Pick a mobile wave clearer to go up and down, safely, and let him keep farming the gems. As time progress the other team will have to be agressive to deny a free drop off. Use this to position yourself better than they think you will. Turn their \"active actions\" into \"reactive actions\".","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Abathur can spam mines in the top vent above lower turn in. Ive trolled so many people with that lol.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"Controlling the turn-in points can make a huge difference on this map. If your opponents can't turn in, they'll take fewer risks due to their large gem loads. This gives YOU more space to be aggressive. Oh, and, you can turn in more easily yourself.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"When a full gem turn in is accomplished by either team the merc camps and boss will disappear from the map until the weavers are destroyed. That is, if they are not already started. If your team completes a turn in and a flag on the minimap for a camp or boss is still yellow, you know someone from the enemy team is taking it. Alternatively, if your team is trying to sneak a boss and you complete a turn in, the enemy team will see that the boss is active. If some enemies are dead you can sometimes start the boss as someone turns in to stack it with the weavers. Just be sure that the boss cannot be stolen and the teammate who turns in is not vulnerable.","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"This is a good map for quests that require you to get Regeneration Globes (IE the little green hearts) because it's so easy to rotate between lanes.","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Consider picking Johanna. She has solid waveclear to collect Gems. Her insane survivability means that she can safely carry them around without (much) worry of getting picked off. And if an ally dies, she can scoop their Gems up, relying on Iron Skin to keep her safe. The downside is that she cannot act as the main tank for her team if she does this, requiring adjustments from her team and their composition.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"If you are the solo laner, during the early game avoid clearing the wave too quickly, as this will leave the gems to far away to be safely picked up. Wait till the wave pushes into your half of the map.","type":"Helper","patch":"Kael'thas","realVotes":14},{"details":"If you wipe the enemy team and can get Boss and turn in Gems, but need to decide which one to do first, there is a correct answer: Boss. As mentioned elsewhere, all neutral camps despawn once the Webweavers spawn; if you turn in first, you CAN'T get Boss. So, Boss first. (If communication is VERY good, start Boss and detach people to turn in before it is dead so that the two are claimed roughly at the same time.)","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"If voice comms are available, consider designating only two or three people to do ALL the gem collecting. This allows the remainder of the team to zone, which may be the advantage you need to turn in while under fire.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Suck the Pope ass and then die.","type":"Helper","patch":"Kael'thas","realVotes":-10}],"infernalshrines":[{"details":"You can bait a Punisher to jump under your fort by standing just behind the gate as long as it hasn't jumped already, allowing you to safely kill it and making your opponents' job harder. Never fight the Punisher outside of your own structures.","type":"Helper","patch":"Kael'thas","realVotes":45},{"details":"Heroes that benefit from takedowns against monsters can really shine on this map. Popular examples are valla (vault / death dealer), kerrigan (Q talents on 1 and 4), stitches (last bite). Standard plays would be to vault forward, kill a monster, vault again, get a kill and retreat immediately.","type":"Helper","patch":"Kael'thas","realVotes":10},{"details":"Ban Kerrigan","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"When having a strong Pusher on your team (such as Zagara, Xul or Murky) and your team successfully summoned a Punisher, let your Pusher take on another lane to safely push and soak while the others escort the Punisher. This way, two lanes can pe pushed at the same time  without worrying about an unfavorable teamfight (Punisher is a good hero substitute).","type":"Helper","patch":"Kael'thas","realVotes":5},{"details":"Draft area damage or quick waveclear for the shrine fights. Certain heroes, such as Gul'dan or Kael'thas can even steal the Punisher if you are pushed out of the shrine by poking in with their spells.","type":"Helper","patch":"Kael'thas","realVotes":6},{"details":"Sylvanas can be an excellent addition to this map when pushing with the objective. She can disable structures, giving more sustain especially to early weak punishers.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Let your tank bait the punisher behind the gates. Be careful not to stand close to him and take useless damage/CC.","type":"Helper","patch":"Kael'thas","realVotes":9},{"details":"Heroes that benefit from maintaining auto-attacks (e.g. Valla Trait, Greymane W, Illidan Trait, Tyrande Q) are great on this map because the shrines provide ample targets that you can safely hit. On the other hand, heroes that relies on skill-shot hits to do damage (e.g. Li-Ming, Nova, Zeratul) may struggle as the guardians will often block them. Avoid playing these heroes on this map, or be aware that you will often need to flank or backstab your opponents to be effective.","type":"Helper","patch":"Kael'thas","realVotes":9},{"details":"The first punisher is relatively weak, so don't five man the defence. Bait it over the wall, and 2 or 3 heroes should be able to take it down. Having lane soak on the other lanes is more important during the early game.","type":"Helper","patch":"Kael'thas","realVotes":9},{"details":"This is the map where Alexstrasza shines. She might be the best support here as with her trait, she can secure the objective for her team.","type":"Helper","patch":"Kael'thas","realVotes":0},{"details":"As with Battlefield of Eternity, the Fallen Shaman (hard) camp will push indefinitely if not dealt with. Cap it right before an objective is very powerful.","type":"Helper","patch":"Kael'thas","realVotes":1}],"towersofdoom":[{"details":"Getting all of the enemy towers low then killing them all in a fast rotate is a very cheeky strategy but most high skilled players will notice this and let the tower fall so that they can just recapture this. (Malf only hero with MULE as of 1-24-17)","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"When you have the opportunity to take both camps in bot lane, it is more rewarding (even if riskier) to take your side first, then the enemy side and then push with both.","type":"Helper","patch":"Kael'thas","realVotes":-8},{"details":"It might feel like killing forts (bell towers actually) is less rewarding on this map than elsewhere, since they can be captured back, which nullifies the XP advantage as well as the map control. However, bell towers are crucial for the momentum you have during objective phase, and they also are a surefire way to keep the enemy team busy.","type":"Helper","patch":"Kael'thas","realVotes":9},{"details":"If you really dislike this map just pick Nova like I do. This way you can lose the game and nobody will blame you for trolling/afk.","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Prioritize heroes with long range poke to stall out shrines. Chromie is excellent at this, as are most mages.","type":"Helper","patch":"Kael'thas","realVotes":32},{"details":"Being aggressive is very important on this map. If you can destroy and enemy fort before they take yours, you can press that advantage for the majority of the game, and counter any push they might make with one of your own.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"Sapper merc camps if they get to the border behind the enemy fort will launch at the core and deal 1 damage per sapper to the core. 6 potential core damage from the bottom camps more than the boss (4) if you wipe the team late.","type":"Helper","patch":"Kael'thas","realVotes":16},{"details":"In the early game try not to waste too much time in long drawn out fights for the objective on enemy side. Gathering xp is very important.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"By using Into The Fray, Garrosh can throw Sappers over the line, converting them into Core damage.","type":"Helper","patch":"Kael'thas","realVotes":19},{"details":"This map puts importance on team decision-making, because of the way it assigns Core damage, in a way that no other map does (at least until Hanamura comes back). Winning with 1 point left on your Core is the same as winning with 40 points left, which means you can afford to give up 39 Core points in favor of accomplishing other, more important things (camps, Forts, etc). Of course, you have to be SURE that those things are more valuable than your Core damage... which takes us back to that whole decision-making thing.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Heroes that can travel quickly between lanes excel on this map, Dehaka and Falstad can go from XP soaking, to helping in fighting for the points in a matter of seconds","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Take sappers in a cleared lane AND escort them to the core!","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Distroy the bell towers just as the objective starts(at the end of the countdown).","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"When the Pumpkin Sappers cross the perimeter and turn into Core shots, this is technically an Ability -- the same kind your Hero uses when they press Q, W or E. You know what turns off Abilities? SILENCE. Stukov can literally save your Core with his Lurking Arm.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Stukov's Lurking Arm can silence Sappers, preventing them from detonating against structures or converting into core damage.","type":"Helper","patch":"Kael'thas","realVotes":1}],"lostcaverns":[{"details":"Push mid.","type":"Helper","patch":"Kael'thas","realVotes":22},{"details":"Counter-picking is criticaly important on this map.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Getting the first completed turn in is vital on this map. Since you get an opportunity to push out each lane, the enemies spiders will spawn farther away if they happen to get the next turn in, diminishing their worth.","type":"Helper","patch":"Kael'thas","realVotes":-7},{"details":"Constant easy access to Globe talents and almost always being in the presence of lane minions makes this an ideal stacking talent map. Talents like Regeneration Master, Seasoned Marksman, and similar are often worth it.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Mobility/Rotations, Teamfight, Objective Control, Sustain, Globe/Marksmen Talents, Siege\nYou need to have some of these won in the draft to win this map. If the other team is better at something, try to play up another area or counter their pick. \n\nAlso, always remember that a single teamfight means a LOT on this map due to the gem loss. You can lose a lot of structures early and the game will FEEL out of control, but if you win a fight you'll quickly realize how fast you can catch up here. Rotations and split pushing are huge here, if your team can manage it.","type":"Helper","patch":"Kael'thas","realVotes":-3}],"braxisholdout":[{"details":"Designating a solo laner is one of the most important components of drafting for Braxis Holdout. Solo laners typically need some sort of self-sustain, moderate damage, and decent waveclear. Some of the best candidates for this role are Chen, Thrall, Alarak, Rexxar, Dehaka, Ragnaros, and Gul'Dan.","type":"Helper","patch":"Kael'thas","realVotes":33},{"details":"Competing for the waypoint can often be a test of endurance rather than skill. Often, the first team to drain the other team of their mana can both waypoints. Because of this, mana-less heroes (Chen, Zarya, Auriel, Sonya) are very valuable on this map. Don't waste your mana on abilities which won't have followup!","type":"Helper","patch":"Kael'thas","realVotes":24},{"details":"Low-medium MMR tip: in many situations during objective phase on this map, actually standing on the point is crucial. Trying to first win a 3v3 brawl and then capture the spot can be worse than fighting with someone standing ON the actual spot and not get any kills (or even lose a hero), if that makes a significant difference for the objective counters.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Ragnaros is very strong in this mode, as his ult fire wave, can either zone enemies and kill minions when pushing. Or demolish waves of zergs when defending (especially at lvl 20 with 2waves) Not only that, but his basic skills are also strong wave clear.","type":"Helper","patch":"Kael'thas","realVotes":17},{"details":"Be sure to have a hero with solid wave clear. You are going to want to clear these waves quickly. Ragnaros excells here for this reason, as does Xul.","type":"Helper","patch":"Kael'thas","realVotes":1},{"details":"Probius is also very strong on this map. You can actually defend a max Zerg on your own without taking much building damage. He is also a strong Point contender if the enemy cannot dive you.","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"Consider to draft two self sustain heros like Chen, Leoric, Rexxar, Joanna, Muradin and Varian. All of them has such a high self sustain that they could survive a 1v2 on a point to get a fully charged beacon. You can roam as 3 to help the one that is attacked by more then 2 enemys.","type":"Helper","patch":"Kael'thas","realVotes":0},{"details":"To defend against a Zerg wave, first kill the Banelings before they reach your structure -- no brainer. But afterwards, the key is to kill the Hydralisks ASAP. That's where the majority of the Zerg wave damage comes from. Lots of players like to kill the Ultralisks first, which is inefficient and you give up more structure damage.","type":"Helper","patch":"Kael'thas","realVotes":12},{"details":"Utilize camps! If your team is winning one lane but the other lane is losing, merc the winning lane (or if safe, steal the enemy camp on that lane) and rotate to reinforce the losing lane. If the solo lane is losing, quickly taking the camp on that lane helps your solo laner a lot without giving up the 4-man.","type":"Helper","patch":"Kael'thas","realVotes":0}],"warheadjunction":[{"details":"The center of the nuke does a lot more damage! Whenever possible, use the nuke so you hit with the center on a fort or keep. Early on it is safer and yields more damage if you hit the entire wall and the well though.","type":"Helper","patch":"Kael'thas","realVotes":14},{"details":"If you are 100% sure that you can doing to die with a nuke : USE THE NUKE ! Waste it so the enemy team does not get it.","type":"Helper","patch":"Kael'thas","realVotes":36},{"details":"If you have a good pushing team, a high-mobility Hero with good camp clear can be a big deal on this map. For example, Anub'arak can easily clear all the camps on the map, pick up nukes, deploy them from dangerous locations, and then retreat to continue clearing camps.","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"Most people only hit the first row of walls and towers or only the keep.\nIf you aim well enough you can hit both and have a more destructive nuke.","type":"Helper","patch":"Kael'thas","realVotes":12},{"details":"If you use quickcast on all abilities, you can disable quickcast on nukes via hotkeys -> map specific abilities -> nuke.  This makes it easier to aim nukes.","type":"Helper","patch":"Kael'thas","realVotes":17},{"details":"Nukes do 50% more dmg after 18 minutes so hold on to your nukes on the 17th minute!","type":"Helper","patch":"Kael'thas","realVotes":-10},{"details":"If you play Auriel on this map remember to give the crown to a hero that is nuking right before the nuke hits for instant max energy.","type":"Helper","patch":"Kael'thas","realVotes":30},{"details":"The Nuke is easy to see coming. Don't aim purely for heroes unless you have good CC on your team (E.T.C, Malfurion, Zeartul if you time it right)","type":"Helper","patch":"Kael'thas","realVotes":4},{"details":"If you are trying to capture boss and the other team engages on you, a nuke is a great way to make sure your team maintains control of the point","type":"Helper","patch":"Kael'thas","realVotes":8},{"details":"Don't nuke mid unless it will grant your team an XP advantage. Always prioritize nuking top and bot, as there is a boss for each of those lanes. So if you can establish map dominance and soften up those 2 lanes, it will make the jobs of the bosses, Hellbats, and Goliaths a lot easier.","type":"Helper","patch":"Kael'thas","realVotes":7},{"details":"Don't waste your Nuke on the boss if the enemy team isn't there to contest. Use it instead when the boss is pushing. A nuke deals heavy structure damage but more importantly dissuades enemy heroes from attacking your boss, drastically increasing the power of the boss push.","type":"Helper","patch":"Kael'thas","realVotes":1}],"volskayafoundry":[{"details":"The Lost Vikings can be devastating on this map. They continue to capture the point while while their allies push structures or get camps. They can pilot one or both parts of (I think its currently bugged on 9/29/17) the Triglav Protector while simultaneously a soaking lane for xp. This large map enables them to do an impressive array of thing to help their team.","type":"Helper","patch":"Kael'thas","realVotes":19},{"details":"Not sure if it's a bug or intentional, but picking Artanis and going for Amateur Opponent and Titan Killer talents will have the %health damage AND flat bonus damage both count towards the Protector. In other words, using your W against the protector will have both of these talents trigger against it.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"The correct way of utilizing the Triglav protector is to have only one person pilot it, and have that person alternate between gunner and pilot.","type":"Helper","patch":"Kael'thas","realVotes":-5},{"details":"This map is an endurance game. Extremely long control-point timers, for which it is difficult to ever achieve a decisive victory, and extremely long timers BETWEEN control points, can lead to matches that last 20 or 25 minutes. Keep this in mind when making decisions. No matter what mistake just got made, you do NOT have to double-or-nothing behind it in an attempt to salvage the situation. There will almost certainly be a chance for you to recover later.","type":"Helper","patch":"Kael'thas","realVotes":3},{"details":"One option on this map, promoted by Tempo Storm's coach Kala amongst others, is to use the first Protector to clear out as many Fort walls as possible, because they are worth a ton of EXP. The second can then take the Forts in relative safety.","type":"Helper","patch":"Kael'thas","realVotes":2},{"details":"Another ideal for the Protectors: use the first one (at mid lane) to take top Fort, and the second (at top lane) to take top Keep. This will result in catapults sieging the enemy core, from top lane, during the third Triglav phase... which is at bot lane.","type":"Helper","patch":"Kael'thas","realVotes":2}]}